{  "id": "cairo",  "name": {    "en": "Cairo",    "ar": "القاهرة"  },  "region": "Lower Egypt / Cairo Area",  "coordinates": {    "latitude": 30.0444,    "longitude": 31.2357  },  "description": {    "en": "The bustling capital of Egypt, known for its rich history, vibrant culture, and iconic landmarks like the Pyramids of Giza (in nearby Giza) and the Sphinx.",    "ar": "عاصمة مصر الصاخبة، تشتهر بتاريخها الغني وثقافتها النابضة بالحياة ومعالمها الشهيرة مثل أهرامات الجيزة (في الجيزة المجاورة) وأبو الهول."  },  "history": {    "en": "Founded in 969 CE by the Fatimid dynasty, Cairo has been the capital of Egypt for over a thousand years. The city has been a center of political, cultural, and religious importance throughout its history.",    "ar": "تأسست في عام 969 ميلادية على يد الدولة الفاطمية، وكانت القاهرة عاصمة مصر لأكثر من ألف عام. كانت المدينة مركزًا للأهمية السياسية والثقافية والدينية طوال تاريخها."  },  "practical_info": {    "population": 21323000,    "area": 3085,    "timezone": "EET (UTC+2)",    "language": "Arabic",    "currency": "Egyptian Pound (EGP)",    "weather": "Hot desert climate with mild winters and hot summers. Rainfall is rare.",    "best_time_to_visit": "October to April, when temperatures are milder",    "transportation": {      "en": "Cairo has an extensive public transportation system including metro lines, buses, taxis, and ride-sharing services. The Cairo Metro is the most efficient way to navigate the city, especially during rush hours.",      "ar": "تمتلك القاهرة نظام نقل عام واسع يشمل خطوط المترو والحافلات وسيارات الأجرة وخدمات مشاركة الركوب. يعد مترو القاهرة أكثر الطرق كفاءة للتنقل في المدينة، خاصة خلال ساعات الذروة."    }  },  "highlights": [    {      "id": "pyramids_of_giza",      "name": {        "en": "Pyramids of Giza",        "ar": "أهرامات الجيزة"      }    },    {      "id": "khan_el_khalili",      "name": {        "en": "Khan el-Khalili Bazaar",        "ar": "خان الخليلي"      }    },    {      "id": "cairo_citadel",      "name": {        "en": "Cairo Citadel",        "ar": "قلعة صلاح الدين"      }    },    {      "id": "egyptian_museum",      "name": {        "en": "Egyptian Museum",        "ar": "المتحف المصري"      }    }  ],  "images": [    "cairo_pyramids.jpg",    "cairo_bazaar.jpg",    "cairo_citadel.jpg",    "cairo_skyline.jpg"  ],  "tags": ["city", "capital", "cairo", "lower_egypt", "nile"],  "last_updated": "2025-05-03T11:00:00Z"}