{  "id": "dahab",  "name": {    "en": "Dahab",    "ar": "دهب"  },  "type": "coastal_city",  "location": {    "region": "South Sinai Governorate",    "region_ar": "محافظة جنوب سيناء",    "coordinates": {      "latitude": 28.5002,      "longitude": 34.518    }  },  "description": {    "en": "Dahab, meaning 'gold' in Arabic, is a small coastal town situated on the southeast coast of the Sinai Peninsula, approximately 80 km northeast of Sharm El Sheikh. Once a Bedouin fishing village, Dahab has transformed into a laid-back, bohemian beach resort that attracts divers, windsurfers, and travelers seeking a more relaxed atmosphere than its busier neighbor Sharm El Sheikh. With its golden sandy beaches, stunning mountain backdrop, world-class diving sites including the famous Blue Hole, and unique blend of Bedouin culture and beach lifestyle, Dahab offers a distinctive Egyptian experience.",    "ar": "دهب، التي تعني 'الذهب' باللغة العربية، هي مدينة ساحلية صغيرة تقع على الساحل الجنوبي الشرقي لشبه جزيرة سيناء، على بعد حوالي 80 كم شمال شرق شرم الشيخ. كانت في السابق قرية صيد بدوية، وتحولت دهب إلى منتجع شاطئي بوهيمي مريح يجذب الغواصين وممارسي رياضة ركوب الأمواج والمسافرين الباحثين عن أجواء أكثر استرخاءً من جارتها الأكثر ازدحامًا شرم الشيخ. مع شواطئها الرملية الذهبية، والخلفية الجبلية المذهلة، ومواقع الغوص ذات المستوى العالمي بما في ذلك الثقب الأزرق الشهير، ومزيجها الفريد من الثقافة البدوية ونمط الحياة الشاطئي، توفر دهب تجربة مصرية مميزة."  },  "history": {    "en": "Dahab has been inhabited since ancient times, primarily by Bedouin tribes who fished and traded along the coast. The name 'Dahab,' meaning gold in Arabic, is thought to refer either to the golden sands of its beaches or to the area being rich in gold during ancient Egyptian times. For centuries, it remained a simple fishing village until the 1970s when it became popular with travelers looking for an alternative experience. Following Israel's withdrawal from the Sinai Peninsula in 1982, Egypt began developing Dahab's tourism infrastructure. However, unlike other Red Sea resorts, Dahab maintained its relaxed, bohemian character and connection to Bedouin culture, which has become its primary appeal.",    "ar": "كانت دهب مأهولة منذ العصور القديمة، بشكل أساسي من قبل القبائل البدوية التي كانت تصطاد وتتاجر على طول الساحل. يُعتقد أن اسم 'دهب'، الذي يعني الذهب باللغة العربية، يشير إما إلى الرمال الذهبية لشواطئها أو إلى كون المنطقة غنية بالذهب خلال العصور المصرية القديمة. لقرون، ظلت قرية صيد بسيطة حتى السبعينيات عندما أصبحت شائعة بين المسافرين الباحثين عن تجربة بديلة. بعد انسحاب إسرائيل من شبه جزيرة سيناء في عام 1982، بدأت مصر في تطوير البنية التحتية السياحية لدهب. ومع ذلك، على عكس منتجعات البحر الأحمر الأخرى، حافظت دهب على طابعها المريح والبوهيمي وارتباطها بالثقافة البدوية، والتي أصبحت جاذبيتها الرئيسية."  },  "attractions": [    {      "id": "blue_hole",      "name": {        "en": "The Blue Hole",        "ar": "الثقب الأزرق"      },      "type": "diving_site",      "description": {        "en": "A world-famous diving site consisting of a submarine sinkhole about 130 meters deep. The Blue Hole is known for its unique structure, including an arch at around 30 meters depth, and its challenging diving conditions that attract technical divers from around the world.",        "ar": "موقع غوص مشهور عالميًا يتكون من حفرة غارقة تحت الماء يبلغ عمقها حوالي 130 مترًا. يُعرف الثقب الأزرق بهيكله الفريد، بما في ذلك قوس على عمق حوالي 30 مترًا، وظروف الغوص الصعبة التي تجذب الغواصين التقنيين من جميع أنحاء العالم."      }    },    {      "id": "laguna",      "name": {        "en": "Laguna (Lagoon)",        "ar": "لاجونا (البحيرة)"      },      "type": "beach_water_sports",      "description": {        "en": "A shallow lagoon with perfect conditions for windsurfing and kitesurfing. The consistent winds and flat water make it an ideal spot for both beginners and advanced windsurfers, with several schools offering lessons and equipment rental.",        "ar": "بحيرة ضحلة ذات ظروف مثالية لركوب الأمواج بالألواح الشراعية وركوب الأمواج بالطائرات الورقية. توفر الرياح المستمرة والمياه المسطحة مكانًا مثاليًا لكل من المبتدئين وراكبي الأمواج المتقدمين، مع وجود العديد من المدارس التي تقدم دروسًا وتأجير معدات."      }    },    {      "id": "lighthouse_reef",      "name": {        "en": "Lighthouse Reef",        "ar": "شعاب المنارة"      },      "type": "diving_snorkeling",      "description": {        "en": "A popular shore diving and snorkeling site located at the center of Dahab's Masbat Bay. The reef is easily accessible, rich in marine life, and suitable for divers of all levels, making it an excellent location for beginners and training.",        "ar": "موقع شائع للغوص والغطس من الشاطئ يقع في وسط خليج مسبط في دهب. الشعاب المرجانية يسهل الوصول إليها، وغنية بالحياة البحرية، ومناسبة للغواصين من جميع المستويات، مما يجعلها موقعًا ممتازًا للمبتدئين والتدريب."      }    },    {      "id": "canyon",      "name": {        "en": "The Canyon",        "ar": "الأخدود"      },      "type": "diving_site",      "description": {        "en": "An underwater ravine that offers a thrilling dive through narrow passages and caverns. The Canyon is one of Dahab's most famous dive sites, starting shallow at 12 meters and extending down to 30 meters.",        "ar": "أخدود تحت الماء يوفر غوصًا مثيرًا عبر ممرات وكهوف ضيقة. الأخدود هو أحد أشهر مواقع الغوص في دهب، يبدأ ضحلًا عند 12 مترًا ويمتد لأسفل إلى 30 مترًا."      }    },    {      "id": "three_pools",      "name": {        "en": "Three Pools",        "ar": "ثلاث برك"      },      "type": "diving_site",      "description": {        "en": "A dive site featuring three distinct sandy basins surrounded by coral gardens, home to a variety of fish species including lionfish and octopuses. The site is accessible from shore and offers a relaxed dive suitable for all experience levels.",        "ar": "موقع غوص يضم ثلاث أحواض رملية متميزة محاطة بحدائق مرجانية، موطن لمجموعة متنوعة من أنواع الأسماك بما في ذلك أسماك الأسد والأخطبوطات. يمكن الوصول إلى الموقع من الشاطئ ويوفر غوصًا مريحًا مناسبًا لجميع مستويات الخبرة."      }    },    {      "id": "wadi_gnai",      "name": {        "en": "Wadi Gnai",        "ar": "وادي جناي"      },      "type": "desert_mountain",      "description": {        "en": "A scenic desert valley near Dahab offering hiking opportunities, rock climbing, and traditional Bedouin experiences. The dramatic landscape features colorful rock formations and provides panoramic views of the surrounding mountains and coastline.",        "ar": "وادٍ صحراوي خلاب بالقرب من دهب يوفر فرصًا للمشي لمسافات طويلة، وتسلق الصخور، والتجارب البدوية التقليدية. المناظر الطبيعية المذهلة تضم تكوينات صخرية ملونة وتوفر إطلالات بانورامية على الجبال المحيطة والساحل."      }    }  ],  "activities": [    {      "id": "diving",      "name": {        "en": "Scuba Diving and Snorkeling",        "ar": "الغوص والغطس"      },      "description": {        "en": "Dahab offers exceptional diving and snorkeling with numerous shore-accessible sites. The clear waters host vibrant coral reefs, diverse marine life, and famous sites like the Blue Hole and the Canyon.",        "ar": "توفر دهب غوصًا وغطسًا استثنائيًا مع العديد من المواقع التي يمكن الوصول إليها من الشاطئ. تستضيف المياه الصافية شعابًا مرجانية نابضة بالحياة، وحياة بحرية متنوعة، ومواقع شهيرة مثل الثقب الأزرق والأخدود."      }    },    {      "id": "windsurfing",      "name": {        "en": "Windsurfing and Kitesurfing",        "ar": "ركوب الأمواج الشراعية وركوب الأمواج بالطائرات الورقية"      },      "description": {        "en": "Dahab's lagoon area experiences consistent wind conditions, making it perfect for windsurfing and kitesurfing. Several schools offer equipment rental and lessons for beginners to advanced practitioners.",        "ar": "تشهد منطقة البحيرة في دهب ظروف رياح مستمرة، مما يجعلها مثالية لركوب الأمواج الشراعية وركوب الأمواج بالطائرات الورقية. تقدم العديد من المدارس تأجير المعدات والدروس للممارسين من المبتدئين إلى المتقدمين."      }    },    {      "id": "desert_trips",      "name": {        "en": "Desert Safaris and Bedouin Experiences",        "ar": "رحلات السفاري الصحراوية والتجارب البدوية"      },      "description": {        "en": "Explore the Sinai desert on camelback, jeep, or quad bike. Visit traditional Bedouin camps, enjoy star-gazing in the clear desert night, and experience authentic Bedouin cuisine and customs.",        "ar": "استكشف صحراء سيناء على ظهور الجمال، أو الجيب، أو الدراجات رباعية العجلات. قم بزيارة المخيمات البدوية التقليدية، واستمتع بمشاهدة النجوم في ليلة الصحراء الصافية، وتجربة المأكولات والعادات البدوية الأصيلة."      }    },    {      "id": "rock_climbing",      "name": {        "en": "Rock Climbing",        "ar": "تسلق الصخور"      },      "description": {        "en": "The nearby Wadi Gnai and surrounding mountainous areas offer excellent rock climbing opportunities for all skill levels, with stunning views of the Red Sea and Sinai landscape.",        "ar": "يوفر وادي جناي القريب والمناطق الجبلية المحيطة فرصًا ممتازة لتسلق الصخور لجميع مستويات المهارة، مع إطلالات خلابة على البحر الأحمر ومناظر سيناء الطبيعية."      }    },    {      "id": "yoga_retreats",      "name": {        "en": "Yoga and Wellness Retreats",        "ar": "معتكفات اليوجا والعافية"      },      "description": {        "en": "Dahab has become a popular destination for yoga and wellness retreats, with numerous centers offering classes, workshops, and multi-day programs in serene seaside settings.",        "ar": "أصبحت دهب وجهة شائعة لمعتكفات اليوجا والعافية، مع العديد من المراكز التي تقدم فصولًا وورش عمل وبرامج متعددة الأيام في أماكن هادئة على شاطئ البحر."      }    }  ],  "cuisine": {    "specialties": [      {        "name": {          "en": "Fresh Seafood",          "ar": "المأكولات البحرية الطازجة"        },        "description": {          "en": "Dahab's restaurants serve freshly caught fish and seafood from the Red Sea, often grilled and served with tahini, salad, and Egyptian bread.",          "ar": "تقدم مطاعم دهب الأسماك والمأكولات البحرية المصطادة حديثًا من البحر الأحمر، غالبًا ما تكون مشوية وتقدم مع الطحينة والسلطة والخبز المصري."        }      },      {        "name": {          "en": "Bedouin Tea",          "ar": "الشاي البدوي"        },        "description": {          "en": "Sweet black tea infused with herbs like sage and mint, traditionally served in small glasses and considered a symbol of Bedouin hospitality.",          "ar": "شاي أسود حلو ممزوج بأعشاب مثل المريمية والنعناع، يقدم تقليديًا في أكواب صغيرة ويعتبر رمزًا للضيافة البدوية."        }      },      {        "name": {          "en": "Kofta and Kebab",          "ar": "كفتة وكباب"        },        "description": {          "en": "Grilled meat dishes are popular in Dahab, often made from lamb or beef, seasoned with traditional spices and herbs.",          "ar": "أطباق اللحوم المشوية شائعة في دهب، غالبًا ما تكون مصنوعة من لحم الضأن أو البقر، ومتبلة بالتوابل والأعشاب التقليدية."        }      }    ],    "restaurants": [      {        "name": "El Dorado",        "type": "Seafood",        "price_range": "Moderate",        "description": "Popular beachfront restaurant known for fresh seafood and sunset views"      },      {        "name": "Ralph's German Bakery",        "type": "Bakery/Cafe",        "price_range": "Moderate",        "description": "Famous for homemade bread, pastries, and European breakfast options"      },      {        "name": "The Lighthouse Restaurant",        "type": "Egyptian/International",        "price_range": "Moderate",        "description": "Oceanfront dining with a varied menu serving both Egyptian and international dishes"      },      {        "name": "Ali Baba Restaurant",        "type": "Egyptian/Middle Eastern",        "price_range": "Budget",        "description": "Traditional Egyptian cuisine with Bedouin influences in a casual setting"      }    ]  },  "accommodations": [    {      "name": "Dahab Paradise",      "type": "Boutique Resort",      "price_range": "Upscale",      "description": "Elegant beachfront resort with a pool, restaurant, and stunning sea views"    },    {      "name": "Coral Coast Hotel",      "type": "Mid-range Hotel",      "price_range": "Moderate",      "description": "Comfortable hotel with direct beach access and an on-site dive center"    },    {      "name": "Bedouin Moon Hotel",      "type": "Mid-range Hotel",      "price_range": "Moderate",      "description": "Blend of modern amenities with traditional Bedouin aesthetics, featuring a pool and gardens"    },    {      "name": "Penguin Village",      "type": "Budget Hostel",      "price_range": "Budget",      "description": "Affordable dormitory and private rooms with a social atmosphere, popular with backpackers"    },    {      "name": "Red Sea Relax Resort",      "type": "Dive Resort",      "price_range": "Moderate",      "description": "Dedicated dive resort with pool, restaurant, and in-house dive center"    }  ],  "transportation": {    "getting_there": [      {        "method": "Bus",        "description": "Regular buses run from Cairo (10-12 hours) and Sharm El Sheikh (1.5 hours)"      },      {        "method": "Private Transfer",        "description": "Private taxis and shuttles available from Sharm El Sheikh Airport (1 hour)"      },      {        "method": "Flight + Transfer",        "description": "Fly to Sharm El Sheikh Airport, then take a taxi or shuttle to Dahab"      }    ],    "getting_around": [      {        "method": "Walking",        "description": "Dahab's main tourist area is compact and easily walkable"      },      {        "method": "Taxi",        "description": "Local taxis available for longer distances or trips to outlying attractions"      },      {        "method": "Bicycle",        "description": "Bicycle rentals available for exploring the town and nearby areas"      }    ]  },  "practical_info": {    "best_time_to_visit": "Spring (March-May) and autumn (September-November) offer the most pleasant temperatures. Summer (June-August) can be very hot but is ideal for water activities. Winter (December-February) is mild during the day but can be cool at night.",    "language": "Arabic is the official language, but English is widely spoken in tourist areas. Some locals also speak German, Italian, and Russian due to tourism.",    "currency": "Egyptian Pound (EGP). ATMs are available in town, and many establishments accept credit cards, though smaller vendors may prefer cash.",    "internet": "Wi-Fi is available in most hotels, cafes, and restaurants. Mobile data coverage is generally good.",    "dress_code": "Dahab is more relaxed than many Egyptian destinations, but modest dress is still appreciated when away from beach areas, especially when visiting local communities.",    "safety": "Dahab is generally safe for tourists. Normal precautions apply. Check travel advisories before visiting remote areas of the Sinai Peninsula."  },  "events": [    {      "name": {        "en": "Dahab Festival",        "ar": "مهرجان دهب"      },      "date": "May",      "description": {        "en": "Annual festival featuring watersports competitions, cultural performances, and environmental activities.",        "ar": "مهرجان سنوي يضم مسابقات الرياضات المائية والعروض الثقافية والأنشطة البيئية."      }    },    {      "name": {        "en": "Bedouin Full Moon Gatherings",        "ar": "تجمعات البدو في اكتمال القمر"      },      "date": "Monthly (full moon)",      "description": {        "en": "Traditional Bedouin music, dancing, and food under the full moon in the desert.",        "ar": "الموسيقى والرقص والطعام البدوي التقليدي تحت اكتمال القمر في الصحراء."      }    }  ],  "images": [    "dahab_promenade.jpg",    "blue_hole_dahab.jpg",    "dahab_lagoon_windsurfing.jpg",    "bedouin_camp_dahab.jpg",    "dahab_lighthouse_reef.jpg",    "dahab_sunset.jpg"  ]}