{  "id": "hurghada",  "name": {    "en": "Hurghada",    "ar": "الغردقة"  },  "region": "Red Sea Coast",  "coordinates": {    "latitude": 27.2579,    "longitude": 33.8116  },  "description": {    "en": "A major beach resort town on Egypt's Red Sea coast, known for scuba diving, snorkeling, water sports, and nightlife. Stretched along the coast with numerous hotels and tourist facilities.",    "ar": "مدينة منتجع شاطئية رئيسية على ساحل البحر الأحمر في مصر، تشتهر بالغوص والغطس والرياضات المائية والحياة الليلية. تمتد على طول الساحل مع العديد من الفنادق والمرافق السياحية."  },  "history": {    "en": "Originally a small fishing village, Hurghada experienced rapid growth starting in the 1980s due to tourism investment, transforming it into a major international resort destination.",    "ar": "كانت في الأصل قرية صيد صغيرة، وشهدت الغردقة نموًا سريعًا بدءًا من الثمانينيات بسبب الاستثمار السياحي، مما حولها إلى وجهة منتجع دولية رئيسية."  },  "practical_info": {    "population": null,    "area": null,    "timezone": "EET (UTC+2)",    "language": "Arabic, English, Russian, German widely spoken in tourist areas",    "currency": "Egyptian Pound (EGP)",    "weather": "Hot desert climate, year-round sun, very hot summers, warm winters. Low humidity.",    "best_time_to_visit": "Year-round for sun, but Spring (March-May) and Autumn (September-November) offer the most comfortable temperatures.",    "transportation": {      "en": "Hurghada International Airport (HRG), local taxis, minibuses, hotel shuttles. Ride-sharing apps are available.",      "ar": "مطار الغردقة الدولي (HRG)، سيارات أجرة محلية، حافلات صغيرة، حافلات نقل مكوكية للفنادق. تتوفر تطبيقات مشاركة الركوب."    }  },  "highlights": [    {      "id": "diving_snorkeling_hurghada",      "name": {        "en": "Diving and Snorkeling",        "ar": "الغوص والغطس"      }    },    {      "id": "giftun_islands",      "name": {        "en": "Giftun Islands (Boat Trip)",        "ar": "جزر الجفتون (رحلة بالقارب)"      }    },    {      "id": "hurghada_marina",      "name": {        "en": "Hurghada Marina",        "ar": "مارينا الغردقة"      }    },    {      "id": "desert_safari_hurghada",      "name": {        "en": "Desert Safari",        "ar": "سفاري الصحراء"      }    }  ],  "images": [    "hurghada_beach.jpg",    "hurghada_diving.jpg",    "hurghada_marina.jpg",    "hurghada_desert.jpg"  ],  "tags": [    "city",    "hurghada",    "red_sea",    "beach",    "resort",    "diving",    "snorkeling",    "water_sports"  ],  "seasonal_info": {    "high_season": {      "months": ["December", "January", "February", "July", "August"],      "notes": {        "en": "Winter months attract European tourists seeking warm weather. Summer sees domestic tourism and visitors from Gulf countries.",        "ar": "تجذب أشهر الشتاء السياح الأوروبيين الباحثين عن الطقس الدافئ. يشهد الصيف السياحة المحلية والزوار من دول الخليج."      }    },    "low_season": {      "months": ["May", "June", "September", "October", "November"],      "notes": {        "en": "Shoulder seasons offer pleasant weather and fewer crowds, often with better rates at hotels.",        "ar": "توفر مواسم الكتف طقسًا لطيفًا وحشودًا أقل، غالبًا مع أسعار أفضل في الفنادق."      }    },    "best_for_diving": {      "months": ["March", "April", "May", "September", "October", "November"],      "notes": {        "en": "These months offer the best visibility and comfortable water temperatures for diving.",        "ar": "توفر هذه الأشهر أفضل رؤية ودرجات حرارة مياه مريحة للغوص."      }    }  },  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}