{
  "id": "luxor",
  "name": {
    "en": "Luxor",
    "ar": "الأقصر"
  },
  "region": {
    "en": "Upper Egypt",
    "ar": "صعيد مصر"
  },
  "coordinates": {
    "latitude": 25.6872,
    "longitude": 32.6396
  },
  "description": {
    "en": "Luxor is a city in Upper Egypt and the capital of Luxor Governorate. The city is located on the east bank of the Nile River and was the ancient Egyptian city of Thebes, the glorious capital of Egypt during the New Kingdom. Luxor has frequently been called the 'world's greatest open-air museum', with ruins of temple complexes at Karnak and Luxor, and the Valley of the Kings and Valley of the Queens on the opposite bank of the Nile.",
    "ar": "الأقصر هي مدينة في صعيد مصر وعاصمة محافظة الأقصر. تقع المدينة على الضفة الشرقية لنهر النيل وكانت مدينة طيبة المصرية القديمة، العاصمة المجيدة لمصر خلال المملكة الحديثة. غالبًا ما كانت الأقصر تسمى \"أعظم متحف مفتوح في العالم\"، مع أطلال مجمعات المعابد في الكرنك والأقصر، ووادي الملوك ووادي الملكات على الضفة المقابلة للنيل."
  },
  "history": {
    "en": "Luxor was the ancient city of Thebes, the great capital of Upper Egypt during the New Kingdom. The city was dedicated to the god Amun, and was the location of the annual Opet Festival. The earliest monuments in Luxor date back to the Eleventh Dynasty of Egypt, when the city was called Wsit (\"City\") and was the capital of Upper Egypt.",
    "ar": "كانت الأقصر المدينة القديمة طيبة، العاصمة العظيمة لصعيد مصر خلال المملكة الحديثة. كانت المدينة مكرسة للإله آمون، وكانت موقع مهرجان أوبت السنوي. تعود أقدم المعالم في الأقصر إلى الأسرة الحادية عشرة المصرية، عندما كانت تسمى المدينة وسيت (\"المدينة\") وكانت عاصمة صعيد مصر."
  },
  "practical_info": {
    "population": 507000,
    "area": 416,
    "timezone": "EET (UTC+2)",
    "language": "Arabic",
    "currency": "Egyptian Pound (EGP)",
    "weather": "Hot desert climate. Very hot summers and mild winters. Almost no rainfall throughout the year.",
    "best_time_to_visit": "October to April, to avoid the extreme summer heat",
    "transportation": {
      "en": "Luxor is compact enough to walk around the east bank, but to visit the many sites on the west bank you'll need transportation. Options include taxis, horse-drawn carriages (calèches), boats to cross the Nile, and organized tours. Bicycle rental is also popular for exploring the west bank.",
      "ar": "الأقصر صغيرة بما يكفي للتجول في الضفة الشرقية سيراً على الأقدام، ولكن لزيارة المواقع العديدة في الضفة الغربية ستحتاج إلى وسيلة نقل. تشمل الخيارات سيارات الأجرة والعربات التي تجرها الخيول (الحنطور) والقوارب لعبور النيل والجولات المنظمة. يعد استئجار الدراجات شائعًا أيضًا لاستكشاف الضفة الغربية."
    }
  },
  "highlights": [
    {
      "id": "karnak_temple",
      "name": {
        "en": "Karnak Temple",
        "ar": "معبد الكرنك"
      }
    },
    {
      "id": "luxor_temple",
      "name": {
        "en": "Luxor Temple",
        "ar": "معبد الأقصر"
      }
    },
    {
      "id": "valley_of_kings",
      "name": {
        "en": "Valley of the Kings",
        "ar": "وادي الملوك"
      }
    },
    {
      "id": "hatshepsut_temple",
      "name": {
        "en": "Temple of Hatshepsut",
        "ar": "معبد حتشبسوت"
      }
    },
    {
      "id": "luxor_museum",
      "name": {
        "en": "Luxor Museum",
        "ar": "متحف الأقصر"
      }
    }
  ],
  "images": [
    "luxor_aerial.jpg",
    "karnak_temple.jpg",
    "valley_of_kings.jpg"
  ],
  "tags": [
    "ancient",
    "temples",
    "tombs",
    "historical",
    "nile",
    "archaeology"
  ],
  "last_updated": "2025-04-24T18:45:12.759537"
}