{  "id": "marsa_matruh",  "name": {    "en": "Marsa Matruh",    "ar": "مرسى مطروح"  },  "region": {    "en": "Matrouh Governorate",    "ar": "محافظة مطروح"  },  "coordinates": {    "latitude": 31.3543,    "longitude": 27.2373  },  "description": {    "en": "Marsa Matruh is a major tourist resort and port city located on Egypt's Mediterranean coast, about 240 km west of Alexandria. The city is renowned for its pristine white sandy beaches and crystal-clear waters in shades of blue and turquoise. Protected by a natural bay, the calm waters make it an ideal destination for families. The city serves as a gateway to the Western Desert and is steeped in history, having been an important strategic location during World War II.",    "ar": "مرسى مطروح هي منتجع سياحي رئيسي ومدينة ميناء تقع على ساحل البحر المتوسط في مصر، على بعد حوالي 240 كم غرب الإسكندرية. تشتهر المدينة بشواطئها الرملية البيضاء النقية ومياهها الصافية بألوان زرقاء وفيروزية. محمية بخليج طبيعي، تجعل المياه الهادئة منها وجهة مثالية للعائلات. تعد المدينة بوابة للصحراء الغربية وغارقة في التاريخ، حيث كانت موقعًا استراتيجيًا مهمًا خلال الحرب العالمية الثانية."  },  "history": {    "en": "Marsa Matruh has a rich history dating back to ancient times. It was known as 'Paraetonium' during the Ptolemaic era and was an important harbor for the ancient Egyptians, Greeks, and Romans. The city was a significant base for Erwin Rommel's Afrika Korps during World War II, and remnants of the war can still be found in the area, including Rommel's Cave, which served as his headquarters. The region is also home to the Siwa Oasis and has been inhabited by Berber tribes, particularly the Awlad Ali Bedouins, who have their own distinct culture and traditions.",    "ar": "تتمتع مرسى مطروح بتاريخ غني يعود إلى العصور القديمة. كانت تُعرف باسم 'باريتونيوم' خلال العصر البطلمي وكانت ميناءً مهمًا للمصريين القدماء واليونانيين والرومان. كانت المدينة قاعدة مهمة لفيلق أفريقيا التابع لإروين روميل خلال الحرب العالمية الثانية، ولا تزال بقايا الحرب موجودة في المنطقة، بما في ذلك كهف روميل، الذي كان بمثابة مقر له. المنطقة هي أيضًا موطن لواحة سيوة وكانت مأهولة بقبائل البربر، وخاصة بدو أولاد علي، الذين لديهم ثقافتهم وتقاليدهم المميزة."  },  "practical_info": {    "population": 120000,    "area": 200,    "timezone": "EET (UTC+2)",    "language": "Arabic",    "currency": "Egyptian Pound (EGP)",    "weather": "Mediterranean climate with hot, dry summers and mild, slightly rainy winters.",    "best_time_to_visit": "May to October for beach activities, when temperatures are warm and rainfall is minimal",    "transportation": {      "en": "Marsa Matruh has an airport with domestic flights from Cairo. The city is also accessible by train from Alexandria and Cairo. Within the city, taxis and microbuses are the main forms of transportation.",      "ar": "تمتلك مرسى مطروح مطارًا مع رحلات داخلية من القاهرة. يمكن الوصول إلى المدينة أيضًا بالقطار من الإسكندرية والقاهرة. داخل المدينة، تعد سيارات الأجرة والحافلات الصغيرة وسائل النقل الرئيسية."    }  },  "highlights": [    {      "id": "cleopatra_beach",      "name": {        "en": "Cleopatra Beach",        "ar": "شاطئ كليوباترا"      }    },    {      "id": "agiba_beach",      "name": {        "en": "Agiba Beach",        "ar": "شاطئ عجيبة"      }    },    {      "id": "rommel_cave",      "name": {        "en": "Rommel's Cave Museum",        "ar": "متحف كهف روميل"      }    },    {      "id": "marsa_matruh_national_museum",      "name": {        "en": "Marsa Matruh National Museum",        "ar": "المتحف القومي بمرسى مطروح"      }    }  ],  "activities": [    {      "id": "swimming",      "name": {        "en": "Swimming",        "ar": "السباحة"      },      "description": {        "en": "Enjoy the calm, crystal-clear waters of the Mediterranean Sea in protected bays.",        "ar": "استمتع بالمياه الهادئة والصافية للبحر المتوسط في الخلجان المحمية."      }    },    {      "id": "desert_safari",      "name": {        "en": "Desert Safari",        "ar": "سفاري الصحراء"      },      "description": {        "en": "Explore the Western Desert with guided tours to nearby oases and Bedouin communities.",        "ar": "استكشف الصحراء الغربية مع جولات مصحوبة بمرشدين إلى الواحات القريبة والمجتمعات البدوية."      }    },    {      "id": "historical_tours",      "name": {        "en": "Historical Tours",        "ar": "جولات تاريخية"      },      "description": {        "en": "Visit World War II sites including Rommel's Cave and military remnants.",        "ar": "زيارة مواقع الحرب العالمية الثانية بما في ذلك كهف روميل وبقايا عسكرية."      }    }  ],  "beaches": [    {      "id": "cleopatra_beach",      "name": {        "en": "Cleopatra Beach",        "ar": "شاطئ كليوباترا"      },      "description": {        "en": "Named after the legendary queen who is said to have bathed here, this beach features natural rock formations creating pools of crystal-clear water. The beach is famous for its white sand and the natural bath of Cleopatra, a rock pool where it's said the queen herself once swam.",        "ar": "سمي على اسم الملكة الأسطورية التي يقال إنها استحمت هنا، يتميز هذا الشاطئ بتكوينات صخرية طبيعية تخلق برك من المياه الصافية. يشتهر الشاطئ برماله البيضاء وحمام كليوباترا الطبيعي، وهو بركة صخرية يقال إن الملكة نفسها سبحت فيها ذات مرة."      }    },    {      "id": "agiba_beach",      "name": {        "en": "Agiba Beach",        "ar": "شاطئ عجيبة"      },      "description": {        "en": "Agiba, which means 'miracle' in Arabic, is a small beach surrounded by cliffs and can only be accessed through a narrow path descending from the top of the cliff. The beach is known for its extraordinary beauty and secluded nature.",        "ar": "عجيبة، والتي تعني 'معجزة' بالعربية، هي شاطئ صغير محاط بالمنحدرات ولا يمكن الوصول إليه إلا من خلال مسار ضيق ينحدر من أعلى المنحدر. يشتهر الشاطئ بجماله الاستثنائي وطبيعته المنعزلة."      }    },    {      "id": "al_gharam_beach",      "name": {        "en": "Al-Gharam Beach",        "ar": "شاطئ الغرام"      },      "description": {        "en": "Al-Gharam (Love) Beach is one of the most popular beaches in Marsa Matruh, known for its soft white sand and clear blue waters. It's well-equipped with facilities and services for visitors.",        "ar": "شاطئ الغرام هو أحد أكثر الشواطئ شعبية في مرسى مطروح، ويشتهر برماله البيضاء الناعمة ومياهه الزرقاء الصافية. إنه مجهز جيدًا بالمرافق والخدمات للزوار."      }    }  ],  "images": [    "marsa_matruh_beach.jpg",    "cleopatra_beach.jpg",    "agiba_beach.jpg",    "rommel_cave.jpg"  ],  "tags": ["beach", "mediterranean", "historical", "desert", "bedouin", "world war II"],  "seasonal_info": {    "high_season": {      "months": ["June", "July", "August", "September"],      "notes": {        "en": "Summer months are the peak tourist season, especially for domestic tourists and visitors from Arab countries.",        "ar": "أشهر الصيف هي ذروة موسم السياحة، خاصة للسياح المحليين والزوار من الدول العربية."      }    },    "low_season": {      "months": ["November", "December", "January", "February", "March", "April"],      "notes": {        "en": "Winter months are quiet with cooler temperatures and occasional rainfall. Many facilities may be closed.",        "ar": "أشهر الشتاء هادئة مع درجات حرارة أكثر برودة وهطول أمطار متقطع. قد تكون العديد من المرافق مغلقة."      }    },    "best_for_swimming": {      "months": ["June", "July", "August", "September"],      "notes": {        "en": "Water temperatures are most comfortable during these months.",        "ar": "درجات حرارة المياه هي الأكثر راحة خلال هذه الأشهر."      }    }  },  "cultural_notes": {    "en": "Marsa Matruh is home to Bedouin communities with their own distinct traditions. The region is known for its Bedouin handicrafts, music, and cuisine. Visitors should respect local customs, particularly regarding modest dress away from beach areas.",    "ar": "مرسى مطروح هي موطن للمجتمعات البدوية ذات التقاليد المميزة الخاصة بها. تشتهر المنطقة بالحرف اليدوية البدوية والموسيقى والمطبخ. يجب على الزوار احترام العادات المحلية، خاصة فيما يتعلق بالملابس المحتشمة بعيدًا عن مناطق الشاطئ."  },  "last_updated": "2025-05-04T12:00:00Z"}