{  "id": "sharm_el_sheikh",  "name": {    "en": "Sharm El Sheikh",    "ar": "شرم الشيخ"  },  "region": "Sinai Peninsula / Red Sea Coast",  "coordinates": {    "latitude": 27.9158,    "longitude": 34.3296  },  "description": {    "en": "A world-renowned resort city at the southern tip of the Sinai Peninsula, famous for its sheltered sandy beaches, clear waters, coral reefs, luxury resorts, and vibrant nightlife. A major hub for diving and snorkeling, particularly at Ras Muhammad National Park.",    "ar": "مدينة منتجعات ذات شهرة عالمية تقع على الطرف الجنوبي لشبه جزيرة سيناء، تشتهر بشواطئها الرملية المحمية ومياهها الصافية وشعابها المرجانية ومنتجعاتها الفاخرة وحياتها الليلية النابضة بالحياة. مركز رئيسي للغوص والغطس، لا سيما في محمية رأس محمد الوطنية."  },  "history": {    "en": "Transformed from a small fishing village into a major port and naval base after the Suez Crisis, and later developed rapidly as a tourist destination from the 1980s onwards, especially focusing on diving tourism.",    "ar": "تحولت من قرية صيد صغيرة إلى ميناء رئيسي وقاعدة بحرية بعد أزمة السويس، ثم تطورت بسرعة كوجهة سياحية من الثمانينيات فصاعدًا، مع التركيز بشكل خاص على سياحة الغوص."  },  "practical_info": {    "population": null,    "area": null,    "timezone": "EET (UTC+2)",    "language": "Arabic, English, Russian, Italian widely spoken in tourist areas",    "currency": "Egyptian Pound (EGP)",    "weather": "Hot desert climate, similar to Hurghada. Very hot summers, warm winters, minimal rain.",    "best_time_to_visit": "Year-round for sun, but Spring (March-May) and Autumn (September-November) offer the most comfortable temperatures for activities.",    "transportation": {      "en": "Sharm El Sheikh International Airport (SSH), local taxis (blue and white), minibuses, hotel shuttles. Ride-sharing apps available.",      "ar": "مطار شرم الشيخ الدولي (SSH)، سيارات أجرة محلية (زرقاء وبيضاء)، حافلات صغيرة، حافلات نقل مكوكية للفنادق. تتوفر تطبيقات مشاركة الركوب."    }  },  "highlights": [    {      "id": "ras_muhammad_national_park",      "name": {        "en": "Ras Muhammad National Park",        "ar": "محمية رأس محمد الوطنية"      }    },    {      "id": "naama_bay",      "name": {        "en": "Naama Bay",        "ar": "خليج نعمة"      }    },    {      "id": "soho_square",      "name": {        "en": "SOHO Square",        "ar": "سوهو سكوير"      }    },    {      "id": "old_market_sharm",      "name": {        "en": "Old Market (Sharm Old Town)",        "ar": "السوق القديم (شرم القديمة)"      }    }  ],  "images": [    "sharm_naama_bay.jpg",    "sharm_ras_muhammad.jpg",    "sharm_soho_square.jpg",    "sharm_diving.jpg"  ],  "tags": [    "city",    "sharm_el_sheikh",    "sinai",    "red_sea",    "beach",    "resort",    "diving",    "snorkeling",    "nightlife",    "luxury"  ],  "seasonal_info": {    "high_season": {      "months": ["December", "January", "February", "July", "August"],      "notes": {        "en": "Winter months attract European tourists seeking warm weather. Summer sees domestic tourism and visitors from Gulf countries.",        "ar": "تجذب أشهر الشتاء السياح الأوروبيين الباحثين عن الطقس الدافئ. يشهد الصيف السياحة المحلية والزوار من دول الخليج."      }    },    "low_season": {      "months": ["May", "June", "September", "October", "November"],      "notes": {        "en": "Shoulder seasons offer pleasant weather and fewer crowds, often with better rates at hotels.",        "ar": "توفر مواسم الكتف طقسًا لطيفًا وحشودًا أقل، غالبًا مع أسعار أفضل في الفنادق."      }    },    "best_for_diving": {      "months": ["March", "April", "May", "September", "October", "November"],      "notes": {        "en": "These months offer the best visibility and comfortable water temperatures for diving.",        "ar": "توفر هذه الأشهر أفضل رؤية ودرجات حرارة مياه مريحة للغوص."      }    }  },  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}