{  "id": "siwa_oasis",  "name": {    "en": "Siwa Oasis",    "ar": "واحة سيوة"  },  "region": {    "en": "Matrouh Governorate",    "ar": "محافظة مطروح"  },  "coordinates": {    "latitude": 29.2032,    "longitude": 25.5195  },  "description": {    "en": "Siwa Oasis is an urban oasis in Egypt, located between the Qattara Depression and the Great Sand Sea in the Western Desert, nearly 50 km east of the Libyan border, and 560 km from Cairo. Known for its unique culture, ancient mud-brick fortresses, abundant date palms, freshwater springs, and olive groves, Siwa offers a distinctly different experience from the rest of Egypt. The Siwan people have their own culture and customs, and speak a Berber language called Siwi, though Arabic is also spoken.",    "ar": "واحة سيوة هي واحة حضرية في مصر، تقع بين منخفض القطارة وبحر الرمال العظيم في الصحراء الغربية، على بعد حوالي 50 كم شرق الحدود الليبية، و560 كم من القاهرة. تشتهر بثقافتها الفريدة وقلاعها القديمة المبنية من الطوب اللبن ونخيل التمر الوفير والينابيع العذبة وبساتين الزيتون، وتقدم سيوة تجربة مختلفة تمامًا عن بقية مصر. يمتلك السيويون ثقافتهم وعاداتهم الخاصة، ويتحدثون لغة بربرية تسمى السيوية، على الرغم من أن اللغة العربية تُستخدم أيضًا."  },  "history": {    "en": "Siwa's history dates back to ancient Egypt, with evidence of habitation since at least the 10th millennium BCE. The oasis was an important center for the cult of Amun, and was home to the famous Oracle of Amun, which was consulted by Alexander the Great in 331 BCE. According to legend, the oracle confirmed Alexander's divine status. Throughout history, Siwa remained relatively isolated, allowing it to develop and maintain its unique Berber culture. The oasis was officially incorporated into Egypt in the 19th century, but its remote location has helped preserve many of its traditions. The ancient fortress town of Shali, built in the 13th century from kershef (salt rock and mud), still dominates the center of Siwa, though much of it has eroded over time due to rainfall.",    "ar": "يعود تاريخ سيوة إلى مصر القديمة، مع أدلة على وجود سكان منذ الألفية العاشرة قبل الميلاد على الأقل. كانت الواحة مركزًا مهمًا لعبادة آمون، وكانت موطنًا لمعبد آمون الشهير، الذي استشاره الإسكندر الأكبر في عام 331 قبل الميلاد. وفقًا للأسطورة، أكد المعبد المكانة الإلهية للإسكندر. على مر التاريخ، ظلت سيوة معزولة نسبيًا، مما سمح لها بتطوير والحفاظ على ثقافتها البربرية الفريدة. تم ضم الواحة رسميًا إلى مصر في القرن التاسع عشر، لكن موقعها النائي ساعد في الحفاظ على العديد من تقاليدها. لا تزال مدينة شالي القلعة القديمة، التي بنيت في القرن الثالث عشر من الكرشيف (صخر الملح والطين)، تهيمن على وسط سيوة، على الرغم من أن الكثير منها قد تآكل بمرور الوقت بسبب هطول الأمطار."  },  "practical_info": {    "population": 33000,    "area": 1088,    "timezone": "EET (UTC+2)",    "language": "Siwi (Berber dialect) and Arabic",    "currency": "Egyptian Pound (EGP)",    "weather": "Desert climate with hot summers and mild winters. Very little rainfall throughout the year.",    "best_time_to_visit": "October to April, when temperatures are milder",    "transportation": {      "en": "Siwa can be reached by bus from Marsa Matruh or by hiring a private car. Within the oasis, bicycles, donkey carts, and tuk-tuks are common forms of transportation. Many hotels offer bicycle rentals.",      "ar": "يمكن الوصول إلى سيوة بالحافلة من مرسى مطروح أو باستئجار سيارة خاصة. داخل الواحة، تعد الدراجات وعربات الحمير والتوك توك وسائل نقل شائعة. تقدم العديد من الفنادق خدمة تأجير الدراجات."    }  },  "highlights": [    {      "id": "shali_fortress",      "name": {        "en": "Shali Fortress",        "ar": "قلعة شالي"      }    },    {      "id": "temple_of_oracle",      "name": {        "en": "Temple of the Oracle",        "ar": "معبد الوحي"      }    },    {      "id": "cleopatras_bath",      "name": {        "en": "Cleopatra's Bath",        "ar": "حمام كليوباترا"      }    },    {      "id": "siwa_salt_lakes",      "name": {        "en": "Siwa Salt Lakes",        "ar": "بحيرات الملح في سيوة"      }    }  ],  "activities": [    {      "id": "desert_safari",      "name": {        "en": "Desert Safari",        "ar": "سفاري الصحراء"      },      "description": {        "en": "Explore the Great Sand Sea with 4x4 vehicles, sandboarding, and overnight camping under the stars.",        "ar": "استكشف بحر الرمال العظيم بسيارات الدفع الرباعي والتزلج على الرمال والتخييم ليلاً تحت النجوم."      }    },    {      "id": "salt_lake_swimming",      "name": {        "en": "Salt Lake Swimming",        "ar": "السباحة في بحيرة الملح"      },      "description": {        "en": "Float effortlessly in the highly saline waters of Siwa's salt lakes, known for their therapeutic properties.",        "ar": "الطفو بسهولة في المياه شديدة الملوحة لبحيرات الملح في سيوة، المعروفة بخصائصها العلاجية."      }    },    {      "id": "cultural_experiences",      "name": {        "en": "Cultural Experiences",        "ar": "تجارب ثقافية"      },      "description": {        "en": "Visit Siwan homes, learn about traditional crafts, and experience local music and dance.",        "ar": "زيارة المنازل السيوية، والتعرف على الحرف التقليدية، وتجربة الموسيقى والرقص المحلي."      }    }  ],  "natural_attractions": [    {      "id": "great_sand_sea",      "name": {        "en": "Great Sand Sea",        "ar": "بحر الرمال العظيم"      },      "description": {        "en": "An immense area of sand dunes stretching between Egypt and Libya, offering spectacular desert landscapes and opportunities for adventure.",        "ar": "منطقة شاسعة من الكثبان الرملية تمتد بين مصر وليبيا، وتوفر مناظر صحراوية رائعة وفرصًا للمغامرة."      }    },    {      "id": "bir_wahed",      "name": {        "en": "Bir Wahed",        "ar": "بئر واحد"      },      "description": {        "en": "A hot spring located about 15 km from Siwa town, surrounded by sand dunes. The sulfurous water is believed to have healing properties.",        "ar": "ينبوع ساخن يقع على بعد حوالي 15 كم من مدينة سيوة، محاط بالكثبان الرملية. يُعتقد أن الماء الكبريتي له خصائص علاجية."      }    },    {      "id": "fatnas_island",      "name": {        "en": "Fatnas Island (Fantasy Island)",        "ar": "جزيرة فطناس (جزيرة الخيال)"      },      "description": {        "en": "A palm-fringed peninsula jutting into the salt lake, famous for its spectacular sunsets and serene atmosphere.",        "ar": "شبه جزيرة محاطة بالنخيل تبرز في بحيرة الملح، مشهورة بغروب الشمس الرائع وأجوائها الهادئة."      }    }  ],  "historical_sites": [    {      "id": "temple_of_oracle",      "name": {        "en": "Temple of the Oracle",        "ar": "معبد الوحي"      },      "description": {        "en": "Dating back to the 26th Dynasty (664-525 BCE), this temple was dedicated to Amun and housed the famous oracle consulted by Alexander the Great. The temple sits atop a hill in the area known as Aghurmi, offering panoramic views of the oasis.",        "ar": "يعود تاريخه إلى الأسرة السادسة والعشرين (664-525 قبل الميلاد)، وكان هذا المعبد مخصصًا للإله آمون واحتضن المعبد الشهير الذي استشاره الإسكندر الأكبر. يقع المعبد فوق تل في المنطقة المعروفة باسم أغورمي، ويوفر إطلالات بانورامية على الواحة."      }    },    {      "id": "shali_fortress",      "name": {        "en": "Shali Fortress",        "ar": "قلعة شالي"      },      "description": {        "en": "Built in the 13th century, this mud-brick fortress was the original settlement of Siwa. Though largely in ruins due to heavy rains in the 1920s, it remains an impressive sight and a symbol of Siwa's unique architecture.",        "ar": "بنيت في القرن الثالث عشر، كانت هذه القلعة المبنية من الطوب اللبن المستوطنة الأصلية لسيوة. على الرغم من أنها في حالة خراب إلى حد كبير بسبب الأمطار الغزيرة في عشرينيات القرن الماضي، إلا أنها لا تزال منظرًا مثيرًا للإعجاب ورمزًا للعمارة الفريدة في سيوة."      }    },    {      "id": "mountain_of_dead",      "name": {        "en": "Mountain of the Dead (Gebel al-Mawta)",        "ar": "جبل الموتى"      },      "description": {        "en": "A hill containing numerous rock-cut tombs dating from the 26th Dynasty, Ptolemaic, and Roman periods. Some tombs feature well-preserved paintings and hieroglyphics.",        "ar": "تل يحتوي على العديد من المقابر المحفورة في الصخر التي تعود إلى الأسرة السادسة والعشرين والعصرين البطلمي والروماني. تحتوي بعض المقابر على لوحات ونقوش هيروغليفية محفوظة جيدًا."      }    }  ],  "cultural_aspects": {    "traditional_crafts": {      "en": "Siwa is known for its distinctive handicrafts, particularly embroidery, basketry, and silver jewelry. The Siwan embroidery features colorful geometric patterns and is used to decorate traditional women's clothing. Palm fronds are woven into baskets, mats, and other household items.",      "ar": "تشتهر سيوة بحرفها اليدوية المميزة، خاصة التطريز وصناعة السلال والمجوهرات الفضية. يتميز التطريز السيوي بأنماط هندسية ملونة ويستخدم لتزيين ملابس النساء التقليدية. يتم نسج سعف النخيل في سلال وحصير وغيرها من الأدوات المنزلية."    },    "cuisine": {      "en": "Siwan cuisine features unique dishes influenced by Berber traditions. Dates and olives, the main agricultural products, feature prominently. Specialties include 'Takila' (a soup made with herbs and spices), 'Meshwi' (slow-roasted lamb), and various date-based desserts.",      "ar": "يتميز المطبخ السيوي بأطباق فريدة متأثرة بالتقاليد البربرية. التمور والزيتون، المنتجات الزراعية الرئيسية، تحتل مكانة بارزة. تشمل التخصصات 'تكيلة' (حساء مصنوع من الأعشاب والتوابل)، و'مشوي' (لحم ضأن مشوي ببطء)، ومختلف الحلويات التي تعتمد على التمر."    },    "festivals": {      "en": "Siwa celebrates several traditional festivals, including the Tourism and Date Festival in November, which showcases local culture, music, and the date harvest. The three-day Siyaha Festival (Festival of Peace) is a traditional Siwan celebration where disputes are resolved and important community decisions are made.",      "ar": "تحتفل سيوة بالعديد من المهرجانات التقليدية، بما في ذلك مهرجان السياحة والتمور في نوفمبر، الذي يعرض الثقافة المحلية والموسيقى وحصاد التمور. مهرجان السياحة الذي يستمر ثلاثة أيام (مهرجان السلام) هو احتفال سيوي تقليدي حيث يتم حل النزاعات واتخاذ قرارات مجتمعية مهمة."    }  },  "images": [    "siwa_oasis_panorama.jpg",    "shali_fortress.jpg",    "siwa_salt_lake.jpg",    "temple_of_oracle.jpg"  ],  "tags": ["oasis", "desert", "berber", "historical", "natural springs", "salt lakes", "cultural"],  "seasonal_info": {    "high_season": {      "months": ["October", "November", "December", "January", "February", "March", "April"],      "notes": {        "en": "Winter and spring months offer pleasant temperatures ideal for exploring the oasis and surrounding desert.",        "ar": "توفر أشهر الشتاء والربيع درجات حرارة لطيفة مثالية لاستكشاف الواحة والصحراء المحيطة."      }    },    "low_season": {      "months": ["May", "June", "July", "August", "September"],      "notes": {        "en": "Summer months can be extremely hot, making outdoor activities challenging during daylight hours.",        "ar": "يمكن أن تكون أشهر الصيف شديدة الحرارة، مما يجعل الأنشطة الخارجية صعبة خلال ساعات النهار."      }    },    "special_events": {      "date_festival": {        "months": ["November"],        "description": {          "en": "The annual Tourism and Date Festival celebrates the date harvest and Siwan culture.",          "ar": "يحتفل مهرجان السياحة والتمور السنوي بحصاد التمور والثقافة السيوية."        }      }    }  },  "last_updated": "2025-05-04T13:00:00Z"}