{  "arts_and_music": {    "traditional_music": {      "classical_arabic": {        "name": {          "en": "Classical Arabic Music",          "ar": "الموسيقى العربية الكلاسيكية"        },        "description": {          "en": "Traditional Arabic music featuring complex melodic modes (maqamat) and rhythmic patterns. Famous performers include Umm Kulthum, Mohammed Abdel Wahab, and Abdel Halim Hafez.",          "ar": "الموسيقى العربية التقليدية التي تتميز بأنماط لحنية معقدة (مقامات) وأنماط إيقاعية. من المؤدين المشهورين أم كلثوم ومحمد عبد الوهاب وعبد الحليم حافظ."        },        "instruments": [          {            "name": {              "en": "Oud",              "ar": "العود"            },            "description": {              "en": "A pear-shaped stringed instrument, ancestor of the European lute",              "ar": "آلة وترية على شكل كمثرى، سلف العود الأوروبي"            }          },          {            "name": {              "en": "Qanun",              "ar": "القانون"            },            "description": {              "en": "A flat trapezoidal stringed instrument played on the lap",              "ar": "آلة وترية مسطحة شبه منحرفة تُعزف على الحضن"            }          },          {            "name": {              "en": "Ney",              "ar": "الناي"            },            "description": {              "en": "A reed flute with a distinctive breathy sound",              "ar": "ناي قصبي بصوت نفخي مميز"            }          }        ]      },      "folk_music": {        "name": {          "en": "Egyptian Folk Music",          "ar": "الموسيقى الشعبية المصرية"        },        "description": {          "en": "Regional folk music varies by area, including Saidi music from Upper Egypt, Delta folk traditions, and Nubian music in the south.",          "ar": "تختلف الموسيقى الشعبية الإقليمية حسب المنطقة، بما في ذلك موسيقى الصعيد من صعيد مصر، وتقاليد الدلتا الشعبية، والموسيقى النوبية في الجنوب."        },        "styles": [          {            "name": {              "en": "Saidi Music",              "ar": "الموسيقى الصعيدية"            },            "description": {              "en": "Features the mizmar (folk oboe) and tabla baladi (folk drum), often accompanied by stick dancing",              "ar": "تتميز بالمزمار (مزمار شعبي) والطبلة البلدي (طبل شعبي)، غالباً ما يصاحبها رقص العصا"            }          },          {            "name": {              "en": "Nubian Music",              "ar": "الموسيقى النوبية"            },            "description": {              "en": "Characterized by unique scales and rhythms, often featuring the tar (frame drum) and kisir (Nubian lyre)",              "ar": "تتميز بمقامات وإيقاعات فريدة، غالباً ما تضم الطار (دف) والكسير (قيثارة نوبية)"            }          }        ]      }    },    "traditional_dance": {      "types": [        {          "name": {            "en": "Raqs Sharqi (Belly Dance)",            "ar": "رقص شرقي"          },          "description": {            "en": "Traditional Middle Eastern dance emphasizing complex movements of the torso. Professional performances are common in hotels and Nile cruise ships.",            "ar": "رقص شرقي تقليدي يركز على حركات معقدة للجذع. العروض الاحترافية شائعة في الفنادق والبواخر النيلية."          }        },        {          "name": {            "en": "Tahtib",            "ar": "التحطيب"          },          "description": {            "en": "Traditional stick fighting/dancing from Upper Egypt, historically a martial art that evolved into a cultural performance",            "ar": "رقص/قتال بالعصي تقليدي من صعيد مصر، كان تاريخياً فناً قتالياً تطور إلى عرض ثقافي"          }        },        {          "name": {            "en": "Tannoura",            "ar": "التنورة"          },          "description": {            "en": "Sufi whirling dance performed with colorful skirts, often seen at cultural shows and religious festivals",            "ar": "رقص الدوران الصوفي يؤدى بتنانير ملونة، يشاهد غالباً في العروض الثقافية والمهرجانات الدينية"          }        }      ]    },    "visual_arts": {      "traditional_crafts": [        {          "name": {            "en": "Khayamiya",            "ar": "الخيامية"          },          "description": {            "en": "Traditional textile art of appliqué work, creating decorative tent panels with intricate geometric and Arabic calligraphic designs",            "ar": "فن نسيجي تقليدي من التطريز، يصنع لوحات خيام زخرفية بتصاميم هندسية وخط عربي معقدة"          }        },        {          "name": {            "en": "Pottery",            "ar": "الفخار"          },          "description": {            "en": "Traditional Egyptian pottery, particularly from Fayoum and Upper Egypt, featuring distinctive designs and techniques",            "ar": "الفخار المصري التقليدي، خاصة من الفيوم وصعيد مصر، يتميز بتصاميم وتقنيات مميزة"          }        },        {          "name": {            "en": "Metalwork",            "ar": "أشغال المعادن"          },          "description": {            "en": "Intricate brass and copper work, including lanterns, trays, and decorative items with Islamic geometric patterns",            "ar": "أعمال النحاس والنحاس الأصفر المعقدة، بما في ذلك الفوانيس والصواني والقطع الزخرفية بأنماط هندسية إسلامية"          }        }      ],      "calligraphy": {        "name": {          "en": "Arabic Calligraphy",          "ar": "الخط العربي"        },        "description": {          "en": "Traditional art form featuring various styles of Arabic script, used in decoration, architecture, and religious texts",          "ar": "شكل فني تقليدي يضم أنماطًا مختلفة من الخط العربي، يستخدم في الزخرفة والعمارة والنصوص الدينية"        },        "styles": ["Thuluth", "Naskh", "Diwani", "Ruq'ah"]      }    },    "contemporary_arts": {      "description": {        "en": "Modern Egyptian arts blend traditional elements with contemporary global influences. Cairo's vibrant art scene includes galleries, modern dance companies, and experimental music groups.",        "ar": "تمزج الفنون المصرية الحديثة العناصر التقليدية مع التأثيرات العالمية المعاصرة. يشمل المشهد الفني النابض بالحياة في القاهرة المعارض وفرق الرقص الحديث ومجموعات الموسيقى التجريبية."      },      "venues": [        {          "name": {            "en": "Cairo Opera House",            "ar": "دار الأوبرا المصرية"          },          "description": {            "en": "Main venue for classical music, ballet, and opera performances",            "ar": "المكان الرئيسي لعروض الموسيقى الكلاسيكية والباليه والأوبرا"          }        },        {          "name": {            "en": "Townhouse Gallery",            "ar": "جاليري تاون هاوس"          },          "description": {            "en": "Contemporary art space showcasing experimental and avant-garde works",            "ar": "مساحة فنية معاصرة تعرض الأعمال التجريبية والطليعية"          }        }      ]    }  }}