{
  "id": "winter_palace_luxor",
  "name": {
    "en": "Sofitel Winter Palace Luxor",
    "ar": "سوفيتيل وينتر بالاس الأقصر"
  },
  "type": "luxury_heritage_hotel",
  "stars": 5,
  "location": {
    "city": "Luxor",
    "city_ar": "الأقصر",
    "address": "Corniche El Nile Street, Luxor",
    "address_ar": "شارع كورنيش النيل، الأقصر",
    "coordinates": {
      "latitude": 25.6997,
      "longitude": 32.6383
    }
  },
  "description": {
    "en": "The Sofitel Winter Palace is a historic British colonial-era 5-star luxury hotel located on the banks of the Nile River in Luxor, Egypt. Built in 1886, this legendary hotel has hosted royalty, dignitaries, and famous figures including Agatha Christie, who wrote 'Death on the Nile' during her stay. The hotel combines Victorian splendor with modern luxury, featuring opulent interiors, lush tropical gardens, and stunning views of the Nile. With its rich history, elegant architecture, and prime location near Luxor's ancient monuments, the Winter Palace offers guests a truly unique and sophisticated Egyptian experience.",
    "ar": "سوفيتيل وينتر بالاس هو فندق فاخر تاريخي من فئة الخمس نجوم يعود للعصر الاستعماري البريطاني ويقع على ضفاف نهر النيل في الأقصر، مصر. بُني هذا الفندق الأسطوري عام 1886، وقد استضاف ملوكًا ووجهاء وشخصيات مشهورة من بينهم أجاثا كريستي، التي كتبت رواية 'موت على النيل' خلال إقامتها. يجمع الفندق بين الروعة الفيكتورية والفخامة الحديثة، ويتميز بديكورات داخلية فخمة وحدائق استوائية خضراء وإطلالات مذهلة على النيل. مع تاريخه الغني وهندسته المعمارية الأنيقة وموقعه المتميز بالقرب من المعالم الأثرية القديمة في الأقصر، يقدم وينتر بالاس للضيوف تجربة مصرية فريدة ومتطورة حقًا."
  },
  "amenities": [
    "Free WiFi",
    "Outdoor swimming pool",
    "Garden",
    "Terrace",
    "Restaurant",
    "Bar/Lounge",
    "Room service",
    "24-hour front desk",
    "Currency exchange",
    "Concierge service",
    "Laundry service",
    "Dry cleaning",
    "Meeting/banquet facilities",
    "Business center",
    "Babysitting/child services",
    "Fax/photocopying",
    "Ironing service",
    "Non-smoking rooms",
    "Elevator",
    "Air conditioning"
  ],
  "price_range": {
    "min": "$150",
    "max": "$800",
    "currency": "USD"
  },
  "rooms": [
    {
      "type": {
        "en": "Classic Room",
        "ar": "غرفة كلاسيك"
      },
      "description": {
        "en": "Elegant rooms decorated in classic style with garden views and luxurious amenities.",
        "ar": "غرف أنيقة مزينة بطراز كلاسيكي مع إطلالات على الحديقة ووسائل راحة فاخرة."
      },
      "price": "$150-200"
    },
    {
      "type": {
        "en": "Nile View Room",
        "ar": "غرفة بإطلالة على النيل"
      },
      "description": {
        "en": "Luxurious rooms offering stunning views of the Nile River and historic decor.",
        "ar": "غرف فاخرة توفر إطلالات مذهلة على نهر النيل وديكور تاريخي."
      },
      "price": "$250-350"
    },
    {
      "type": {
        "en": "Heritage Suite",
        "ar": "جناح التراث"
      },
      "description": {
        "en": "Spacious suites with separate living areas, traditional colonial decor, and magnificent Nile views.",
        "ar": "أجنحة فسيحة مع مناطق معيشة منفصلة وديكور استعماري تقليدي وإطلالات رائعة على النيل."
      },
      "price": "$400-600"
    },
    {
      "type": {
        "en": "Royal Suite",
        "ar": "الجناح الملكي"
      },
      "description": {
        "en": "Opulent historical suites where famous guests have stayed, featuring antique furniture and panoramic Nile views.",
        "ar": "أجنحة تاريخية فخمة حيث أقام ضيوف مشهورون، تتميز بأثاث عتيق وإطلالات بانورامية على النيل."
      },
      "price": "$600-800"
    }
  ],
  "dining": [
    {
      "name": {
        "en": "1886 Restaurant",
        "ar": "مطعم ١٨٨٦"
      },
      "description": {
        "en": "Fine dining restaurant serving French cuisine in a magnificent historical setting, featuring crystal chandeliers and classical décor.",
        "ar": "مطعم راقٍ يقدم المأكولات الفرنسية في محيط تاريخي رائع، يتميز بثريات كريستالية وديكور كلاسيكي."
      },
      "cuisine": [
        "French",
        "International"
      ]
    },
    {
      "name": {
        "en": "La Corniche",
        "ar": "لا كورنيش"
      },
      "description": {
        "en": "All-day dining restaurant offering international and Egyptian cuisine with views of the Nile.",
        "ar": "مطعم يقدم الطعام طوال اليوم ويقدم المأكولات العالمية والمصرية مع إطلالات على النيل."
      },
      "cuisine": [
        "International",
        "Egyptian"
      ]
    },
    {
      "name": {
        "en": "Royal Bar",
        "ar": "الرويال بار"
      },
      "description": {
        "en": "A historical bar where many famous guests have enjoyed cocktails and beverages in a colonial atmosphere.",
        "ar": "بار تاريخي حيث استمتع العديد من الضيوف المشهورين بالكوكتيلات والمشروبات في أجواء استعمارية."
      },
      "cuisine": [
        "Beverages",
        "Snacks"
      ]
    }
  ],
  "contact": {
    "phone": "+20 95 2380422",
    "email": "h1661@sofitel.com",
    "website": "https://all.accor.com/hotel/1661/index.en.shtml"
  },
  "images": [
    "winter_palace_exterior.jpg",
    "winter_palace_garden.jpg",
    "winter_palace_nile_view.jpg",
    "winter_palace_lobby.jpg",
    "winter_palace_room.jpg",
    "winter_palace_dining.jpg"
  ],
  "tags": [
    "luxury",
    "historical",
    "heritage",
    "Nile",
    "colonial",
    "5-star",
    "Agatha Christie"
  ],
  "last_updated": "2025-04-19T16:25:27.305978"
}