{  "id": "red_sea_diving_sites",  "name": {    "en": "Red Sea Diving Sites",    "ar": "مواقع الغوص في البحر الأحمر"  },  "type": "diving_destination",  "location": {    "region": "Red Sea Governorate",    "region_ar": "محافظة البحر الأحمر",    "coordinates": {      "latitude": 27.2579,      "longitude": 33.8116    }  },  "description": {    "en": "The Egyptian Red Sea is home to some of the world's most spectacular diving sites, featuring pristine coral reefs, dramatic drop-offs, colorful marine life, and historic shipwrecks. With excellent visibility, warm waters year-round, and extraordinary biodiversity, the Red Sea has earned its reputation as a premier diving destination that caters to divers of all experience levels.",    "ar": "يضم البحر الأحمر المصري بعضًا من أكثر مواقع الغوص إثارة في العالم، حيث تتميز بالشعاب المرجانية النقية، والمنحدرات الدراماتيكية، والحياة البحرية الملونة، وحطام السفن التاريخية. مع رؤية ممتازة، ومياه دافئة على مدار العام، وتنوع بيولوجي استثنائي، اكتسب البحر الأحمر سمعته كوجهة غوص رئيسية تلبي احتياجات الغواصين من جميع مستويات الخبرة."  },  "history": {    "en": "The Red Sea has been a significant maritime route throughout history, connecting the Mediterranean world to the Indian Ocean trade networks. Many ancient shipwrecks lie on its seabed, including the famous SS Thistlegorm, a British armed merchant navy ship sunk during World War II. The recognition of the Red Sea's unique marine ecosystem as a diving paradise began in the 1950s, and it has since developed into a major tourist destination with dedicated dive resorts and facilities.",    "ar": "كان البحر الأحمر طريقًا بحريًا مهمًا عبر التاريخ، يربط عالم البحر المتوسط بشبكات تجارة المحيط الهندي. يرقد العديد من حطام السفن القديمة في قاع البحر، بما في ذلك سفينة إس إس ثيستلغورم الشهيرة، وهي سفينة تجارية مسلحة بريطانية غرقت خلال الحرب العالمية الثانية. بدأ الاعتراف بالنظام البيئي البحري الفريد للبحر الأحمر كجنة للغوص في الخمسينيات من القرن الماضي، وتطور منذ ذلك الحين إلى وجهة سياحية رئيسية مع منتجعات ومرافق غوص مخصصة."  },  "practical_info": {    "best_time_to_visit": "Year-round, with optimal conditions from April to November. July and August are peak tourist seasons with higher temperatures.",    "duration": "Varies from single dives (1-2 hours) to full diving safaris (5-7 days)",    "equipment_rental": "Available at all major dive centers in Hurghada, Sharm El Sheikh, Dahab, and Marsa Alam",    "certification": "PADI, SSI, and other international certification courses widely available",    "facilities": [      "Dive centers with professional instructors",      "Equipment rental shops",      "Liveaboard boats",      "Hyperbaric chambers for emergency treatment",      "Dedicated diving resorts"    ],    "accessibility": {      "en": "Most dive sites require boat access. Beginners can enjoy house reefs and shallow sites, while advanced divers can explore deeper wrecks and drift dives. Many dive operators provide facilities for divers with disabilities.",      "ar": "تتطلب معظم مواقع الغوص الوصول بالقارب. يمكن للمبتدئين الاستمتاع بالشعاب المرجانية القريبة من الشاطئ والمواقع الضحلة، بينما يمكن للغواصين المتقدمين استكشاف حطام السفن الأعمق وغوص التيارات. توفر العديد من شركات الغوص مرافق للغواصين ذوي الإعاقة."    },    "visitor_tips": {      "en": "Book dives in advance during peak season. Check your insurance covers diving activities. Respect marine life and never touch or stand on coral. Follow your dive guide's instructions for safety. Consider a liveaboard trip to access remote dive sites.",      "ar": "احجز رحلات الغوص مسبقًا خلال موسم الذروة. تأكد من أن تأمينك يغطي أنشطة الغوص. احترم الحياة البحرية ولا تلمس أو تقف على المرجان أبدًا. اتبع تعليمات مرشد الغوص الخاص بك للسلامة. فكر في رحلة على متن سفينة غوص للوصول إلى مواقع الغوص النائية."    }  },  "top_diving_sites": [    {      "id": "brothers_islands",      "name": {        "en": "The Brothers Islands",        "ar": "جزر الإخوة"      },      "location": "Near Hurghada, 67 km offshore",      "depth": "5-40 meters",      "difficulty": "Advanced",      "description": {        "en": "Two small islands surrounded by steep walls dropping to great depths. Famous for encounters with oceanic whitetip and hammerhead sharks, as well as vibrant coral growth and the Numidia and Aida wrecks.",        "ar": "جزيرتان صغيرتان محاطتان بجدران شديدة الانحدار تنخفض إلى أعماق كبيرة. مشهورة بلقاءات مع أسماك القرش ذات الزعنفة البيضاء المحيطية وأسماك القرش المطرقة، بالإضافة إلى نمو المرجان النابض بالحياة وحطام نوميديا وعايدة."      }    },    {      "id": "ras_mohammed",      "name": {        "en": "Ras Mohammed National Park",        "ar": "محمية رأس محمد الوطنية"      },      "location": "Southern tip of Sinai Peninsula",      "depth": "5-30 meters",      "difficulty": "Beginner to Advanced",      "description": {        "en": "Egypt's first national park offers world-class diving with sites like Shark Reef and Yolanda Reef. The convergence of Gulf currents creates nutrient-rich waters supporting exceptional marine biodiversity.",        "ar": "توفر أول حديقة وطنية في مصر غوصًا عالميًا بمواقع مثل شعاب القرش وشعاب يولاندا. يخلق التقاء تيارات الخليج مياهًا غنية بالمغذيات تدعم تنوعًا بيولوجيًا بحريًا استثنائيًا."      }    },    {      "id": "thistlegorm",      "name": {        "en": "SS Thistlegorm Wreck",        "ar": "حطام سفينة ثيستلغورم"      },      "location": "Strait of Gubal, Northern Red Sea",      "depth": "15-30 meters",      "difficulty": "Intermediate",      "description": {        "en": "One of the world's most famous wreck dives, this WWII British supply ship was sunk in 1941 and still contains motorcycles, trucks, rifles, and railway carriages. An underwater museum frozen in time.",        "ar": "أحد أشهر مواقع غوص حطام السفن في العالم، غرقت سفينة الإمداد البريطانية هذه من الحرب العالمية الثانية في عام 1941 وما زالت تحتوي على دراجات نارية وشاحنات وبنادق وعربات سكك حديدية. متحف تحت الماء متجمد في الزمن."      }    },    {      "id": "blue_hole_dahab",      "name": {        "en": "Blue Hole",        "ar": "الثقب الأزرق"      },      "location": "Dahab",      "depth": "Surface to 100+ meters",      "difficulty": "Beginner to Technical",      "description": {        "en": "A famous submarine sinkhole with a 'cathedral-like' archway at 30 meters. The rim area is perfect for beginners, while the arch and deeper areas are for technical divers only. Known for excellent visibility and unique topography.",        "ar": "حفرة غارقة شهيرة بقوس 'يشبه الكاتدرائية' على عمق 30 مترًا. منطقة الحافة مثالية للمبتدئين، بينما القوس والمناطق الأعمق هي للغواصين التقنيين فقط. معروفة برؤيتها الممتازة وتضاريسها الفريدة."      }    },    {      "id": "daedalus_reef",      "name": {        "en": "Daedalus Reef",        "ar": "شعاب ديدالوس"      },      "location": "Southern Red Sea",      "depth": "5-40 meters",      "difficulty": "Advanced",      "description": {        "en": "A remote, offshore reef with a lighthouse, known for schooling hammerhead sharks, oceanic whitetips, and giant trevallies. Strong currents and deep walls make this suitable for experienced divers.",        "ar": "شعاب مرجانية نائية في عرض البحر مع منارة، معروفة بأسراب أسماك القرش المطرقة، وأسماك القرش ذات الزعنفة البيضاء المحيطية، وأسماك التريفالي العملاقة. التيارات القوية والجدران العميقة تجعل هذا مناسبًا للغواصين ذوي الخبرة."      }    }  ],  "marine_life": [    {      "category": "Fish Species",      "examples": [        "Napoleon Wrasse",        "Blue-spotted Stingrays",        "Lionfish",        "Clownfish",        "Moray Eels",        "Butterflyfish",        "Barracuda"      ]    },    {      "category": "Sharks",      "examples": [        "Oceanic Whitetip",        "Hammerhead",        "Grey Reef Shark",        "Thresher Shark",        "Whale Shark (seasonal)"      ]    },    {      "category": "Coral Types",      "examples": [        "Table Coral",        "Brain Coral",        "Fire Coral",        "Soft Coral",        "Gorgonian Fans"      ]    },    {      "category": "Other Marine Life",      "examples": [        "Dolphins",        "Dugongs (rare)",        "Sea Turtles",        "Giant Moray Eels",        "Nudibranchs",        "Cuttlefish",        "Octopus"      ]    }  ],  "conservation": {    "en": "The Red Sea's unique marine ecosystem faces threats from climate change, coastal development, and tourism pressure. Various conservation initiatives are in place, including marine protected areas, coral restoration projects, and sustainable tourism practices. Divers are encouraged to follow responsible diving guidelines to help preserve this natural treasure for future generations.",    "ar": "يواجه النظام البيئي البحري الفريد للبحر الأحمر تهديدات من تغير المناخ والتنمية الساحلية وضغط السياحة. هناك العديد من مبادرات الحفظ قائمة، بما في ذلك المناطق البحرية المحمية ومشاريع استعادة الشعاب المرجانية وممارسات السياحة المستدامة. يتم تشجيع الغواصين على اتباع إرشادات الغوص المسؤول للمساعدة في الحفاظ على هذا الكنز الطبيعي للأجيال القادمة."  },  "dive_operators": [    {      "name": "Emperor Divers",      "locations": ["Hurghada", "Marsa Alam", "El Gouna"],      "website": "www.emperordivers.com"    },    {      "name": "Camel Dive Club",      "locations": ["Sharm El Sheikh"],      "website": "www.cameldive.com"    },    {      "name": "Dive-Urge",      "locations": ["Dahab"],      "website": "www.dive-urge.com"    },    {      "name": "Blue Ocean Diving Center",      "locations": ["Hurghada"],      "website": "www.blueocean-divingcenter.com"    },    {      "name": "Red Sea Diving Safari",      "locations": ["Marsa Alam", "Wadi Lahami", "Marsa Shagra"],      "website": "www.redsea-divingsafari.com"    }  ],  "images": [    "red_sea_coral_garden.jpg",    "blue_hole_dahab.jpg",    "thistlegorm_wreck.jpg",    "brothers_islands_sharks.jpg",    "ras_mohammed_reef.jpg"  ]}