{  "festivals_and_holidays": [    {      "id": "ramadan",      "name": {        "en": "Ramadan",        "ar": "رمضان"      },      "type": "religious",      "timing": "Ninth month of the Islamic calendar",      "duration": "30 days",      "description": {        "en": "The holy month of fasting in Islam, where Muslims fast from dawn to sunset. Cities come alive at night with special decorations, food, and social gatherings. Many restaurants adjust their hours, and there are special evening festivities.",        "ar": "شهر الصيام المقدس في الإسلام، حيث يصوم المسلمون من الفجر حتى غروب الشمس. تنبض المدن بالحياة ليلاً مع الزينة الخاصة والطعام والتجمعات الاجتماعية. تعدل العديد من المطاعم ساعات عملها، وهناك احتفالات مسائية خاصة."      },      "tourist_considerations": {        "en": "While tourists are not expected to fast, they should be respectful by not eating or drinking in public during daylight hours. Many restaurants may be closed during the day but offer special evening meals (Iftar). It's a great time to experience local culture and festivities.",        "ar": "في حين أنه لا يُتوقع من السياح الصيام، يجب عليهم احترام الصائمين بعدم الأكل أو الشرب في الأماكن العامة خلال ساعات النهار. قد تكون العديد من المطاعم مغلقة خلال النهار ولكنها تقدم وجبات مسائية خاصة (إفطار). إنه وقت رائع لتجربة الثقافة المحلية والاحتفالات."      }    },    {      "id": "eid_al_fitr",      "name": {        "en": "Eid al-Fitr",        "ar": "عيد الفطر"      },      "type": "religious",      "timing": "First three days of Shawwal (after Ramadan)",      "duration": "3 days",      "description": {        "en": "A major Islamic holiday marking the end of Ramadan. Celebrated with special prayers, family gatherings, new clothes, and festive meals. Cities are decorated, and there are public celebrations and events.",        "ar": "عيد إسلامي رئيسي يحتفل بنهاية رمضان. يُحتفل به بصلوات خاصة وتجمعات عائلية وملابس جديدة ووجبات احتفالية. تُزين المدن وتقام احتفالات وفعاليات عامة."      },      "tourist_considerations": {        "en": "Many businesses may be closed during the first few days. Public transportation might be crowded. It's a festive time to experience local culture, but advance planning is recommended for accommodations and travel.",        "ar": "قد تكون العديد من الشركات مغلقة خلال الأيام الأولى. قد تكون وسائل النقل العام مزدحمة. إنه وقت احتفالي لتجربة الثقافة المحلية، ولكن يُنصح بالتخطيط المسبق للإقامة والسفر."      }    },    {      "id": "eid_al_adha",      "name": {        "en": "Eid al-Adha",        "ar": "عيد الأضحى"      },      "type": "religious",      "timing": "10th day of Dhu al-Hijjah",      "duration": "4 days",      "description": {        "en": "The 'Festival of Sacrifice' commemorates Prophet Ibrahim's willingness to sacrifice his son. Celebrated with special prayers, sacrificial offerings, and family gatherings. Meat from sacrificed animals is shared with family, friends, and those in need.",        "ar": "يحتفل 'عيد الأضحى' بذكرى استعداد النبي إبراهيم للتضحية بابنه. يُحتفل به بصلوات خاصة وتقديم الأضاحي والتجمعات العائلية. يتم مشاركة لحوم الأضاحي مع العائلة والأصدقاء والمحتاجين."      },      "tourist_considerations": {        "en": "Similar to Eid al-Fitr, expect business closures and crowded transportation. Book accommodations in advance. A unique time to experience traditional customs and celebrations.",        "ar": "مثل عيد الفطر، توقع إغلاق الأعمال وازدحام وسائل النقل. احجز أماكن الإقامة مسبقًا. وقت فريد لتجربة العادات والاحتفالات التقليدية."      }    },    {      "id": "coptic_christmas",      "name": {        "en": "Coptic Christmas",        "ar": "عيد الميلاد القبطي"      },      "type": "religious",      "timing": "January 7th",      "duration": "1 day",      "description": {        "en": "Celebration of Christmas by Egypt's Coptic Christian community. Features special church services, family gatherings, and festive meals. Many churches hold beautiful midnight masses on Christmas Eve.",        "ar": "احتفال عيد الميلاد من قبل مجتمع الأقباط المسيحيين في مصر. يتميز بخدمات كنسية خاصة وتجمعات عائلية ووجبات احتفالية. تقيم العديد من الكنائس قداسات منتصف الليل الجميلة في ليلة عيد الميلاد."      },      "tourist_considerations": {        "en": "A unique opportunity to experience Coptic Christian traditions. Many churches welcome respectful visitors for services. Some businesses may be closed, particularly in areas with large Coptic populations.",        "ar": "فرصة فريدة لتجربة التقاليد المسيحية القبطية. ترحب العديد من الكنائس بالزوار المحترمين للخدمات. قد تكون بعض الشركات مغلقة، خاصة في المناطق ذات التجمعات القبطية الكبيرة."      }    },    {      "id": "sham_el_nessim",      "name": {        "en": "Sham el-Nessim",        "ar": "شم النسيم"      },      "type": "cultural",      "timing": "Monday following Coptic Easter",      "duration": "1 day",      "description": {        "en": "An ancient Egyptian spring festival celebrated by all Egyptians regardless of religion. The name means 'smelling the breeze.' Families traditionally spend the day outdoors in parks or by the Nile, enjoying picnics with traditional foods like colored eggs and fermented fish (feseekh).",        "ar": "مهرجان ربيعي مصري قديم يحتفل به جميع المصريين بغض النظر عن ديانتهم. يعني الاسم 'شم النسيم.' تقضي العائلات تقليديًا اليوم في الهواء الطلق في الحدائق أو بجانب النيل، ويستمتعون بالنزهات مع الأطعمة التقليدية مثل البيض الملون والسمك المخمر (الفسيخ)."      },      "tourist_considerations": {        "en": "A great opportunity to experience a uniquely Egyptian celebration. Public spaces will be very crowded. Try traditional foods but be cautious with feseekh as it requires acquired taste and careful preparation.",        "ar": "فرصة رائعة لتجربة احتفال مصري فريد. ستكون الأماكن العامة مزدحمة جدًا. جرب الأطعمة التقليدية ولكن كن حذرًا مع الفسيخ حيث يتطلب ذوقًا مكتسبًا وإعدادًا دقيقًا."      }    },    {      "id": "moulid_el_nabi",      "name": {        "en": "Mawlid al-Nabi",        "ar": "المولد النبوي"      },      "type": "religious",      "timing": "12th day of Rabi' al-awwal (Islamic calendar)",      "duration": "1 day",      "description": {        "en": "Celebration of Prophet Muhammad's birthday. Features special prayers, religious gatherings, and distribution of sweets. Streets are decorated with lights and banners, and special sweets shops set up temporary stalls.",        "ar": "احتفال بعيد ميلاد النبي محمد. يتميز بصلوات خاصة وتجمعات دينية وتوزيع الحلويات. تُزين الشوارع بالأضواء واللافتات، وتقام أكشاك مؤقتة لمحلات الحلويات الخاصة."      },      "tourist_considerations": {        "en": "A colorful time to experience Islamic traditions. Many areas will have festive atmospheres with special sweet treats available. Some businesses may close early or for the whole day.",        "ar": "وقت ملون لتجربة التقاليد الإسلامية. ستكون العديد من المناطق ذات أجواء احتفالية مع توفر الحلويات الخاصة. قد تغلق بعض الشركات مبكرًا أو طوال اليوم."      }    }  ]}