{  "id": "abu_simbel",  "name": {    "en": "Abu Simbel",    "ar": "أبو سمبل"  },  "type": "historical_monument",  "location": {    "city": "Aswan",    "city_ar": "أسوان",    "region": "Upper Egypt",    "region_ar": "صعيد مصر",    "coordinates": {      "latitude": 22.3372,      "longitude": 31.6258    }  },  "description": {    "en": "Twin temples carved out of a mountainside, built by Ramses II to commemorate his victory at the Battle of Kadesh.",    "ar": "معبدان منحوتان في جانب جبل، بناهما رمسيس الثاني للاحتفال بانتصاره في معركة قادش."  },  "history": {    "en": "Constructed during the reign of Pharaoh Ramses II (around 1264 BCE), the temples were relocated in the 1960s to save them from submersion during the creation of Lake Nasser. This UNESCO-led relocation project is considered one of the greatest archaeological engineering challenges in history.",    "ar": "بنيت خلال فترة حكم الفرعون رمسيس الثاني (حوالي 1264 قبل الميلاد)، تم نقل المعابد في ستينيات القرن العشرين لإنقاذها من الغرق أثناء إنشاء بحيرة ناصر. يعتبر مشروع النقل هذا الذي قادته اليونسكو واحدًا من أكبر التحديات الهندسية الأثرية في التاريخ."  },  "era": "New Kingdom",  "practical_info": {    "opening_hours": "5:00 AM - 6:00 PM (October to April), 5:00 AM - 7:00 PM (May to September)",    "ticket_prices": {      "foreigners": {        "adults": "240 EGP",        "students": "120 EGP"      },      "egyptians": {        "adults": "30 EGP",        "students": "15 EGP"      }    },    "best_time_to_visit": "Early morning to catch the sunrise or in the afternoon for the best lighting for photos.",    "duration": "2-3 hours",    "visitor_tips": {      "en": "Abu Simbel is located about 280 km from Aswan. Most visitors arrive via organized tours, which typically leave Aswan around 4 AM to arrive for the sunrise. The site can also be reached by plane.",      "ar": "يقع أبو سمبل على بعد حوالي 280 كم من أسوان. يصل معظم الزوار عبر جولات منظمة، والتي عادة ما تغادر أسوان حوالي الساعة 4 صباحًا للوصول عند شروق الشمس. يمكن الوصول إلى الموقع أيضًا بالطائرة."    }  },  "highlights": [    {      "id": "great_temple",      "name": {        "en": "Great Temple of Ramses II",        "ar": "المعبد الكبير لرمسيس الثاني"      },      "description": {        "en": "The larger of the two temples, dedicated to Ramses II himself and the Egyptian deities Amun, Ra-Horakhty, and Ptah. The facade features four colossal statues of Ramses II, each 20 meters tall.",        "ar": "أكبر المعبدين، مكرس لرمسيس الثاني نفسه والآلهة المصرية آمون ورع-حوراختي وبتاح. تضم الواجهة أربعة تماثيل ضخمة لرمسيس الثاني، يبلغ ارتفاع كل منها 20 مترًا."      }    },    {      "id": "small_temple",      "name": {        "en": "Small Temple of Hathor and Nefertari",        "ar": "المعبد الصغير لحتحور ونفرتاري"      },      "description": {        "en": "Dedicated to the goddess Hathor and Ramses II's chief consort, Queen Nefertari. This was the second time in ancient Egyptian history that a temple was dedicated to a queen.",        "ar": "مكرس للإلهة حتحور والزوجة الرئيسية لرمسيس الثاني، الملكة نفرتاري. كانت هذه المرة الثانية في تاريخ مصر القديم التي يتم فيها تكريس معبد لملكة."      }    },    {      "id": "solar_alignment",      "name": {        "en": "Solar Phenomenon",        "ar": "ظاهرة شمسية"      },      "description": {        "en": "Twice a year (February 22 and October 22), the sun aligns to illuminate the inner sanctum statues of Ramses II and the gods, except for Ptah, the god of darkness.",        "ar": "مرتين في السنة (22 فبراير و22 أكتوبر)، تصطف الشمس لتضيء تماثيل المقدس الداخلي لرمسيس الثاني والآلهة، باستثناء بتاح، إله الظلام."      }    }  ],  "images": [    "abu_simbel_facades.jpg",    "great_temple_interior.jpg",    "small_temple_facade.jpg",    "solar_alignment.jpg"  ],  "last_updated": "2025-05-03T10:30:00Z"}