{  "id": "abu_simbel_temples",  "name": {    "en": "Abu Simbel Temples",    "ar": "معبدي أبو سمبل"  },  "type": "historical_site",  "location": {    "city": "Near Aswan (requires excursion)",    "city_ar": "بالقرب من أسوان (يتطلب رحلة)",    "region": "Upper Egypt / Nubia",     "coordinates": {      "latitude": 22.3371,      "longitude": 31.6258    }  },  "description": {    "en": "Two massive rock-cut temples in Nubia, southern Egypt, built by Pharaoh Ramesses II. Famous for the colossal statues of Ramesses II guarding the entrance and the temple's precise alignment allowing sunlight to illuminate the inner sanctuary twice a year. Relocated in a monumental UNESCO project to save them from the rising waters of Lake Nasser.",    "ar": "معبدان ضخمان منحوتان في الصخر في النوبة، جنوب مصر، بناهما الفرعون رمسيس الثاني. يشتهران بالتماثيل الضخمة لرمسيس الثاني التي تحرس المدخل والمحاذاة الدقيقة للمعبد التي تسمح لأشعة الشمس بإضاءة الحرم الداخلي مرتين في السنة. تم نقلهما في مشروع ضخم لليونسكو لإنقاذهما من ارتفاع مياه بحيرة ناصر."  },  "historical_significance": {    "period": ["New Kingdom"],    "builder": "Ramesses II",    "summary": {      "en": "Built around 1264 BCE to commemorate Ramesses II's victory at the Battle of Kadesh and to intimidate Egypt's southern Nubian neighbours.",      "ar": "بُني حوالي عام 1264 قبل الميلاد للاحتفال بانتصار رمسيس الثاني في معركة قادش ولإرهاب جيران مصر النوبيين الجنوبيين."    }  },  "key_features": [    {      "id": "great_temple",      "name": {        "en": "Great Temple of Ramesses II",        "ar": "المعبد الكبير لرمسيس الثاني"      },      "description": {        "en": "Dedicated to the gods Amun, Ra-Horakhty, and Ptah, as well as the deified Ramesses II himself. Features four colossal seated statues of the pharaoh.",        "ar": "مخصص للآلهة آمون ورع حوراختي وبتاح، بالإضافة إلى رمسيس الثاني المؤله نفسه. يتميز بأربعة تماثيل ضخمة جالسة للفرعون."      }    },    {      "id": "small_temple",      "name": {        "en": "Small Temple of Nefertari",        "ar": "المعبد الصغير لنفرتاري"      },      "description": {        "en": "Dedicated to the goddess Hathor and Ramesses II's chief consort, Nefertari. Features smaller standing statues of the king and queen.",        "ar": "مخصص للإلهة حتحور والزوجة الرئيسية لرمسيس الثاني، نفرتاري. يتميز بتماثيل أصغر واقفة للملك والملكة."      }    },    {      "id": "sun_festival",      "name": {        "en": "Sun Festival",        "ar": "ظاهرة تعامد الشمس"      },      "description": {        "en": "Occurs twice a year (approx. Feb 22 & Oct 22) when the rising sun penetrates the Great Temple to illuminate statues in the inner sanctuary.",        "ar": "تحدث مرتين في السنة (تقريبًا 22 فبراير و 22 أكتوبر) عندما تخترق الشمس المشرقة المعبد الكبير لإضاءة التماثيل في الحرم الداخلي."      }    }  ],  "practical_info": {    "opening_hours": {      "en": "Typically 6:00 AM - 5:00 PM (Check current times)",      "ar": "عادةً من 6:00 صباحًا حتى 5:00 مساءً (تحقق من الأوقات الحالية)"    },    "admission_fees": {      "standard": {        "en": "Fee applies",        "ar": "تطبق رسوم"      }    },    "getting_there": {      "en": "Most commonly visited via organized tours from Aswan (by bus convoy or flight). Independent travel requires arranging transport.",      "ar": "يتم زيارتها بشكل شائع عبر جولات منظمة من أسوان (بقافلة حافلات أو رحلة جوية). يتطلب السفر المستقل ترتيب وسائل النقل."    }  },  "images": [    "abu_simbel_exterior.jpg",    "abu_simbel_ramesses_statues.jpg",    "abu_simbel_small_temple.jpg",    "abu_simbel_interior.jpg"  ],  "tags": [    "aswan",    "nubia",    "historical",    "temple",    "ramesses_ii",    "new_kingdom",    "unesco",    "relocated_monument",    "rock_cut"  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}