{  "id": "giza_pyramids_sphinx",  "name": {    "en": "Giza Pyramids and Sphinx",    "ar": "أهرامات الجيزة وأبو الهول"  },  "type": "historical_site",  "description": {    "en": "The iconic Giza Plateau, home to the Great Pyramid of Giza (Pyramid of Khufu), the Pyramid of Khafre, the Pyramid of Menkaure, and the Great Sphinx. The last remaining of the Seven Wonders of the Ancient World.",    "ar": "هضبة الجيزة الشهيرة، موطن الهرم الأكبر بالجيزة (هرم خوفو)، وهرم خفرع، وهرم منكاورع، وأبو الهول العظيم. آخر ما تبقى من عجائب الدنيا السبع في العالم القديم."  },  "location": {    "city": "Giza (Cairo)",    "city_ar": "الجيزة (القاهرة)",    "region": "Lower Egypt / Cairo Area",     "coordinates": {      "latitude": 29.9773,      "longitude": 31.1326    }  },  "historical_significance": {    "period": ["Old Kingdom"],    "summary": {      "en": "Royal necropolis for Fourth Dynasty pharaohs (Khufu, Khafre, Menkaure). Monumental feats of ancient engineering and architecture.",      "ar": "جبانة ملكية لفراعنة الأسرة الرابعة (خوفو، خفرع، منكاورع). إنجازات ضخمة في الهندسة والعمارة القديمة."    }  },  "key_features": [    {      "id": "great_pyramid_khufu",      "name": {        "en": "Great Pyramid of Giza (Khufu)",        "ar": "الهرم الأكبر بالجيزة (خوفو)"      },      "description": {        "en": "The largest of the three pyramids and the tallest man-made structure in the world for over 3,800 years.",        "ar": "أكبر الأهرامات الثلاثة وأطول مبنى من صنع الإنسان في العالم لأكثر من 3800 عام."      }    },    {      "id": "great_sphinx",      "name": {        "en": "Great Sphinx of Giza",        "ar": "أبو الهول العظيم بالجيزة"      },      "description": {        "en": "Limestone statue of a mythical creature with the body of a lion and the head of a human, believed to represent Pharaoh Khafre.",        "ar": "تمثال من الحجر الجيري لمخلوق أسطوري بجسم أسد ورأس إنسان، يعتقد أنه يمثل الفرعون خفرع."      }    },    {      "id": "solar_boat_museum",      "name": {        "en": "Khufu Ship (Solar Boat) - Note: Moved to GEM",        "ar": "مركب خوفو (مركب الشمس) - ملاحظة: نُقل إلى المتحف المصري الكبير"      },      "description": {        "en": "An intact full-size vessel sealed into a pit at the foot of the Great Pyramid. (Note: The original boat is now displayed at the Grand Egyptian Museum).",        "ar": "سفينة كاملة الحجم سليمة مختومة في حفرة عند سفح الهرم الأكبر. (ملاحظة: القارب الأصلي معروض الآن في المتحف المصري الكبير)."      }    }  ],  "practical_info": {    "opening_hours": {      "en": "Typically 8:00 AM - 5:00 PM (Plateau), pyramid interiors have limited hours/tickets (Check current times)",      "ar": "عادةً من 8:00 صباحًا حتى 5:00 مساءً (الهضبة)، الدخول إلى الأهرامات له ساعات/تذاكر محدودة (تحقق من الأوقات الحالية)"    },    "admission_fees": {            "standard": {        "en": "Fee applies for plateau access, separate fees for pyramid interiors.",        "ar": "تطبق رسوم لدخول الهضبة، ورسوم منفصلة للدخول إلى الأهرامات."      }    }  },  "tags": [    "giza",    "cairo",    "historical",    "pyramids",    "sphinx",    "old_kingdom",    "ancient_egypt",    "unesco",    "seven_wonders"  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ" }