{  "id": "hatshepsut_temple",  "name": {    "en": "Mortuary Temple of Hatshepsut",    "ar": "المعبد الجنائزي لحتشبسوت"  },  "type": "historical_site",  "location": {    "city": "Luxor (West Bank, Deir el-Bahari)",    "city_ar": "الأقصر (الضفة الغربية، الدير البحري)",    "region": "Upper Egypt",     "coordinates": {      "latitude": 25.7382,      "longitude": 32.6066    }  },  "description": {    "en": "A stunning terraced temple built into the cliffs at Deir el-Bahari on Luxor's West Bank. Dedicated to the female Pharaoh Hatshepsut, it's renowned for its unique architecture, colonnaded terraces, and well-preserved reliefs depicting trade expeditions and divine birth scenes.",    "ar": "معبد مذهل مدرج مبني في المنحدرات الصخرية في الدير البحري على الضفة الغربية للأقصر. مخصص للملكة الفرعونية حتشبسوت، ويشتهر بهندسته المعمارية الفريدة، وشرفاته ذات الأعمدة، والنقوش المحفوظة جيدًا التي تصور الحملات التجارية ومشاهد الولادة الإلهية."  },  "historical_significance": {    "period": ["New Kingdom"],    "builder": "Hatshepsut (designed by Senenmut)",    "summary": {      "en": "Mortuary temple for Pharaoh Hatshepsut (18th Dynasty), one of the few female pharaohs. Unique design inspired by the neighboring temple of Mentuhotep II.",      "ar": "معبد جنائزي للملكة حتشبسوت (الأسرة الثامنة عشرة)، إحدى الفراعنة الإناث القلائل. تصميم فريد مستوحى من المعبد المجاور لمنتوحتب الثاني."    }  },  "key_features": [    {      "id": "terraces_colonnades",      "name": {        "en": "Terraces and Colonnades",        "ar": "المدرجات والأروقة المعمدة"      },      "description": {        "en": "The temple's defining feature, rising in three levels connected by ramps, with impressive colonnaded porticoes on each level.",        "ar": "الميزة المميزة للمعبد، ترتفع في ثلاثة مستويات متصلة بمنحدرات، مع أروقة معمدة رائعة في كل مستوى."      }    },    {      "id": "punt_reliefs",      "name": {        "en": "Punt Expedition Reliefs",        "ar": "نقوش رحلة بلاد بونت"      },      "description": {        "en": "Detailed carvings depicting Hatshepsut's famous trading expedition to the Land of Punt (likely modern-day Somalia or Eritrea).",        "ar": "منحوتات مفصلة تصور رحلة حتشبسوت التجارية الشهيرة إلى أرض بونت (على الأرجح الصومال أو إريتريا الحديثة)."      }    },    {      "id": "divine_birth_reliefs",      "name": {        "en": "Divine Birth Reliefs",        "ar": "نقوش الولادة الإلهية"      },      "description": {        "en": "Reliefs illustrating the story of Hatshepsut's conception, claiming divine parentage from the god Amun to legitimize her rule.",        "ar": "نقوش توضح قصة حمل حتشبسوت، مدعية الأبوة الإلهية من الإله آمون لإضفاء الشرعية على حكمها."      }    },    {      "id": "hathor_chapel",      "name": {        "en": "Chapel of Hathor",        "ar": "مصلى حتحور"      },      "description": {        "en": "A well-preserved chapel dedicated to the goddess Hathor, featuring columns with Hathor-headed capitals.",        "ar": "مصلى محفوظ جيدًا مخصص للإلهة حتحور، يتميز بأعمدة ذات تيجان على شكل رأس حتحور."      }    }  ],  "practical_info": {    "opening_hours": {      "en": "Typically 6:00 AM - 5:00 PM (Check current times)",      "ar": "عادةً من 6:00 صباحًا حتى 5:00 مساءً (تحقق من الأوقات الحالية)"    },    "admission_fees": {      "standard": {        "en": "Fee applies",        "ar": "تطبق رسوم"      }    },    "visitor_tips": {      "en": "Located on the West Bank, often visited with the Valley of the Kings. Can get very hot due to reflected heat from cliffs; visit early. Consider using the 'taf-taf' train from the entrance to the temple base.",      "ar": "يقع على الضفة الغربية، وغالبًا ما يتم زيارته مع وادي الملوك. يمكن أن يصبح الجو حارًا جدًا بسبب الحرارة المنعكسة من المنحدرات؛ قم بالزيارة مبكرًا. ضع في اعتبارك استخدام قطار 'الطَفْطَفْ' من المدخل إلى قاعدة المعبد."    }  },  "images": [    "hatshepsut_temple_overview.jpg",    "hatshepsut_temple_terraces.jpg",    "hatshepsut_temple_reliefs.jpg",    "hatshepsut_hathor_chapel.jpg"  ],  "tags": [    "luxor",    "west_bank",    "historical",    "temple",    "hatshepsut",    "new_kingdom",    "female_pharaoh",    "deir_el_bahari",    "unesco"  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}