{  "id": "luxor_temple",  "name": {    "en": "Luxor Temple",    "ar": "معبد الأقصر"  },  "type": "historical_site",  "location": {    "city": "Luxor (East Bank)",    "city_ar": "الأقصر (الضفة الشرقية)",    "region": "Upper Egypt",     "coordinates": {      "latitude": 25.7,      "longitude": 32.6389    }  },  "description": {    "en": "A large ancient Egyptian temple complex located on the east bank of the Nile River in Luxor. Founded around 1400 BCE, it was dedicated to the Theban Triad of Amun, Mut, and Khonsu. Known for its imposing statues, grand colonnades, and connection to Karnak Temple via the Avenue of Sphinxes.",    "ar": "مجمع معابد مصري قديم كبير يقع على الضفة الشرقية لنهر النيل في الأقصر. تأسس حوالي عام 1400 قبل الميلاد، وكان مخصصًا لثالوث طيبة آمون وموت وخونسو. يشتهر بتماثيله المهيبة وأعمدته الكبرى واتصاله بمعبد الكرنك عبر طريق الكباش."  },  "historical_significance": {    "period": ["New Kingdom", "Roman Period"],    "summary": {      "en": "Primarily built by Amenhotep III and Ramesses II. Central site for the Opet Festival, a major annual celebration. Later additions include Roman and Islamic structures (Mosque of Abu Haggag).",      "ar": "بُني بشكل أساسي من قبل أمنحتب الثالث ورمسيس الثاني. موقع مركزي لمهرجان الأوبت، وهو احتفال سنوي رئيسي. تشمل الإضافات اللاحقة هياكل رومانية وإسلامية (مسجد أبو الحجاج)."    }  },  "key_features": [    {      "id": "avenue_of_sphinxes_luxor",      "name": {        "en": "Avenue of Sphinxes (Luxor end)",        "ar": "طريق الكباش (نهاية الأقصر)"      },      "description": {        "en": "The southern terminus of the processional way connecting Luxor and Karnak temples.",        "ar": "المحطة الجنوبية لطريق المواكب الذي يربط بين معبدي الأقصر والكرنك."      }    },    {      "id": "ramesses_ii_pylon_statues",      "name": {        "en": "Pylon and Statues of Ramesses II",        "ar": "صرح وتماثيل رمسيس الثاني"      },      "description": {        "en": "Massive entrance gateway decorated with reliefs of the Battle of Kadesh, fronted by colossal seated statues of Ramesses II and one remaining obelisk (the other is in Paris).",        "ar": "بوابة مدخل ضخمة مزينة بنقوش معركة قادش، تتقدمها تماثيل ضخمة جالسة لرمسيس الثاني ومسلة واحدة متبقية (الأخرى في باريس)."      }    },    {      "id": "amenhotep_iii_colonnade",      "name": {        "en": "Colonnade of Amenhotep III",        "ar": "صف أعمدة أمنحتب الثالث"      },      "description": {        "en": "A grand hallway with towering papyrus-bundle columns leading into the temple's inner sections.",        "ar": "ردهة كبيرة بأعمدة شاهقة على شكل حزمة بردي تؤدي إلى الأقسام الداخلية للمعبد."      }    },    {      "id": "abu_haggag_mosque",      "name": {        "en": "Mosque of Abu Haggag",        "ar": "مسجد أبو الحجاج"      },      "description": {        "en": "A functioning mosque built atop the temple ruins, showcasing the layers of history at the site.",        "ar": "مسجد عامل بني فوق أطلال المعبد، يعرض طبقات التاريخ في الموقع."      }    }  ],  "practical_info": {    "opening_hours": {      "en": "Typically 6:00 AM - 10:00 PM (Unique late hours, check current times)",      "ar": "عادةً من 6:00 صباحًا حتى 10:00 مساءً (ساعات متأخرة فريدة، تحقق من الأوقات الحالية)"    },    "admission_fees": {      "standard": {        "en": "Fee applies",        "ar": "تطبق رسوم"      }    },    "visitor_tips": {      "en": "Visiting at night offers a dramatic perspective with the temple beautifully illuminated. Allow 1.5-2 hours. Located centrally in Luxor city.",      "ar": "توفر الزيارة ليلاً منظورًا دراميًا مع إضاءة المعبد بشكل جميل. اسمح بساعة ونصف إلى ساعتين. يقع في موقع مركزي في مدينة الأقصر."    }  },  "images": [    "luxor_temple_night.jpg",    "luxor_temple_colonnade.jpg",    "luxor_temple_ramesses_statues.jpg",    "luxor_temple_sphinx_avenue.jpg"  ],  "tags": [    "luxor",    "east_bank",    "historical",    "temple",    "new_kingdom",    "ancient_egypt",    "opet_festival",    "unesco"  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}