{  "id": "philae_temple",  "name": {    "en": "Philae Temple Complex",    "ar": "معبد فيلة"  },  "type": "historical_site",  "description": {    "en": "An island-based temple complex near Aswan, primarily dedicated to the goddess Isis. Famous for its beautiful location and well-preserved Ptolemaic and Roman structures. The entire complex was relocated to Agilkia Island to save it from flooding caused by the High Dam.",    "ar": "مجمع معابد قائم على جزيرة بالقرب من أسوان، مخصص بشكل أساسي للإلهة إيزيس. يشتهر بموقعه الجميل وهياكله البطلمية والرومانية المحفوظة جيدًا. تم نقل المجمع بأكمله إلى جزيرة أجيلكيا لإنقاذه من الفيضانات الناجمة عن السد العالي."  },  "location": {    "city": "Aswan",    "city_ar": "أسوان",    "region": "Upper Egypt / Nubia",     "coordinates": {      "latitude": 24.0256,       "longitude": 32.8888    }  },  "historical_significance": {    "period": ["Ptolemaic Period", "Roman Period"],    "summary": {      "en": "Major cult center for Isis, attracting pilgrims from across the Greco-Roman world. One of the last places where ancient Egyptian religion was practiced.",      "ar": "مركز عبادة رئيسي لإيزيس، يجذب الحجاج من جميع أنحاء العالم اليوناني الروماني. أحد آخر الأماكن التي مورست فيها الديانة المصرية القديمة."    }  },  "key_features": [    {      "id": "temple_of_isis",      "name": {        "en": "Temple of Isis",        "ar": "معبد إيزيس"      },      "description": {        "en": "The main temple structure, featuring impressive pylons and colonnades.",        "ar": "هيكل المعبد الرئيسي، يتميز بصروح وأعمدة رائعة."      }    },    {      "id": "kiosk_of_trajan",      "name": {        "en": "Kiosk of Trajan",        "ar": "كشك تراجان"      },      "description": {        "en": "An iconic, unfinished Roman kiosk often depicted in images of Philae.",        "ar": "كشك روماني أيقوني غير مكتمل، يظهر غالبًا في صور فيلة."      }    }  ],  "practical_info": {    "opening_hours": {      "en": "Typically 7:00 AM - 4:00 PM (Requires boat access, check current times)",      "ar": "عادةً من 7:00 صباحًا حتى 4:00 مساءً (يتطلب الوصول بالقارب، تحقق من الأوقات الحالية)"    },    "admission_fees": {            "standard": {        "en": "Fee applies (includes boat transfer)",        "ar": "تطبق رسوم (تشمل النقل بالقارب)"      }    },    "getting_there": {      "en": "Accessible via a short motorboat ride from a dock south of Aswan.",      "ar": "يمكن الوصول إليه عبر رحلة قصيرة بالقارب البخاري من رصيف جنوب أسوان."    }  },  "tags": [    "aswan",    "nubia",    "historical",    "temple",    "isis",    "ptolemaic",    "roman",    "unesco",    "island"  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ" }