{  "id": "saqqara_step_pyramid",  "name": {    "en": "Saqqara Step Pyramid",    "ar": "هرم زوسر المدرج"  },  "type": "ancient_monument",  "location": {    "city": "Saqqara",    "city_ar": "سقارة",    "region": "Giza Governorate",    "region_ar": "محافظة الجيزة",    "coordinates": {      "latitude": 29.8713,      "longitude": 31.2156    }  },  "description": {    "en": "The Step Pyramid of Djoser at Saqqara is the oldest stone pyramid in Egypt and considered the earliest monumental stone structure in the world. Built during the Third Dynasty around 2667–2648 BCE for the burial of Pharaoh Djoser by his vizier and architect Imhotep, it represents a crucial evolutionary stage between the traditional flat-roofed mastaba tombs and the true smooth-sided pyramids that followed.",    "ar": "هرم زوسر المدرج في سقارة هو أقدم هرم حجري في مصر ويعتبر أقدم بناء حجري ضخم في العالم. بُني خلال الأسرة الثالثة حوالي 2667-2648 قبل الميلاد لدفن الفرعون زوسر من قبل وزيره ومهندسه إمحوتب، ويمثل مرحلة تطورية حاسمة بين مقابر المصطبة التقليدية ذات السقف المسطح والأهرامات الحقيقية ذات الجوانب الناعمة التي تلتها."  },  "history": {    "en": "The Step Pyramid complex was designed by Imhotep, a genius architect who was later deified for his achievements. Originally built as a mastaba (a flat-roofed rectangular structure), it was expanded in stages to form a six-tier, four-sided pyramid rising to a height of 62 meters. The entire complex was surrounded by a 10.5-meter high limestone wall and included temples, courtyards, shrines, and living quarters for the priests. This was revolutionary in ancient Egyptian architecture and set the template for later pyramid complexes.",    "ar": "تم تصميم مجمع الهرم المدرج بواسطة إمحوتب، المهندس العبقري الذي تم تأليهه لاحقًا بسبب إنجازاته. بُني في الأصل كمصطبة (بناء مستطيل بسقف مسطح)، ثم توسع على مراحل ليشكل هرمًا سداسي الطبقات، رباعي الأوجه يرتفع إلى ارتفاع 62 مترًا. كان المجمع بأكمله محاطًا بسور من الحجر الجيري يبلغ ارتفاعه 10.5 متر وشمل معابد وساحات وأضرحة وأماكن إقامة للكهنة. كان هذا ثوريًا في العمارة المصرية القديمة ووضع النموذج لمجمعات الأهرامات اللاحقة."  },  "era": "Old Kingdom, Third Dynasty",  "practical_info": {    "opening_hours": "8:00 AM - 5:00 PM daily (summer), 8:00 AM - 4:00 PM daily (winter)",    "ticket_prices": {      "foreigners": {        "adults": "180 EGP",        "students": "90 EGP"      },      "egyptians": {        "adults": "30 EGP",        "students": "15 EGP"      },      "additional": {        "photography": "Free (personal photography), 300 EGP (professional camera)"      }    },    "best_time_to_visit": "Morning hours (8AM-10AM) to avoid heat and crowds. Winter months (November to February) offer more comfortable temperatures.",    "duration": "2-3 hours for a complete visit",    "facilities": [      "Restrooms",      "Souvenir shops",      "Limited food and beverage options",      "Parking"    ],    "accessibility": {      "en": "The site has uneven terrain and many steps, making it challenging for visitors with mobility issues. The newly renovated areas of the Step Pyramid provide better accessibility, but exploring most of the complex requires good mobility.",      "ar": "يحتوي الموقع على تضاريس غير مستوية والعديد من الدرجات، مما يجعله صعبًا على الزوار الذين يعانون من مشاكل في الحركة. توفر المناطق المجددة حديثًا من الهرم المدرج إمكانية وصول أفضل، ولكن استكشاف معظم المجمع يتطلب قدرة جيدة على الحركة."    },    "visitor_tips": {      "en": "Hire a knowledgeable guide to fully appreciate the historical significance of Saqqara. The site is less crowded than Giza, offering a more peaceful experience. Consider combining your visit with nearby Memphis and Dahshur pyramids. Bring water, sun protection, and wear comfortable walking shoes.",      "ar": "استأجر مرشدًا ذو معرفة لتقدير الأهمية التاريخية لسقارة بشكل كامل. الموقع أقل ازدحامًا من الجيزة، مما يوفر تجربة أكثر هدوءًا. فكر في الجمع بين زيارتك ومنف القريبة وأهرامات دهشور. أحضر الماء وواقي الشمس وارتدِ أحذية مريحة للمشي."    }  },  "must_see": [    {      "id": "step_pyramid",      "name": {        "en": "Step Pyramid of Djoser",        "ar": "هرم زوسر المدرج"      },      "description": {        "en": "The main attraction and world's oldest known stone monument, rising 62 meters with six distinct tiers. Recently restored to preserve its structural integrity while maintaining its historical authenticity.",        "ar": "المعلم الرئيسي وأقدم نصب حجري معروف في العالم، يرتفع 62 مترًا بست طبقات متميزة. تم ترميمه مؤخرًا للحفاظ على سلامته الهيكلية مع الحفاظ على أصالته التاريخية."      }    },    {      "id": "serdab",      "name": {        "en": "The Serdab",        "ar": "السرداب"      },      "description": {        "en": "A small enclosed structure housing a seated statue of Pharaoh Djoser. The statue can be viewed through two small holes, allowing the ka (spirit) of the king to observe the rituals performed in his honor.",        "ar": "بناء صغير مغلق يضم تمثالًا جالسًا للفرعون زوسر. يمكن رؤية التمثال من خلال فتحتين صغيرتين، مما يسمح لكا (روح) الملك بمراقبة الطقوس التي تؤدى تكريمًا له."      }    },    {      "id": "southern_tomb",      "name": {        "en": "Southern Tomb",        "ar": "المقبرة الجنوبية"      },      "description": {        "en": "A symbolic tomb representing the king's connection to Upper Egypt. It contains beautiful blue faience tiles that replicate reed matting, showcasing the high level of craftsmanship achieved during this early period.",        "ar": "مقبرة رمزية تمثل ارتباط الملك بصعيد مصر. تحتوي على بلاط فيانس أزرق جميل يحاكي حصير القصب، مما يدل على المستوى العالي من الحرفية التي تحققت خلال هذه الفترة المبكرة."      }    }  ],  "components": [    {      "id": "entrance_colonnade",      "name": {        "en": "Entrance Colonnade",        "ar": "رواق المدخل"      },      "description": {        "en": "A hypostyle hall with 40 columns designed to resemble bundled reeds or plant stems, an early example of the architectural style that would become common in later Egyptian temples.",        "ar": "قاعة عمودية بها 40 عمودًا مصممة لتشبه حزم من القصب أو سيقان النباتات، وهي مثال مبكر للأسلوب المعماري الذي أصبح شائعًا في المعابد المصرية اللاحقة."      }    },    {      "id": "great_court",      "name": {        "en": "Great Court",        "ar": "الفناء الكبير"      },      "description": {        "en": "A large ceremonial courtyard where the king performed the Heb-Sed festival rituals, demonstrating his physical abilities and reaffirming his right to rule.",        "ar": "فناء احتفالي كبير حيث كان الملك يؤدي طقوس مهرجان الحب-سد، مظهرًا قدراته البدنية ومؤكدًا من جديد حقه في الحكم."      }    },    {      "id": "burial_chamber",      "name": {        "en": "Burial Chamber",        "ar": "غرفة الدفن"      },      "description": {        "en": "Located beneath the pyramid at the bottom of a 28-meter deep shaft, the granite burial chamber features a sealed granite plug system designed to protect the pharaoh's remains.",        "ar": "تقع تحت الهرم في قاع بئر عمقه 28 مترًا، تتميز غرفة الدفن الجرانيتية بنظام سدادة جرانيتية مختومة مصممة لحماية رفات الفرعون."      }    }  ],  "nearby_attractions": [    {      "id": "memphis",      "name": {        "en": "Memphis Archaeological Site",        "ar": "موقع منف الأثري"      },      "distance": "4 km",      "description": {        "en": "The ancient capital of Egypt's Old Kingdom, featuring the Alabaster Sphinx and colossal statue of Ramses II.",        "ar": "العاصمة القديمة لمملكة مصر القديمة، وتضم أبو الهول الألباستر وتمثال رمسيس الثاني الضخم."      }    },    {      "id": "dahshur",      "name": {        "en": "Dahshur Pyramids",        "ar": "أهرامات دهشور"      },      "distance": "8 km",      "description": {        "en": "Home to the Bent Pyramid and Red Pyramid, representing important evolutionary stages in pyramid construction.",        "ar": "موطن الهرم المنحني والهرم الأحمر، اللذان يمثلان مراحل تطورية مهمة في بناء الأهرامات."      }    }  ],  "images": [    "saqqara_step_pyramid_main.jpg",    "saqqara_serdab.jpg",    "saqqara_entrance_colonnade.jpg",    "saqqara_aerial_view.jpg",    "saqqara_blue_tiles.jpg"  ]}