{  "id": "valley_of_the_kings",  "name": {    "en": "Valley of the Kings",    "ar": "وادي الملوك"  },  "type": "historical_site",  "location": {    "city": "Luxor (West Bank)",    "city_ar": "الأقصر (الضفة الغربية)",    "region": "Upper Egypt",     "coordinates": {      "latitude": 25.7402,      "longitude": 32.6014    }  },  "description": {    "en": "A valley on the west bank of the Nile near Luxor, famous as the burial place of pharaohs and powerful nobles of the New Kingdom (approx. 16th to 11th century BCE). Contains numerous rock-cut tombs, including the tomb of Tutankhamun.",    "ar": "وادٍ على الضفة الغربية لنهر النيل بالقرب من الأقصر، يشتهر بأنه مكان دفن الفراعنة والنبلاء الأقوياء في الدولة الحديثة (تقريبًا من القرن السادس عشر إلى القرن الحادي عشر قبل الميلاد). يحتوي على العديد من المقابر المنحوتة في الصخر، بما في ذلك مقبرة توت عنخ آمون."  },  "historical_significance": {    "period": ["New Kingdom"],    "summary": {      "en": "Primary royal necropolis for pharaohs of the 18th, 19th, and 20th Dynasties. Tombs contain elaborate decorations depicting mythology and funerary rituals.",      "ar": "الجبانة الملكية الرئيسية لفراعنة الأسرات الثامنة عشرة والتاسعة عشرة والعشرين. تحتوي المقابر على زخارف متقنة تصور الأساطير والطقوس الجنائزية."    }  },  "key_features": [    {      "id": "tomb_tutankhamun_kv62",      "name": {        "en": "Tomb of Tutankhamun (KV62)",        "ar": "مقبرة توت عنخ آمون (KV62)"      },      "description": {        "en": "World-famous tomb discovered largely intact by Howard Carter in 1922. Contains the mummy of Tutankhamun (treasures moved to museums).",        "ar": "مقبرة مشهورة عالميًا اكتشفها هوارد كارتر سليمة إلى حد كبير عام 1922. تحتوي على مومياء توت عنخ آمون (تم نقل الكنوز إلى المتاحف)."      }    },    {      "id": "tomb_ramesses_vi_kv9",      "name": {        "en": "Tomb of Ramesses VI (KV9)",        "ar": "مقبرة رمسيس السادس (KV9)"      },      "description": {        "en": "Known for its well-preserved and vibrant astronomical ceiling decorations.",        "ar": "تشتهر بزخارف سقفها الفلكية المحفوظة جيدًا والنابضة بالحياة."      }    },    {      "id": "tomb_seti_i_kv17",      "name": {        "en": "Tomb of Seti I (KV17)",        "ar": "مقبرة سيتي الأول (KV17)"      },      "description": {        "en": "One of the longest and most beautifully decorated tombs in the valley (often requires separate ticket).",        "ar": "واحدة من أطول وأجمل المقابر المزينة في الوادي (تتطلب غالبًا تذكرة منفصلة)."      }    }  ],  "practical_info": {    "opening_hours": {      "en": "Typically 6:00 AM - 5:00 PM (Check current times, last entry varies)",      "ar": "عادةً من 6:00 صباحًا حتى 5:00 مساءً (تحقق من الأوقات الحالية، يختلف آخر موعد للدخول)"    },    "admission_fees": {      "standard": {        "en": "General admission ticket allows entry to 3 tombs (from a rotating selection). Some tombs (like Tutankhamun, Seti I) require separate, extra tickets.",        "ar": "تسمح تذكرة الدخول العامة بدخول 3 مقابر (من مجموعة متغيرة). تتطلب بعض المقابر (مثل توت عنخ آمون وسيتي الأول) تذاكر منفصلة إضافية."      }    },    "visitor_tips": {      "en": "Visit early to avoid heat and crowds. Photography inside tombs is often restricted or requires a special ticket (no flash allowed). The site involves walking and stairs. Choose tombs based on current availability and interest.",      "ar": "قم بالزيارة مبكرًا لتجنب الحرارة والازدحام. غالبًا ما يكون التصوير داخل المقابر مقيدًا أو يتطلب تذكرة خاصة (لا يسمح بالفلاش). يتضمن الموقع المشي والسلالم. اختر المقابر بناءً على التوفر الحالي والاهتمام."    }  },  "images": [    "valley_kings_entrance.jpg",    "valley_kings_tomb_interior.jpg",    "valley_kings_tutankhamun.jpg",    "valley_kings_decorations.jpg"  ],  "tags": [    "luxor",    "west_bank",    "historical",    "necropolis",    "tombs",    "new_kingdom",    "pharaohs",    "tutankhamun",    "unesco"  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}