{  "id": "accessibility_info",  "description": {    "en": "Standardized accessibility information for attractions and destinations across Egypt, intended to help travelers with disabilities or mobility challenges plan their visits effectively.",    "ar": "معلومات إمكانية الوصول الموحدة للمعالم السياحية والوجهات في جميع أنحاء مصر، والتي تهدف إلى مساعدة المسافرين ذوي الإعاقة أو تحديات الحركة على تخطيط زياراتهم بشكل فعال."  },  "mobility_ratings": {    "fully_accessible": {      "id": "fully_accessible",      "name": {        "en": "Fully Accessible",        "ar": "إمكانية وصول كاملة"      },      "description": {        "en": "The site is fully accessible for wheelchair users and people with mobility impairments. Includes ramps or level entry, accessible restrooms, elevators where needed, and paved pathways throughout the main areas.",        "ar": "الموقع متاح بالكامل لمستخدمي الكراسي المتحركة والأشخاص ذوي إعاقات الحركة. يتضمن منحدرات أو مدخل مستوٍ، ومراحيض يمكن الوصول إليها، ومصاعد حيثما تدعو الحاجة، ومسارات معبدة في جميع المناطق الرئيسية."      },      "icon": "accessibility_full.svg"    },    "partially_accessible": {      "id": "partially_accessible",      "name": {        "en": "Partially Accessible",        "ar": "إمكانية وصول جزئية"      },      "description": {        "en": "The site offers accessibility to some but not all areas. Main pathways may be accessible, but some areas or features may require navigating steps or uneven terrain. Some accommodations like ramps may be present but not comprehensively throughout the site.",        "ar": "يوفر الموقع إمكانية الوصول إلى بعض المناطق وليس كلها. قد تكون المسارات الرئيسية متاحة، ولكن بعض المناطق أو الميزات قد تتطلب التنقل عبر درجات أو تضاريس غير مستوية. قد تكون هناك بعض التسهيلات مثل المنحدرات ولكنها ليست شاملة في جميع أنحاء الموقع."      },      "icon": "accessibility_partial.svg"    },    "limited_accessibility": {      "id": "limited_accessibility",      "name": {        "en": "Limited Accessibility",        "ar": "إمكانية وصول محدودة"      },      "description": {        "en": "The site has significant accessibility challenges but is not completely inaccessible. Visitors with mobility impairments may be able to access some viewing areas or limited portions of the site, but will encounter obstacles like steps, narrow passages, or unpaved surfaces. Assistance may be required.",        "ar": "يواجه الموقع تحديات كبيرة في إمكانية الوصول ولكنه ليس غير قابل للوصول تمامًا. قد يتمكن الزوار ذوو إعاقات الحركة من الوصول إلى بعض مناطق المشاهدة أو أجزاء محدودة من الموقع، ولكنهم سيواجهون عوائق مثل الدرجات أو الممرات الضيقة أو الأسطح غير المعبدة. قد تكون هناك حاجة للمساعدة."      },      "icon": "accessibility_limited.svg"    },    "not_accessible": {      "id": "not_accessible",      "name": {        "en": "Not Accessible",        "ar": "غير متاح الوصول"      },      "description": {        "en": "The site is not accessible for wheelchair users or those with significant mobility impairments. Terrain may be very uneven, sandy, rocky, or involve many steps without alternatives. The nature of the location makes accessibility modifications impractical or impossible.",        "ar": "الموقع غير متاح لمستخدمي الكراسي المتحركة أو الأشخاص ذوي إعاقات الحركة الكبيرة. قد تكون التضاريس غير مستوية للغاية، أو رملية، أو صخرية، أو تتضمن العديد من الخطوات دون بدائل. طبيعة الموقع تجعل تعديلات إمكانية الوصول غير عملية أو مستحيلة."      },      "icon": "accessibility_none.svg"    }  },  "sensory_accommodations": {    "visual_impairments": {      "braille_information": {        "id": "braille_information",        "name": {          "en": "Braille Information",          "ar": "معلومات بطريقة برايل"        },        "description": {          "en": "Information panels or guides are available in Braille for visitors with visual impairments.",          "ar": "تتوفر لوحات معلومات أو أدلة بطريقة برايل للزوار ذوي الإعاقات البصرية."        },        "icon": "braille.svg"      },      "audio_guides": {        "id": "audio_guides",        "name": {          "en": "Audio Guides",          "ar": "أدلة صوتية"        },        "description": {          "en": "Descriptive audio guides are available that provide detailed verbal descriptions of the site and its features.",          "ar": "تتوفر أدلة صوتية وصفية توفر أوصافًا لفظية مفصلة للموقع وميزاته."        },        "icon": "audio_guide.svg"      },      "tactile_models": {        "id": "tactile_models",        "name": {          "en": "Tactile Models or Exhibits",          "ar": "نماذج أو معارض لمسية"        },        "description": {          "en": "Three-dimensional models or touchable exhibits are available for tactile exploration.",          "ar": "تتوفر نماذج ثلاثية الأبعاد أو معروضات قابلة للمس للاستكشاف اللمسي."        },        "icon": "tactile_model.svg"      }    },    "hearing_impairments": {      "sign_language": {        "id": "sign_language",        "name": {          "en": "Sign Language Tours",          "ar": "جولات بلغة الإشارة"        },        "description": {          "en": "Tours conducted in sign language are available upon request or at scheduled times.",          "ar": "تتوفر جولات بلغة الإشارة عند الطلب أو في أوقات محددة."        },        "icon": "sign_language.svg"      },      "visual_guides": {        "id": "visual_guides",        "name": {          "en": "Visual Guides",          "ar": "أدلة مرئية"        },        "description": {          "en": "Detailed visual information and guides with illustrations are available as alternatives to audio content.",          "ar": "تتوفر معلومات مرئية مفصلة وأدلة مع رسوم توضيحية كبدائل للمحتوى الصوتي."        },        "icon": "visual_guide.svg"      },      "captioning": {        "id": "captioning",        "name": {          "en": "Captioned Media",          "ar": "وسائط ذات تعليقات توضيحية"        },        "description": {          "en": "Videos and multimedia presentations at the site include captions or subtitles.",          "ar": "تتضمن مقاطع الفيديو والعروض متعددة الوسائط في الموقع تعليقات توضيحية أو ترجمات."        },        "icon": "captioning.svg"      }    }  },  "service_facilities": {    "accessible_restrooms": {      "id": "accessible_restrooms",      "name": {        "en": "Accessible Restrooms",        "ar": "مراحيض يمكن الوصول إليها"      },      "description": {        "en": "Restrooms designed for accessibility are available, including wider doorways, grab bars, and sufficient space for wheelchair users.",        "ar": "تتوفر مراحيض مصممة لسهولة الوصول، بما في ذلك أبواب أوسع، وقضبان إمساك، ومساحة كافية لمستخدمي الكراسي المتحركة."      },      "icon": "accessible_restroom.svg"    },    "wheelchair_rental": {      "id": "wheelchair_rental",      "name": {        "en": "Wheelchair Rental",        "ar": "تأجير الكراسي المتحركة"      },      "description": {        "en": "Wheelchairs are available for visitors to borrow or rent during their visit.",        "ar": "تتوفر كراسي متحركة للزوار للاستعارة أو الاستئجار خلال زيارتهم."      },      "icon": "wheelchair_rental.svg"    },    "companion_free": {      "id": "companion_free",      "name": {        "en": "Companion Free Entry",        "ar": "دخول مجاني للمرافق"      },      "description": {        "en": "Companions or caregivers of visitors with disabilities are granted free or discounted entry.",        "ar": "يُمنح مرافقو أو مقدمو الرعاية للزوار ذوي الإعاقة دخولًا مجانيًا أو مخفضًا."      },      "icon": "companion.svg"    },    "assistance_staff": {      "id": "assistance_staff",      "name": {        "en": "Trained Assistance Staff",        "ar": "موظفو مساعدة مدربون"      },      "description": {        "en": "Staff members trained to assist visitors with disabilities are available on-site.",        "ar": "يتوفر في الموقع أفراد من الموظفين مدربين على مساعدة الزوار ذوي الإعاقة."      },      "icon": "assistance_staff.svg"    },    "accessible_parking": {      "id": "accessible_parking",      "name": {        "en": "Accessible Parking",        "ar": "مواقف سيارات يمكن الوصول إليها"      },      "description": {        "en": "Designated parking spaces for visitors with disabilities located close to the entrance.",        "ar": "أماكن وقوف مخصصة للزوار ذوي الإعاقة تقع بالقرب من المدخل."      },      "icon": "accessible_parking.svg"    }  },  "adaptive_equipment": {    "all_terrain_wheelchairs": {      "id": "all_terrain_wheelchairs",      "name": {        "en": "All-Terrain Wheelchairs",        "ar": "كراسي متحركة لجميع التضاريس"      },      "description": {        "en": "Specialized wheelchairs designed for rough terrain are available for sites with sandy, rocky, or uneven surfaces.",        "ar": "تتوفر كراسي متحركة متخصصة مصممة للتضاريس الوعرة للمواقع ذات الأسطح الرملية أو الصخرية أو غير المستوية."      },      "icon": "all_terrain_wheelchair.svg"    },    "adaptive_transportation": {      "id": "adaptive_transportation",      "name": {        "en": "Adaptive Transportation",        "ar": "وسائل نقل متكيفة"      },      "description": {        "en": "Modified vehicles or transportation options are available for moving around larger sites.",        "ar": "تتوفر مركبات معدلة أو خيارات نقل للتنقل في المواقع الأكبر."      },      "icon": "adaptive_transport.svg"    }  },  "assistance_animals": {    "service_animals_welcome": {      "id": "service_animals_welcome",      "name": {        "en": "Service Animals Welcome",        "ar": "الترحيب بحيوانات الخدمة"      },      "description": {        "en": "Service animals such as guide dogs are permitted to enter all areas of the site.",        "ar": "يُسمح لحيوانات الخدمة مثل كلاب الإرشاد بدخول جميع مناطق الموقع."      },      "icon": "service_animal.svg"    }  },  "special_programs": {    "sensory_friendly_hours": {      "id": "sensory_friendly_hours",      "name": {        "en": "Sensory-Friendly Hours",        "ar": "ساعات صديقة للحواس"      },      "description": {        "en": "Dedicated times when the site has reduced crowds, lowered noise levels, and adjusted lighting for visitors with sensory sensitivities.",        "ar": "أوقات مخصصة عندما يكون الموقع أقل ازدحامًا، ومستويات ضوضاء منخفضة، وإضاءة معدلة للزوار ذوي الحساسيات الحسية."      },      "icon": "sensory_friendly.svg"    },    "specialized_tours": {      "id": "specialized_tours",      "name": {        "en": "Specialized Accessibility Tours",        "ar": "جولات إمكانية وصول متخصصة"      },      "description": {        "en": "Tours specifically designed for visitors with various disabilities, which may include modified routes or specialized interpretation.",        "ar": "جولات مصممة خصيصًا للزوار ذوي الإعاقات المختلفة، والتي قد تشمل مسارات معدلة أو تفسيرًا متخصصًا."      },      "icon": "specialized_tour.svg"    }  },  "site_specific_notes": {    "desert_sites": {      "id": "desert_sites",      "name": {        "en": "Desert Sites Considerations",        "ar": "اعتبارات مواقع الصحراء"      },      "description": {        "en": "Desert attractions present unique challenges including sandy terrain, extreme temperatures, limited shade, and often remote locations with minimal facilities. Visitors with mobility impairments typically require specialized transportation and assistance. The best experience is usually achieved through tour operators that offer adaptive desert experiences with all-terrain wheelchairs and trained staff.",        "ar": "تقدم المعالم الصحراوية تحديات فريدة بما في ذلك التضاريس الرملية، ودرجات الحرارة القصوى، والظل المحدود، وغالبًا ما تكون في مواقع نائية ذات مرافق بسيطة. يحتاج الزوار ذوو إعاقات الحركة عادةً إلى وسائل نقل متخصصة ومساعدة. يتم تحقيق أفضل تجربة عادةً من خلال منظمي الرحلات الذين يقدمون تجارب صحراوية متكيفة مع كراسي متحركة لجميع التضاريس وموظفين مدربين."      },      "recommendations": [        {          "en": "Contact specialized desert tour operators that offer accessibility accommodations at least 2-3 weeks in advance",          "ar": "التواصل مع منظمي الرحلات الصحراوية المتخصصين الذين يقدمون تسهيلات إمكانية الوصول قبل 2-3 أسابيع على الأقل"        },        {          "en": "Consider visiting during winter months (November-February) when temperatures are more moderate",          "ar": "التفكير في الزيارة خلال أشهر الشتاء (نوفمبر-فبراير) عندما تكون درجات الحرارة أكثر اعتدالًا"        },        {          "en": "For wheelchair users, specially adapted vehicles are essential for desert travel",          "ar": "لمستخدمي الكراسي المتحركة، تعتبر المركبات المكيفة خصيصًا ضرورية للسفر في الصحراء"        },        {          "en": "Virtual tours or elevated viewing platforms at the edges of some desert attractions may provide alternative experiences",          "ar": "قد توفر الجولات الافتراضية أو منصات المشاهدة المرتفعة عند حواف بعض المعالم الصحراوية تجارب بديلة"        }      ],      "icon": "desert_accessibility.svg"    },    "archaeological_sites": {      "id": "archaeological_sites",      "name": {        "en": "Archaeological Sites Considerations",        "ar": "اعتبارات المواقع الأثرية"      },      "description": {        "en": "Archaeological sites often present accessibility challenges including uneven terrain, steps, narrow passages, and conservation requirements that limit modification possibilities. Many major sites have implemented partial accessibility solutions with designated routes suitable for wheelchair users and visitors with limited mobility. The level of accessibility varies significantly between sites, with newer visitor centers typically offering better accommodations than the ancient structures themselves.",        "ar": "غالبًا ما تقدم المواقع الأثرية تحديات في إمكانية الوصول بما في ذلك التضاريس غير المستوية، والدرجات، والممرات الضيقة، ومتطلبات الحفظ التي تحد من إمكانيات التعديل. نفذت العديد من المواقع الرئيسية حلول إمكانية وصول جزئية مع مسارات مخصصة مناسبة لمستخدمي الكراسي المتحركة والزوار ذوي الحركة المحدودة. يختلف مستوى إمكانية الوصول بشكل كبير بين المواقع، حيث توفر مراكز الزوار الأحدث عادةً أماكن إقامة أفضل من الهياكل القديمة نفسها."      },      "recommendations": [        {          "en": "Contact the site administration in advance to inquire about specific accessibility options and services",          "ar": "التواصل مع إدارة الموقع مسبقًا للاستفسار عن خيارات وخدمات إمكانية الوصول المحددة"        },        {          "en": "Consider visiting during off-peak hours for a less crowded experience",          "ar": "التفكير في الزيارة خلال ساعات غير الذروة للحصول على تجربة أقل ازدحامًا"        },        {          "en": "Virtual or augmented reality experiences are increasingly available for areas with limited physical access",          "ar": "تتوفر تجارب الواقع الافتراضي أو المعزز بشكل متزايد للمناطق ذات الوصول المادي المحدود"        },        {          "en": "Many sites offer adapted routes that provide access to key features while bypassing the most challenging areas",          "ar": "تقدم العديد من المواقع مسارات متكيفة توفر الوصول إلى الميزات الرئيسية مع تجاوز المناطق الأكثر تحديًا"        }      ],      "icon": "archaeological_accessibility.svg"    }  },  "contact_information": {    "accessibility_resources": [      {        "name": {          "en": "Egyptian Accessible Tourism Foundation",          "ar": "مؤسسة السياحة الميسرة المصرية"        },        "website": "www.egyptaccessibletourism.org",        "email": "info@egyptaccessibletourism.org",        "phone": "+20 2 12345678",        "services": {          "en": "Provides resources, tour operator recommendations, and pre-trip planning assistance for travelers with disabilities visiting Egypt.",          "ar": "توفر موارد وتوصيات منظمي الرحلات السياحية ومساعدة في التخطيط قبل الرحلة للمسافرين ذوي الإعاقة الذين يزورون مصر."        }      },      {        "name": {          "en": "Ministry of Tourism Accessibility Hotline",          "ar": "الخط الساخن لإمكانية الوصول بوزارة السياحة"        },        "website": "www.egypt.travel/accessibility",        "email": "accessibility@egypt.travel",        "phone": "+20 2 87654321",        "services": {          "en": "Government service providing information about accessibility at major tourist destinations and handling accessibility-related complaints or concerns.",          "ar": "خدمة حكومية توفر معلومات حول إمكانية الوصول في الوجهات السياحية الرئيسية والتعامل مع الشكاوى أو المخاوف المتعلقة بإمكانية الوصول."        }      }    ],    "specialized_tour_operators": [      {        "name": {          "en": "Accessible Egypt Tours",          "ar": "جولات مصر الميسرة"        },        "website": "www.accessibleegypttours.com",        "email": "bookings@accessibleegypttours.com",        "phone": "+20 2 11223344",        "services": {          "en": "Tour operator specializing in fully accessible travel experiences throughout Egypt, including desert adventures with adapted vehicles and equipment.",          "ar": "منظم رحلات متخصص في تجارب سفر يمكن الوصول إليها بالكامل في جميع أنحاء مصر، بما في ذلك مغامرات الصحراء بمركبات ومعدات مكيفة."        }      },      {        "name": {          "en": "Egypt for All",          "ar": "مصر للجميع"        },        "website": "www.egyptforall.com",        "email": "info@egyptforall.com",        "phone": "+20 2 55667788",        "services": {          "en": "Provides customized tours for travelers with various disabilities, including mobility, visual, hearing, and cognitive impairments. Offers specialized equipment rental.",          "ar": "يقدم جولات مخصصة للمسافرين ذوي الإعاقات المختلفة، بما في ذلك إعاقات الحركة والبصر والسمع والإعاقات المعرفية. يقدم تأجير معدات متخصصة."        }      }    ]  },  "last_updated": "2025-05-05T19:00:00Z"}