{  "id": "off_the_beaten_path_info",  "description": {    "en": "Information identifying attractions and experiences that are less known, less crowded, and offer a more unique or adventurous perspective compared to mainstream tourist sites.",    "ar": "معلومات تحدد المعالم والتجارب الأقل شهرة وازدحامًا، والتي تقدم منظورًا أكثر تفرداً أو مغامرة مقارنة بالمواقع السياحية الرئيسية."  },  "criteria": {    "low_visitor_numbers": {      "id": "low_visitor_numbers",      "name": {        "en": "Low Visitor Numbers",        "ar": "أعداد زوار منخفضة"      },      "description": {        "en": "Significantly fewer tourists compared to major attractions, offering a quieter and more intimate experience.",        "ar": "عدد سياح أقل بكثير مقارنة بالمعالم الرئيسية، مما يوفر تجربة أكثر هدوءًا وحميمية."      }    },    "requires_effort_to_reach": {      "id": "requires_effort_to_reach",      "name": {        "en": "Requires Effort to Reach",        "ar": "يتطلب جهدًا للوصول إليه"      },      "description": {        "en": "Location is remote or not easily accessible by standard public transport or typical tourist routes, often requiring special arrangements (e.g., 4x4, hiking, boat).",        "ar": "الموقع ناءٍ أو لا يمكن الوصول إليه بسهولة بواسطة وسائل النقل العام القياسية أو الطرق السياحية النموذجية، وغالبًا ما يتطلب ترتيبات خاصة (مثل الدفع الرباعي، والمشي لمسافات طويلة، والقوارب)."      }    },    "unique_cultural_natural_focus": {      "id": "unique_cultural_natural_focus",      "name": {        "en": "Unique Cultural or Natural Focus",        "ar": "تركيز ثقافي أو طبيعي فريد"      },      "description": {        "en": "Showcases niche aspects of Egyptian culture, history, or nature not typically highlighted in mainstream tourism.",        "ar": "يعرض جوانب متخصصة من الثقافة أو التاريخ أو الطبيعة المصرية لا يتم تسليط الضوء عليها عادةً في السياحة السائدة."      }    },    "limited_infrastructure": {      "id": "limited_infrastructure",      "name": {        "en": "Limited Tourist Infrastructure",        "ar": "بنية تحتية سياحية محدودة"      },      "description": {        "en": "Minimal tourist facilities (shops, restaurants, hotels) directly at the site, requiring visitors to be more self-sufficient.",        "ar": "مرافق سياحية قليلة (محلات، مطاعم، فنادق) مباشرة في الموقع، مما يتطلب من الزوار أن يكونوا أكثر اكتفاءً ذاتيًا."      }    },    "authentic_local_interaction": {      "id": "authentic_local_interaction",      "name": {        "en": "Potential for Authentic Local Interaction",        "ar": "إمكانية التفاعل المحلي الأصيل"      },      "description": {        "en": "Offers opportunities to interact with local communities in a more natural and less commercialized setting.",        "ar": "يوفر فرصًا للتفاعل مع المجتمعات المحلية في بيئة أكثر طبيعية وأقل تجارية."      }    }  },  "suitability_notes": {    "independent_travelers": {      "en": "Best suited for independent travelers or those seeking adventure and unique experiences over comfort and convenience.",      "ar": "الأنسب للمسافرين المستقلين أو أولئك الذين يبحثون عن المغامرة والتجارب الفريدة على حساب الراحة والملاءمة."    },    "requires_planning": {      "en": "Often requires more planning regarding transportation, accommodation, and supplies.",      "ar": "غالبًا ما يتطلب مزيدًا من التخطيط فيما يتعلق بالنقل والإقامة والإمدادات."    },    "may_need_guide": {      "en": "Specialized local guides might be necessary or highly recommended for navigation and cultural understanding.",      "ar": "قد يكون المرشدون المحليون المتخصصون ضروريين أو موصى بهم بشدة للملاحة والفهم الثقافي."    }  },  "site_specific_examples": [    {      "attraction_id": "gebel_el_silsila",      "applies_criteria": [        "low_visitor_numbers",        "requires_effort_to_reach",        "unique_cultural_natural_focus"      ],      "notes": {        "en": "Ancient sandstone quarries between Luxor and Aswan, primarily accessible by dahabiya or small boat, offering unique reliefs and shrines often missed by larger cruise ships.",        "ar": "محاجر الحجر الرملي القديمة بين الأقصر وأسوان، يمكن الوصول إليها بشكل أساسي عن طريق الدهبية أو القوارب الصغيرة، وتقدم نقوشًا ومزارات فريدة غالبًا ما تفوتها السفن السياحية الكبيرة."      }    },    {      "attraction_id": "wadi_al_hitan",       "applies_criteria": [        "low_visitor_numbers",        "requires_effort_to_reach",        "unique_cultural_natural_focus",        "limited_infrastructure"      ],      "notes": {        "en": "UNESCO site in Fayoum desert with exceptional whale fossils. Requires 4x4 access and offers basic camping or eco-lodge facilities.",        "ar": "موقع تراث عالمي لليونسكو في صحراء الفيوم يحتوي على حفريات حيتان استثنائية. يتطلب الوصول إليه سيارات الدفع الرباعي ويوفر مرافق تخييم أساسية أو نزل بيئية."      }    }      ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}