{  "id": "sustainable_tourism_info",  "description": {    "en": "Information highlighting attractions, accommodations, and tour operators that adhere to sustainable practices, focusing on environmental conservation, community benefit, and cultural preservation.",    "ar": "معلومات تسلط الضوء على المعالم السياحية وأماكن الإقامة ومنظمي الرحلات السياحية الذين يلتزمون بالممارسات المستدامة، مع التركيز على الحفاظ على البيئة، وفائدة المجتمع، والحفاظ على الثقافة."  },  "sustainability_features": {    "eco_certification": {      "id": "eco_certification",      "name": {        "en": "Recognized Eco-Certification",        "ar": "شهادة بيئية معترف بها"      },      "description": {        "en": "Holds certification from a recognized national or international sustainable tourism body (e.g., Green Star Hotel, Travelife).",        "ar": "حاصل على شهادة من هيئة سياحة مستدامة وطنية أو دولية معترف بها (مثل فندق النجمة الخضراء، ترافلايف)."      },      "icon": "eco_certified.svg"    },    "community_engagement": {      "id": "community_engagement",      "name": {        "en": "Strong Community Engagement",        "ar": "مشاركة مجتمعية قوية"      },      "description": {        "en": "Actively supports local communities through employment, sourcing local goods, funding community projects, or offering authentic cultural interactions.",        "ar": "يدعم بنشاط المجتمعات المحلية من خلال التوظيف، وشراء السلع المحلية، وتمويل المشاريع المجتمعية، أو تقديم تفاعلات ثقافية أصيلة."      },      "icon": "community_engagement.svg"    },    "conservation_efforts": {      "id": "conservation_efforts",      "name": {        "en": "Active Conservation Efforts",        "ar": "جهود حماية نشطة"      },      "description": {        "en": "Demonstrates commitment to environmental protection through measures like waste reduction, water conservation, renewable energy use, or wildlife protection programs.",        "ar": "يظهر الالتزام بحماية البيئة من خلال تدابير مثل تقليل النفايات، والحفاظ على المياه، واستخدام الطاقة المتجددة، أو برامج حماية الحياة البرية."      },      "icon": "conservation.svg"    },    "cultural_preservation": {      "id": "cultural_preservation",      "name": {        "en": "Cultural Heritage Preservation",        "ar": "الحفاظ على التراث الثقافي"      },      "description": {        "en": "Contributes to the preservation of local culture, traditions, architecture, or historical sites through responsible tourism practices.",        "ar": "يساهم في الحفاظ على الثقافة المحلية، والتقاليد، والهندسة المعمارية، أو المواقع التاريخية من خلال ممارسات السياحة المسؤولة."      },      "icon": "cultural_preservation.svg"    },    "sustainable_transport_options": {      "id": "sustainable_transport_options",      "name": {        "en": "Offers Sustainable Transport Options",        "ar": "يقدم خيارات نقل مستدامة"      },      "description": {        "en": "Provides or promotes lower-impact transportation methods like walking tours, cycling, electric vehicles, or shared transport.",        "ar": "يوفر أو يشجع على وسائل النقل ذات التأثير الأقل مثل الجولات سيرًا على الأقدام، وركوب الدراجات، والمركبات الكهربائية، أو النقل المشترك."      },      "icon": "sustainable_transport.svg"    }  },  "visitor_guidelines": {    "respect_local_culture": {      "en": "Respect local customs, traditions, and dress codes.",      "ar": "احترم العادات والتقاليد المحلية وقواعد اللباس."    },    "minimize_waste": {      "en": "Minimize waste generation, avoid single-use plastics, and dispose of trash responsibly.",      "ar": "قلل من توليد النفايات، وتجنب البلاستيك أحادي الاستخدام، وتخلص من القمامة بمسؤولية."    },    "conserve_resources": {      "en": "Conserve water and energy resources.",      "ar": "حافظ على موارد المياه والطاقة."    },    "support_local_economy": {      "en": "Support the local economy by purchasing local crafts and dining at local establishments.",      "ar": "ادعم الاقتصاد المحلي بشراء الحرف المحلية وتناول الطعام في المنشآت المحلية."    },    "protect_natural_areas": {      "en": "Stay on marked trails, do not disturb wildlife, and avoid damaging natural formations or historical sites.",      "ar": "ابق على المسارات المحددة، ولا تزعج الحياة البرية، وتجنب إتلاف التكوينات الطبيعية أو المواقع التاريخية."    }  },  "site_specific_examples": [    {      "entity_id": "adrere_amellal_siwa",       "entity_type": "accommodation",      "applied_features": [        "eco_certification",        "community_engagement",        "conservation_efforts",        "cultural_preservation"      ],      "notes": {        "en": "Renowned ecolodge in Siwa built with traditional materials, uses no electricity, relies on local staff and resources, promoting deep cultural immersion and minimal environmental impact.",        "ar": "نزل بيئي مشهور في سيوة مبني بمواد تقليدية، لا يستخدم الكهرباء، يعتمد على الموظفين والموارد المحلية، ويعزز الانغماس الثقافي العميق والحد الأدنى من التأثير البيئي."      }    },    {      "entity_id": "sekem_farm",       "entity_type": "attraction",       "applied_features": [        "community_engagement",        "conservation_efforts",        "sustainable_transport_options"       ],      "notes": {        "en": "Pioneering biodynamic agriculture project offering tours that highlight sustainable farming, community development, and holistic education.",        "ar": "مشروع رائد في الزراعة الحيوية يقدم جولات تسلط الضوء على الزراعة المستدامة، وتنمية المجتمع، والتعليم الشامل."      }    }      ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}