{
  "id": "cultural_insights",
  "name": {
    "en": "Cultural Insights Guide",
    "ar": "دليل المعرفة الثقافية"
  },
  "last_updated": "2024-03-20",
  "description": {
    "en": "Essential cultural insights and etiquette guidelines for visitors to Egypt, helping travelers navigate social situations and respect local customs.",
    "ar": "معلومات ثقافية أساسية وإرشادات آداب السلوك للزوار إلى مصر، لمساعدة المسافرين على التنقل في المواقف الاجتماعية واحترام العادات المحلية."
  },
  "social_etiquette": {
    "greetings": {
      "common_phrases": [
        {
          "phrase": "As-salamu alaykum",
          "translation": "Peace be upon you",
          "arabic": "السلام عليكم",
          "usage": "Standard greeting, appropriate in all situations"
        },
        {
          "phrase": "Ahlan wa sahlan",
          "translation": "Welcome",
          "arabic": "أهلاً وسهلاً",
          "usage": "Welcoming phrase, very common"
        },
        {
          "phrase": "Sabah el-kheir",
          "translation": "Good morning",
          "arabic": "صباح الخير",
          "usage": "Morning greeting"
        }
      ],
      "customs": {
        "en": "Handshakes are common between same gender. Wait for opposite gender to initiate handshake. Greetings are important and should not be rushed.",
        "ar": "المصافحة باليد شائعة بين نفس الجنس. انتظر حتى يبادر الجنس الآخر بالمصافحة. التحيات مهمة ولا ينبغي الاستعجال فيها."
      }
    },
    "dress_code": {
      "general": {
        "en": "Modest clothing is appreciated throughout Egypt. Shoulders and knees should be covered, especially in religious sites.",
        "ar": "يُفضل ارتداء الملابس المحتشمة في جميع أنحاء مصر. يجب تغطية الكتفين والركبتين، خاصة في المواقع الدينية."
      },
      "religious_sites": {
        "en": "Women should cover their hair in mosques. Everyone should remove shoes before entering.",
        "ar": "يجب على النساء تغطية شعرهن في المساجد. يجب على الجميع خلع الأحذية قبل الدخول."
      },
      "beach_areas": {
        "en": "More relaxed dress codes in beach resorts, but still maintain modesty in public areas.",
        "ar": "قواعد لباس أكثر مرونة في المنتجعات الشاطئية، ولكن يجب الحفاظ على الاحتشام في الأماكن العامة."
      }
    },
    "dining_etiquette": {
      "general_rules": {
        "en": "Eat with right hand only. It's polite to try all offered food. Leave a small amount on plate to show satisfaction.",
        "ar": "تناول الطعام باليد اليمنى فقط. من المهذب تجربة جميع الأطعمة المقدمة. اترك كمية صغيرة في الطبق لإظهار الرضا."
      },
      "ramadan": {
        "en": "During Ramadan, avoid eating, drinking, or smoking in public during daylight hours.",
        "ar": "خلال رمضان، تجنب الأكل والشرب أو التدخين في الأماكن العامة خلال ساعات النهار."
      }
    }
  },
  "business_customs": {
    "meetings": {
      "en": "Meetings may start later than scheduled. Relationships are important before business. Avoid scheduling meetings on Friday.",
      "ar": "قد تبدأ الاجتماعات في وقت متأخر عن الموعد المحدد. العلاقات مهمة قبل العمل. تجنب جدولة الاجتماعات يوم الجمعة."
    },
    "business_cards": {
      "en": "Present cards with right hand or both hands. Have one side in Arabic if possible.",
      "ar": "قدم البطاقات باليد اليمنى أو كلتا اليدين. يفضل أن يكون أحد الجانبين باللغة العربية إن أمكن."
    }
  },
  "monetary_customs": {
    "tipping": {
      "en": "Tipping (baksheesh) is expected for services. Usually 10-15% in restaurants, 5-10 EGP for porters/bathroom attendants.",
      "ar": "البقشيش متوقع مقابل الخدمات. عادة 10-15٪ في المطاعم، 5-10 جنيه مصري لحاملي الحقائب/عمال الحمامات."
    },
    "bargaining": {
      "en": "Bargaining is expected in markets (souks) and with street vendors. Start at 50% of initial price. Keep negotiations friendly.",
      "ar": "المساومة متوقعة في الأسواق ومع الباعة المتجولين. ابدأ بـ 50٪ من السعر الأولي. حافظ على ودية المفاوضات."
    }
  },
  "religious_customs": {
    "friday_prayers": {
      "en": "Many businesses close Friday afternoon for prayers. Plan accordingly.",
      "ar": "تغلق العديد من الشركات ظهر يوم الجمعة للصلاة. خطط وفقاً لذلك."
    },
    "ramadan_etiquette": {
      "en": "During Ramadan, businesses may have reduced hours. Evening is very social with festive atmosphere.",
      "ar": "خلال رمضان، قد تقل ساعات العمل. المساء اجتماعي جداً مع أجواء احتفالية."
    }
  },
  "photography": {
    "general_rules": {
      "en": "Always ask permission before photographing people. Some archaeological sites require permits.",
      "ar": "اطلب دائماً الإذن قبل تصوير الناس. بعض المواقع الأثرية تتطلب تصاريح."
    },
    "restricted_areas": {
      "en": "No photos of military installations, bridges, or government buildings.",
      "ar": "ممنوع التصوير للمنشآت العسكرية والجسور والمباني الحكومية."
    }
  },
  "common_gestures": [
    {
      "gesture": "Head up with tongue click",
      "meaning": {
        "en": "No",
        "ar": "لا"
      }
    },
    {
      "gesture": "Hand on heart after handshake",
      "meaning": {
        "en": "Greeting was sincere",
        "ar": "التحية كانت صادقة"
      }
    }
  ],
  "cultural_values": {
    "family": {
      "en": "Family is central to Egyptian society. Extended family relationships are very important.",
      "ar": "الأسرة هي محور المجتمع المصري. علاقات العائلة الممتدة مهمة جداً."
    },
    "hospitality": {
      "en": "Egyptians are known for their hospitality. Refusing offerings can be considered impolite.",
      "ar": "يُعرف المصريون بكرم الضيافة. رفض العروض قد يعتبر غير مهذب."
    },
    "respect_for_elders": {
      "en": "Strong respect for age and authority. Stand for elderly people, give up seats.",
      "ar": "احترام قوي للسن والسلطة. قف للمسنين، تنازل عن المقاعد."
    }
  }
}
