{
  "id": "egyptian_museum",
  "name": {
    "en": "Egyptian Museum",
    "ar": "المتحف المصري"
  },
  "type": "museum",
  "location": {
    "city": "Cairo",
    "city_ar": "القاهرة",
    "region": "Cairo",
    "region_ar": "القاهرة",
    "coordinates": {
      "latitude": 30.0478,
      "longitude": 31.2336
    }
  },
  "description": {
    "en": "The Egyptian Museum in Cairo, also known as the Museum of Egyptian Antiquities, houses an extensive collection of ancient Egyptian artifacts, making it one of the most important museums in the world for Egyptian history. It contains over 120,000 items, including the treasures of Tutankhamun and artifacts from the Valley of the Kings.",
    "ar": "المتحف المصري في القاهرة، المعروف أيضًا باسم متحف الآثار المصرية، يضم مجموعة واسعة من القطع الأثرية المصرية القديمة، مما يجعله واحدًا من أهم المتاحف في العالم للتاريخ المصري. يحتوي على أكثر من 120,000 قطعة، بما في ذلك كنوز توت عنخ آمون والقطع الأثرية من وادي الملوك."
  },
  "history": {
    "en": "The museum was established in 1835 and was originally located in Ezbekieh Garden. In 1902, it was moved to its current location in Tahrir Square in a neoclassical building designed by French architect Marcel Dourgnon. In 2021, many of the museum's most famous artifacts, including the Tutankhamun collection, were moved to the new Grand Egyptian Museum near the Giza Pyramids, which is set to be one of the largest archaeological museums in the world.",
    "ar": "تم تأسيس المتحف في عام 1835 وكان موقعه الأصلي في حديقة الأزبكية. في عام 1902، تم نقله إلى موقعه الحالي في ميدان التحرير في مبنى كلاسيكي حديث صممه المهندس المعماري الفرنسي مارسيل دورنيون. في عام 2021، تم نقل العديد من القطع الأثرية الأكثر شهرة في المتحف، بما في ذلك مجموعة توت عنخ آمون، إلى المتحف المصري الكبير الجديد بالقرب من أهرامات الجيزة، والذي من المقرر أن يكون أحد أكبر المتاحف الأثرية في العالم."
  },
  "practical_info": {
    "opening_hours": "9:00 AM - 5:00 PM daily, 9:00 AM - 3:00 PM during Ramadan",
    "ticket_prices": {
      "foreigners": {
        "adults": "240 EGP",
        "students": "120 EGP"
      },
      "egyptians": {
        "adults": "30 EGP",
        "students": "10 EGP"
      },
      "additional": {
        "photography": "50 EGP",
        "royal_mummy_hall": "180 EGP for foreigners, 40 EGP for Egyptians"
      }
    },
    "best_time_to_visit": "Early morning to avoid crowds, particularly on weekdays",
    "duration": "3-4 hours for a comprehensive visit",
    "facilities": [
      "Restrooms",
      "Café",
      "Gift shop",
      "Guided tours available",
      "Wheelchair accessible"
    ],
    "accessibility": {
      "en": "The museum is wheelchair accessible, but some areas may be difficult to navigate. It's recommended to contact the museum in advance for specific accessibility needs.",
      "ar": "المتحف متاح للكراسي المتحركة، ولكن قد يكون من الصعب التنقل في بعض المناطق. يُنصح بالاتصال بالمتحف مسبقًا للاحتياجات الخاصة بإمكانية الوصول."
    },
    "visitor_tips": {
      "en": "Hire a guide to make the most of your visit, as many artifacts have limited descriptions. Photography is allowed with a permit, but flash is prohibited. The museum can get very hot in summer, so dress comfortably and bring water.",
      "ar": "استئجار مرشد للاستفادة القصوى من زيارتك، حيث أن العديد من القطع الأثرية لديها أوصاف محدودة. يُسمح بالتصوير بتصريح، ولكن يُحظر استخدام الفلاش. يمكن أن يصبح المتحف حارًا جدًا في الصيف، لذا ارتدِ ملابس مريحة وأحضر الماء."
    }
  },
  "must_see": [
    {
      "id": "tutankhamun_treasures",
      "name": {
        "en": "Treasures of Tutankhamun",
        "ar": "كنوز توت عنخ آمون"
      },
      "description": {
        "en": "The most famous collection in the museum, featuring the gold mask, sarcophagi, and other treasures from the tomb of the boy king Tutankhamun.",
        "ar": "المجموعة الأكثر شهرة في المتحف، وتضم القناع الذهبي والتوابيت وغيرها من الكنوز من مقبرة الملك الشاب توت عنخ آمون."
      }
    },
    {
      "id": "royal_mummies",
      "name": {
        "en": "Royal Mummy Room",
        "ar": "غرفة المومياوات الملكية"
      },
      "description": {
        "en": "Houses the preserved remains of some of Egypt's most powerful pharaohs, including Ramesses II, Seti I, and Hatshepsut.",
        "ar": "تضم البقايا المحنطة لبعض أقوى فراعنة مصر، بما في ذلك رمسيس الثاني وسيتي الأول وحتشبسوت."
      }
    },
    {
      "id": "narmer_palette",
      "name": {
        "en": "Narmer Palette",
        "ar": "لوحة نعرمر"
      },
      "description": {
        "en": "A significant archaeological artifact from the Early Dynastic Period, depicting King Narmer's unification of Upper and Lower Egypt around 3100 BCE.",
        "ar": "قطعة أثرية هامة من عصر الأسرات المبكرة، تصور توحيد الملك نعرمر لمصر العليا والسفلى حوالي 3100 قبل الميلاد."
      }
    },
    {
      "id": "statue_khafre",
      "name": {
        "en": "Statue of Khafre",
        "ar": "تمثال خفرع"
      },
      "description": {
        "en": "A magnificent diorite statue of the Pharaoh Khafre, builder of the second pyramid at Giza, showing the king seated on his throne with the falcon god Horus protecting his head.",
        "ar": "تمثال رائع من حجر الديوريت للفرعون خفرع، باني الهرم الثاني في الجيزة، يظهر الملك جالسًا على عرشه مع الإله حورس الصقر الذي يحمي رأسه."
      }
    }
  ],
  "collections": [
    {
      "id": "old_kingdom",
      "name": {
        "en": "Old Kingdom Collection",
        "ar": "مجموعة الدولة القديمة"
      },
      "description": {
        "en": "Artifacts from the Old Kingdom period (2686–2181 BCE), including statues, stelae, and objects from the Pyramids era.",
        "ar": "قطع أثرية من فترة الدولة القديمة (2686-2181 قبل الميلاد)، بما في ذلك التماثيل واللوحات والأشياء من عصر الأهرامات."
      }
    },
    {
      "id": "middle_kingdom",
      "name": {
        "en": "Middle Kingdom Collection",
        "ar": "مجموعة الدولة الوسطى"
      },
      "description": {
        "en": "Artifacts from the Middle Kingdom period (2055–1650 BCE), known for its artistic renaissance and cultural developments.",
        "ar": "قطع أثرية من فترة الدولة الوسطى (2055-1650 قبل الميلاد)، المعروفة بنهضتها الفنية وتطوراتها الثقافية."
      }
    },
    {
      "id": "new_kingdom",
      "name": {
        "en": "New Kingdom Collection",
        "ar": "مجموعة الدولة الحديثة"
      },
      "description": {
        "en": "Artifacts from the New Kingdom period (1550–1069 BCE), Egypt's most prosperous time and the height of its power.",
        "ar": "قطع أثرية من فترة الدولة الحديثة (1550-1069 قبل الميلاد)، أكثر فترات مصر ازدهارًا وذروة قوتها."
      }
    },
    {
      "id": "late_period",
      "name": {
        "en": "Late and Ptolemaic Period Collection",
        "ar": "مجموعة العصر المتأخر والبطلمي"
      },
      "description": {
        "en": "Artifacts from the Late Period (664–332 BCE) and Ptolemaic Period (332–30 BCE), showing Egyptian art under Persian and Greek influences.",
        "ar": "قطع أثرية من العصر المتأخر (664-332 قبل الميلاد) والعصر البطلمي (332-30 قبل الميلاد)، تظهر الفن المصري تحت التأثيرات الفارسية واليونانية."
      }
    }
  ],
  "images": [
    "egyptian_museum_exterior.jpg",
    "tutankhamun_mask.jpg",
    "royal_mummies_hall.jpg",
    "narmer_palette.jpg",
    "statue_khafre.jpg",
    "egyptian_museum_main_hall.jpg"
  ],
  "related_attractions": ["pyramids_of_giza", "grand_egyptian_museum", "citadel_of_saladin", "khan_el_khalili"],
  "virtual_tour": {
    "available": true,
    "url": "https://egyptianmuseum.org/virtualtour",
    "description": {
      "en": "Explore the museum through our virtual tour, featuring 360-degree views of the main halls and detailed images of key artifacts.",
      "ar": "استكشف المتحف من خلال جولتنا الافتراضية، التي تتميز بمناظر 360 درجة للقاعات الرئيسية وصور مفصلة للقطع الأثرية الرئيسية."
    }
  },
  "trivia": [
    {
      "en": "The Egyptian Museum houses over 120,000 artifacts, though only a small percentage is on display at any given time.",
      "ar": "يضم المتحف المصري أكثر من 120,000 قطعة أثرية، رغم أن نسبة صغيرة فقط معروضة في أي وقت من الأوقات."
    },
    {
      "en": "The famous gold mask of Tutankhamun weighs about 11 kg (24 pounds) and is made of solid gold inlaid with colored glass and semiprecious stones.",
      "ar": "يزن قناع توت عنخ آمون الذهبي الشهير حوالي 11 كيلوغرامًا (24 رطلًا) وهو مصنوع من الذهب الخالص المرصع بالزجاج الملون والأحجار شبه الكريمة."
    },
    {
      "en": "In 2011, during the Egyptian Revolution, citizens formed a human chain around the museum to protect it from looters.",
      "ar": "في عام 2011، خلال الثورة المصرية، شكل المواطنون سلسلة بشرية حول المتحف لحمايته من اللصوص."
    }
  ],
  "events": [
    {
      "name": {
        "en": "Egyptology Lecture Series",
        "ar": "سلسلة محاضرات علم المصريات"
      },
      "description": {
        "en": "Monthly lectures by renowned Egyptologists on various aspects of ancient Egyptian civilization.",
        "ar": "محاضرات شهرية يقدمها علماء مصريات مشهورون حول جوانب مختلفة من الحضارة المصرية القديمة."
      },
      "schedule": "First Thursday of each month, 6:00 PM"
    },
    {
      "name": {
        "en": "Children's Workshop: Junior Archaeologist",
        "ar": "ورشة عمل للأطفال: عالم الآثار الصغير"
      },
      "description": {
        "en": "Educational workshop for children aged 8-12, teaching basic archaeology concepts through hands-on activities.",
        "ar": "ورشة عمل تعليمية للأطفال من عمر 8-12 سنة، تعلم مفاهيم علم الآثار الأساسية من خلال أنشطة عملية."
      },
      "schedule": "Saturdays, 10:00 AM - 12:00 PM"
    }
  ],
  "keywords": ["museum", "antiquities", "pharaohs", "Tutankhamun", "mummies", "artifacts", "Cairo", "archaeology", "ancient Egypt", "متحف", "آثار", "فراعنة", "توت عنخ آمون", "مومياوات", "قطع أثرية", "القاهرة", "علم الآثار", "مصر القديمة"],
  "updated_at": "2023-11-15T14:30:00Z"
}