{  "id": "karnak_temple",  "name": {    "en": "Karnak Temple Complex",    "ar": "معبد الكرنك"  },  "type": "temple",  "location": {    "city": "Luxor",    "city_ar": "الأقصر",    "region": "Upper Egypt",    "region_ar": "صعيد مصر",    "coordinates": {      "latitude": 25.7188,      "longitude": 32.6571    }  },  "description": {    "en": "The Karnak Temple Complex is a vast collection of ruined temples, chapels, pylons, and other buildings located in the ancient city of Thebes (modern-day Luxor). It is the largest ancient religious site in the world, covering an area of over 200 acres. Construction at the temple began during the Middle Kingdom and continued into the Ptolemaic period, though most of the extant buildings date from the New Kingdom. The complex was dedicated primarily to the Theban Triad of Amun, Mut, and Khonsu.",    "ar": "مجمع معبد الكرنك هو مجموعة واسعة من المعابد المتهدمة والمصليات والأبراج وغيرها من المباني الواقعة في مدينة طيبة القديمة (الأقصر حاليًا). وهو أكبر موقع ديني قديم في العالم، تغطي مساحته أكثر من 200 فدان. بدأ البناء في المعبد خلال الدولة الوسطى واستمر حتى العصر البطلمي، على الرغم من أن معظم المباني الموجودة تعود إلى الدولة الحديثة. كان المجمع مخصصًا بشكل أساسي للثالوث الطيبي المكون من آمون وموت وخونسو."  },  "history": {    "en": "Karnak's history spans nearly 2,000 years, from around 2055 BCE to 100 CE. The complex began with a modest temple during the Middle Kingdom and grew in size and significance with each successive pharaoh, who added their own structures and monuments. It reached its zenith during the New Kingdom (1550–1069 BCE), particularly under rulers like Hatshepsut, Thutmose III, and Ramesses II, who significantly expanded the complex. During this period, Karnak became the most important religious center in Egypt, with the High Priest of Amun often rivaling the pharaoh in power and influence. The complex continued to evolve through the Late Period and Ptolemaic era until the rise of Christianity in Egypt.",    "ar": "يمتد تاريخ الكرنك على مدار ما يقرب من 2000 عام، من حوالي 2055 قبل الميلاد إلى 100 بعد الميلاد. بدأ المجمع بمعبد متواضع خلال الدولة الوسطى ونما في الحجم والأهمية مع كل فرعون متعاقب، حيث أضاف كل منهم هياكلهم ونصبهم الخاصة. وصل إلى ذروته خلال الدولة الحديثة (1550-1069 قبل الميلاد)، خاصة تحت حكم مثل حتشبسوت وتحتمس الثالث ورمسيس الثاني، الذين وسعوا المجمع بشكل كبير. خلال هذه الفترة، أصبح الكرنك أهم مركز ديني في مصر، حيث كان الكاهن الأعلى لآمون يضاهي الفرعون في القوة والنفوذ. استمر المجمع في التطور خلال العصر المتأخر والعصر البطلمي حتى صعود المسيحية في مصر."  },  "practical_info": {    "opening_hours": "6:00 AM - 5:30 PM (October to April), 6:00 AM - 6:30 PM (May to September)",    "ticket_prices": {      "foreigners": {        "adults": "220 EGP",        "students": "110 EGP"      },      "egyptians": {        "adults": "30 EGP",        "students": "15 EGP"      },      "additional": {        "sound_and_light_show": "300 EGP for foreigners, 150 EGP for Egyptians"      }    },    "best_time_to_visit": "Early morning or late afternoon to avoid heat and crowds. Winter months (November to February) offer the most comfortable temperatures.",    "duration": "2-4 hours for a thorough visit",    "facilities": [      "Restrooms",      "Gift shops",      "Cafeteria",      "Information center",      "Guides available for hire",      "Seating areas in shade"    ],    "accessibility": {      "en": "The site is partially accessible for visitors with mobility challenges. The main paths are generally flat and wide, but some areas involve uneven terrain or steps. Wheelchair rental is not available on site.",      "ar": "الموقع متاح جزئيًا للزوار الذين يعانون من صعوبات في التنقل. المسارات الرئيسية عمومًا مسطحة وواسعة، ولكن بعض المناطق تنطوي على تضاريس غير مستوية أو درجات. لا تتوفر خدمة تأجير الكراسي المتحركة في الموقع."    },    "visitor_tips": {      "en": "Wear comfortable shoes and bring a hat, sunscreen, and plenty of water, especially in summer. Consider hiring a guide to fully appreciate the complex's vast history and significance. The site is very large, so plan your visit to focus on the highlights if time is limited. The Sound and Light Show in the evening offers a unique perspective of the temple.",      "ar": "ارتدِ أحذية مريحة وأحضر قبعة وواقي من الشمس والكثير من الماء، خاصة في الصيف. فكر في توظيف مرشد لتقدير تاريخ المجمع الواسع وأهميته بشكل كامل. الموقع كبير جدًا، لذا خطط لزيارتك للتركيز على أهم المعالم إذا كان الوقت محدودًا. يقدم عرض الصوت والضوء في المساء منظورًا فريدًا للمعبد."    }  },  "must_see": [    {      "id": "great_hypostyle_hall",      "name": {        "en": "Great Hypostyle Hall",        "ar": "قاعة الأعمدة الكبرى"      },      "description": {        "en": "The most famous section of Karnak, covering 54,000 square feet and featuring 134 massive columns arranged in 16 rows. The central 12 columns are 69 feet tall, while the outer 122 columns are 43 feet tall. The columns are decorated with intricate relief carvings, and some still retain their original colors.",        "ar": "القسم الأكثر شهرة في الكرنك، يغطي 54000 قدم مربع ويضم 134 عمودًا ضخمًا مرتبة في 16 صفًا. الأعمدة المركزية الـ12 يبلغ ارتفاعها 69 قدمًا، بينما الأعمدة الخارجية الـ122 يبلغ ارتفاعها 43 قدمًا. الأعمدة مزينة بنقوش نافرة معقدة، وبعضها لا يزال يحتفظ بألوانه الأصلية."      }    },    {      "id": "sacred_lake",      "name": {        "en": "Sacred Lake",        "ar": "البحيرة المقدسة"      },      "description": {        "en": "A large man-made lake that was used by priests for ritual purification and sacred rituals. It is the largest sacred lake in any Egyptian temple, measuring 120 by 77 meters and lined with stone blocks. Near the lake stands a giant scarab statue dedicated to Khepri, the morning manifestation of the sun god.",        "ar": "بحيرة كبيرة من صنع الإنسان كانت تستخدم من قبل الكهنة للتطهير الطقسي والطقوس المقدسة. إنها أكبر بحيرة مقدسة في أي معبد مصري، يبلغ قياسها 120 × 77 مترًا ومبطنة بكتل حجرية. بالقرب من البحيرة يقف تمثال جعران عملاق مخصص لخبري، مظهر الصباح لإله الشمس."      }    },    {      "id": "obelisks",      "name": {        "en": "Obelisks of Hatshepsut and Thutmose I",        "ar": "مسلات حتشبسوت وتحتمس الأول"      },      "description": {        "en": "Several impressive obelisks stand in the temple complex, including the 97-foot obelisk of Hatshepsut, one of the tallest ancient obelisks still standing in Egypt. These monolithic monuments were carved from single pieces of granite and transported from Aswan, over 200 kilometers away.",        "ar": "تقف عدة مسلات مثيرة للإعجاب في مجمع المعبد، بما في ذلك مسلة حتشبسوت البالغ ارتفاعها 97 قدمًا، وهي واحدة من أطول المسلات القديمة التي لا تزال قائمة في مصر. تم نحت هذه النصب التذكارية المتكاملة من قطع واحدة من الجرانيت ونقلها من أسوان، على بعد أكثر من 200 كيلومتر."      }    },    {      "id": "avenue_of_sphinxes",      "name": {        "en": "Avenue of Sphinxes",        "ar": "طريق أبو الهول"      },      "description": {        "en": "A 3-kilometer processional route that once connected Karnak Temple to Luxor Temple, lined with hundreds of sphinx statues. The avenue has been extensively restored and was reopened to the public in 2021 after decades of excavation work.",        "ar": "طريق موكب بطول 3 كيلومترات كان يربط في السابق بين معبد الكرنك ومعبد الأقصر، محاط بمئات تماثيل أبو الهول. تم ترميم الطريق بشكل مكثف وأعيد افتتاحه للجمهور في عام 2021 بعد عقود من أعمال التنقيب."      }    }  ],  "components": [    {      "id": "first_pylon",      "name": {        "en": "First Pylon",        "ar": "الصرح الأول"      },      "description": {        "en": "The main entrance to the temple complex, built during the Late Period. At 113 meters wide and 15 meters thick, it is the largest pylon in Egypt, though it was never fully completed.",        "ar": "المدخل الرئيسي لمجمع المعبد، بني خلال العصر المتأخر. بعرض 113 مترًا وسماكة 15 مترًا، إنه أكبر صرح في مصر، على الرغم من أنه لم يكتمل أبدًا."      }    },    {      "id": "temple_of_amun_re",      "name": {        "en": "Temple of Amun-Re",        "ar": "معبد آمون رع"      },      "description": {        "en": "The main temple within the complex, dedicated to Amun-Re, the king of the gods. It includes the Great Hypostyle Hall, sanctuaries, and various other chambers.",        "ar": "المعبد الرئيسي داخل المجمع، مخصص لآمون رع، ملك الآلهة. يشمل قاعة الأعمدة الكبرى والمقادس وغرف أخرى متنوعة."      }    },    {      "id": "temple_of_khonsu",      "name": {        "en": "Temple of Khonsu",        "ar": "معبد خونسو"      },      "description": {        "en": "A relatively well-preserved temple dedicated to Khonsu, the moon god and son of Amun and Mut. It was built during the New Kingdom and modified during the Ptolemaic period.",        "ar": "معبد محفوظ نسبيًا مخصص لخونسو، إله القمر وابن آمون وموت. تم بناؤه خلال الدولة الحديثة وتم تعديله خلال العصر البطلمي."      }    },    {      "id": "festival_temple_of_tuthmosis_iii",      "name": {        "en": "Festival Temple of Thutmose III",        "ar": "معبد عيد تحتمس الثالث"      },      "description": {        "en": "Also known as the 'Akhmenu' or 'Shrine of Millions of Years,' this temple was built by Thutmose III to celebrate his jubilee and military victories. It features unique tent-pole style columns.",        "ar": "المعروف أيضًا باسم 'أخمنو' أو 'ضريح ملايين السنين'، تم بناء هذا المعبد من قبل تحتمس الثالث للاحتفال بيوبيله وانتصاراته العسكرية. يتميز بأعمدة فريدة من نوعها على شكل عمود خيمة."      }    },    {      "id": "temple_of_ptah",      "name": {        "en": "Temple of Ptah",        "ar": "معبد بتاح"      },      "description": {        "en": "A small but well-preserved temple dedicated to Ptah, the creator god of Memphis. It was built by Thutmose III and later expanded by the Ptolemies.",        "ar": "معبد صغير ولكنه محفوظ جيدًا مخصص لبتاح، إله الخالق في ممفيس. تم بناؤه من قبل تحتمس الثالث وتم توسيعه لاحقًا من قبل البطالمة."      }    },    {      "id": "open_air_museum",      "name": {        "en": "Open Air Museum",        "ar": "المتحف المفتوح"      },      "description": {        "en": "A collection of reconstructed buildings and architectural elements discovered during excavations at Karnak, including the Red Chapel of Hatshepsut.",        "ar": "مجموعة من المباني المعاد بناؤها والعناصر المعمارية التي تم اكتشافها أثناء الحفريات في الكرنك، بما في ذلك المصلى الأحمر لحتشبسوت."      }    }  ],  "festivals": [    {      "id": "opet_festival",      "name": {        "en": "Opet Festival",        "ar": "عيد الأوبت"      },      "description": {        "en": "An ancient annual festival where the statue of Amun-Re was carried in procession from Karnak to Luxor Temple. This 2-3 week celebration marked the rebirth of the pharaoh's powers through union with Amun.",        "ar": "مهرجان سنوي قديم حيث كان تمثال آمون رع يُحمل في موكب من الكرنك إلى معبد الأقصر. احتفل هذا الاحتفال الذي استمر من 2 إلى 3 أسابيع بإعادة ولادة قوى الفرعون من خلال الاتحاد مع آمون."      }    },    {      "id": "beautiful_feast_of_the_valley",      "name": {        "en": "Beautiful Feast of the Valley",        "ar": "عيد الوادي الجميل"      },      "description": {        "en": "A festival where the statues of the Theban Triad were carried across the Nile to visit the royal memorial temples and the necropolis, allowing the living to commune with their deceased ancestors.",        "ar": "مهرجان حيث كانت تماثيل الثالوث الطيبي تُحمل عبر النيل لزيارة معابد الذكرى الملكية والجبانة، مما يسمح للأحياء بالتواصل مع أسلافهم المتوفين."      }    }  ],  "images": [    "karnak_aerial_view.jpg",    "karnak_hypostyle_hall.jpg",    "karnak_obelisk.jpg",    "karnak_sacred_lake.jpg",    "karnak_avenue_sphinxes.jpg",    "karnak_sunset.jpg"  ],  "related_attractions": ["luxor_temple", "valley_of_the_kings", "hatshepsut_temple", "luxor_museum"],  "sound_and_light_show": {    "available": true,    "schedule": {      "en": "Shows in English: 7:00 PM and 9:00 PM. Shows in other languages available at different times. Schedule varies by season.",      "ar": "العروض باللغة الإنجليزية: 7:00 مساءً و 9:00 مساءً. العروض بلغات أخرى متاحة في أوقات مختلفة. الجدول يختلف حسب الموسم."    },    "description": {      "en": "An immersive nighttime experience that combines narration, music, and dramatic lighting to tell the story of ancient Thebes and the pharaohs who built Karnak. Visitors walk through the illuminated temple as the narrative unfolds.",      "ar": "تجربة ليلية غامرة تجمع بين السرد والموسيقى والإضاءة الدرامية لرواية قصة طيبة القديمة والفراعنة الذين بنوا الكرنك. يمشي الزوار عبر المعبد المضاء مع تكشف السرد."    }  },  "trivia": [    {      "en": "The Great Hypostyle Hall alone covers more area than the entirety of Notre Dame Cathedral in Paris.",      "ar": "تغطي قاعة الأعمدة الكبرى وحدها مساحة أكبر من كاتدرائية نوتردام بأكملها في باريس."    },    {      "en": "The largest obelisk at Karnak weighs approximately 328 tons and stands 29 meters tall.",      "ar": "أكبر مسلة في الكرنك يبلغ وزنها حوالي 328 طنًا ويبلغ ارتفاعها 29 مترًا."    },    {      "en": "The temple complex took around 2,000 years to build, with more than 30 pharaohs contributing to its construction.",      "ar": "استغرق بناء مجمع المعبد حوالي 2000 عام، حيث ساهم أكثر من 30 فرعونًا في بنائه."    },    {      "en": "Before modern restoration, parts of the temple were buried under sand and silt for centuries, helping to preserve many of its features.",      "ar": "قبل الترميم الحديث، كانت أجزاء من المعبد مدفونة تحت الرمال والطمي لقرون، مما ساعد على الحفاظ على العديد من ميزاته."    }  ],  "conservation": {    "status": {      "en": "Ongoing preservation and restoration work is being conducted by the Egyptian Ministry of Antiquities in cooperation with international organizations. Climate change, tourism impacts, and groundwater issues are current conservation challenges.",      "ar": "يتم إجراء أعمال الحفظ والترميم المستمرة من قبل وزارة الآثار المصرية بالتعاون مع المنظمات الدولية. تغير المناخ وتأثيرات السياحة ومشاكل المياه الجوفية هي تحديات الحفظ الحالية."    },    "recent_projects": [      {        "en": "Restoration of the Avenue of Sphinxes (completed 2021)",        "ar": "ترميم طريق أبو الهول (اكتمل 2021)"      },      {        "en": "Conservation of polychrome reliefs in the Hypostyle Hall (ongoing)",        "ar": "الحفاظ على النقوش متعددة الألوان في قاعة الأعمدة (مستمر)"      },      {        "en": "Structural reinforcement of vulnerable columns and walls (ongoing)",        "ar": "تعزيز هيكلي للأعمدة والجدران الضعيفة (مستمر)"      }    ]  },  "keywords": ["Karnak", "temple", "Luxor", "Amun", "Thebes", "obelisk", "hypostyle", "ancient Egypt", "pharaoh", "الكرنك", "معبد", "الأقصر", "آمون", "طيبة", "مسلة", "قاعة الأعمدة", "مصر القديمة", "فرعون"],  "updated_at": "2023-12-10T09:45:00Z"}