{
  "id": "philae_temple",
  "name": {
    "en": "Temple of Philae",
    "ar": "معبد فيلة"
  },
  "type": "temple",
  "location": {
    "city": "Aswan",
    "city_ar": "أسوان",
    "region": "Upper Egypt",
    "region_ar": "صعيد مصر",
    "coordinates": {
      "latitude": 24.0134,
      "longitude": 32.8832
    }
  },
  "description": {
    "en": "The Temple of Philae is a magnificent temple complex dedicated to the goddess Isis. Originally located on Philae Island, it was dismantled and relocated to nearby Agilkia Island as part of the UNESCO project to save monuments threatened by the construction of the Aswan High Dam. The temple complex is a stunning example of ancient Egyptian architecture and is notable for being one of the last active temples of the ancient Egyptian religion.",
    "ar": "معبد فيلة هو مجمع معبد رائع مكرس للإلهة إيزيس. كان يقع في الأصل على جزيرة فيلة، وتم تفكيكه ونقله إلى جزيرة أجيليكا المجاورة كجزء من مشروع اليونسكو لإنقاذ المعالم المهددة ببناء السد العالي في أسوان. مجمع المعبد هو مثال مذهل للعمارة المصرية القديمة ومعروف بكونه أحد آخر المعابد النشطة في الديانة المصرية القديمة."
  },
  "history": {
    "en": "Construction of the temple began around 380 BC and continued into the Roman period. The temple was one of the last outposts where the ancient Egyptian religion was practiced, continuing until the 6th century AD. In the 1960s, the temple was threatened by flooding from the Aswan High Dam, leading to a massive UNESCO-led rescue operation that took place between 1972 and 1980, during which the entire temple complex was dismantled into 40,000 pieces and reassembled on higher ground on Agilkia Island.",
    "ar": "بدأ بناء المعبد حوالي 380 قبل الميلاد واستمر حتى العصر الروماني. كان المعبد أحد آخر المعاقل التي مورست فيها الديانة المصرية القديمة، واستمر حتى القرن السادس الميلادي. في الستينيات، كان المعبد مهدداً بالغرق من السد العالي في أسوان، مما أدى إلى عملية إنقاذ ضخمة بقيادة اليونسكو جرت بين 1972 و1980، حيث تم تفكيك مجمع المعبد بأكمله إلى 40,000 قطعة وإعادة تجميعه على أرض مرتفعة في جزيرة أجيليكا."
  },
  "practical_info": {
    "opening_hours": "7:00 AM - 4:00 PM (October to May), 7:00 AM - 5:00 PM (June to September)",
    "ticket_prices": {
      "foreigners": {
        "adults": "180 EGP",
        "students": "90 EGP"
      },
      "egyptians": {
        "adults": "20 EGP",
        "students": "10 EGP"
      },
      "additional": {
        "sound_and_light_show": "300 EGP for foreigners, 150 EGP for Egyptians"
      }
    },
    "best_time_to_visit": "Early morning or late afternoon for best lighting and photography. The Sound and Light show in the evening is highly recommended.",
    "duration": "2-3 hours for a thorough visit",
    "facilities": [
      "Boat dock",
      "Visitor center",
      "Restrooms",
      "Gift shop",
      "Cafeteria",
      "Shaded rest areas"
    ],
    "accessibility": {
      "en": "The site requires a short boat ride to access. Most of the temple complex is accessible via ramps and walkways, though some areas have steps. The terrain is generally flat but uneven in places.",
      "ar": "يتطلب الوصول إلى الموقع رحلة قصيرة بالقارب. يمكن الوصول إلى معظم مجمع المعبد عبر منحدرات وممرات، رغم أن بعض المناطق بها درجات. الأرض مستوية بشكل عام ولكنها غير مستوية في بعض الأماكن."
    },
    "visitor_tips": {
      "en": "Book boat tickets in advance during peak season. Bring sun protection and water. The evening Sound and Light show offers a unique perspective. Photography is allowed but tripods may require permits.",
      "ar": "احجز تذاكر القارب مسبقاً خلال موسم الذروة. أحضر واقي من الشمس وماء. يقدم عرض الصوت والضوء المسائي منظوراً فريداً. التصوير مسموح به ولكن قد تتطلب الحوامل ثلاثية القوائم تصاريح."
    }
  },
  "must_see": [
    {
      "id": "first_pylon",
      "name": {
        "en": "First Pylon",
        "ar": "الصرح الأول"
      },
      "description": {
        "en": "The main entrance to the temple complex, featuring massive towers decorated with reliefs of Ptolemy XII smiting enemies before Isis and Horus.",
        "ar": "المدخل الرئيسي لمجمع المعبد، يتميز بأبراج ضخمة مزينة بنقوش لبطليموس الثاني عشر وهو يضرب الأعداء أمام إيزيس وحورس."
      }
    },
    {
      "id": "isis_temple",
      "name": {
        "en": "Temple of Isis",
        "ar": "معبد إيزيس"
      },
      "description": {
        "en": "The main temple dedicated to the goddess Isis, featuring beautifully preserved reliefs and hieroglyphic inscriptions depicting ancient Egyptian myths and rituals.",
        "ar": "المعبد الرئيسي المكرس للإلهة إيزيس، يتميز بنقوش محفوظة بشكل جميل ونقوش هيروغليفية تصور الأساطير والطقوس المصرية القديمة."
      }
    },
    {
      "id": "kiosk_trajan",
      "name": {
        "en": "Kiosk of Trajan",
        "ar": "كشك تراجان"
      },
      "description": {
        "en": "An elegant Roman-era structure with fourteen massive columns, often called 'Pharaoh's Bed'. One of the most photographed structures on the island.",
        "ar": "مبنى أنيق من العصر الروماني به أربعة عشر عموداً ضخماً، يُطلق عليه غالباً 'سرير الفرعون'. أحد أكثر المباني تصويراً في الجزيرة."
      }
    }
  ],
  "components": [
    {
      "id": "mammisi",
      "name": {
        "en": "Mammisi (Birth House)",
        "ar": "ماميزي (بيت الولادة)"
      },
      "description": {
        "en": "A small temple dedicated to Horus, son of Isis and Osiris. Decorated with scenes of the divine birth and childhood of Horus.",
        "ar": "معبد صغير مكرس لحورس، ابن إيزيس وأوزوريس. مزين بمشاهد الولادة الإلهية وطفولة حورس."
      }
    },
    {
      "id": "hathor_chapel",
      "name": {
        "en": "Chapel of Hathor",
        "ar": "مصلى حتحور"
      },
      "description": {
        "en": "A small chapel dedicated to the goddess Hathor, featuring reliefs of musicians and offerings to the goddess.",
        "ar": "مصلى صغير مكرس للإلهة حتحور، يضم نقوشاً للموسيقيين والقرابين للإلهة."
      }
    },
    {
      "id": "nilometer",
      "name": {
        "en": "Nilometer",
        "ar": "مقياس النيل"
      },
      "description": {
        "en": "Ancient structure used to measure the Nile's water levels and predict the annual flood.",
        "ar": "مبنى قديم استخدم لقياس مستويات مياه النيل والتنبؤ بالفيضان السنوي."
      }
    }
  ],
  "festivals": [
    {
      "id": "sound_and_light",
      "name": {
        "en": "Philae Sound and Light Show",
        "ar": "عرض الصوت والضوء في فيلة"
      },
      "description": {
        "en": "Evening spectacle that brings the temple's history to life through dramatic lighting and narration in multiple languages.",
        "ar": "عرض مسائي يحيي تاريخ المعبد من خلال الإضاءة الدرامية والسرد بلغات متعددة."
      }
    }
  ],
  "images": [
    "philae_aerial.jpg",
    "isis_temple_entrance.jpg",
    "trajan_kiosk.jpg",
    "temple_reliefs.jpg",
    "sound_and_light.jpg"
  ]
}
