{  "id": "general_etiquette",  "topic": "General Cultural Etiquette and Norms",  "points": [    {      "id": "greetings",      "summary": {        "en": "Polite greetings are important. Use 'Salam Aleikum' (Peace be upon you) as a general greeting. Handshakes are common between men. Some conservative individuals may avoid physical contact between opposite sexes.",        "ar": "التحيات المهذبة مهمة. استخدم 'السلام عليكم' كتحية عامة. المصافحة شائعة بين الرجال. قد يتجنب بعض الأفراد المحافظين الاتصال الجسدي بين الجنسين."      }    },    {      "id": "dress_code",      "summary": {        "en": "Dress modestly, especially when visiting religious sites or outside major tourist areas. Shoulders and knees should generally be covered for both men and women in mosques and churches.",        "ar": "ارتدِ ملابس محتشمة، خاصة عند زيارة المواقع الدينية أو خارج المناطق السياحية الرئيسية. يجب تغطية الكتفين والركبتين بشكل عام لكل من الرجال والنساء في المساجد والكنائس."      }    },    {      "id": "photography",      "summary": {        "en": "Always ask permission before photographing people, especially women and children. Photography may be restricted at military sites, bridges, and some government buildings.",        "ar": "اطلب الإذن دائمًا قبل تصوير الأشخاص، وخاصة النساء والأطفال. قد يكون التصوير مقيدًا في المواقع العسكرية والجسور وبعض المباني الحكومية."      }    },    {      "id": "public_displays_affection",      "summary": {        "en": "Public displays of affection between couples are generally frowned upon and should be avoided.",        "ar": "لا يُنظر بعين الرضا بشكل عام إلى إظهار المودة علنًا بين الأزواج ويجب تجنبه."      }    },    {      "id": "dining",      "summary": {        "en": "If invited to someone's home, it's polite to bring a small gift (like sweets). Use your right hand for eating and handling food, as the left hand is considered unclean in Islamic tradition.",        "ar": "إذا دعيت إلى منزل شخص ما، فمن الأدب إحضار هدية صغيرة (مثل الحلويات). استخدم يدك اليمنى للأكل والتعامل مع الطعام، حيث تعتبر اليد اليسرى غير نظيفة في التقاليد الإسلامية."      }    },    {      "id": "ramadan",      "summary": {        "en": "During the holy month of Ramadan, be mindful that Muslims are fasting from dawn till dusk. Avoid eating, drinking, or smoking in public during fasting hours out of respect.",        "ar": "خلال شهر رمضان المبارك، كن على علم بأن المسلمين يصومون من الفجر حتى الغسق. تجنب الأكل أو الشرب أو التدخين في الأماكن العامة خلال ساعات الصيام احترامًا."      }    },    {      "id": "tipping",      "summary": {        "en": "Tipping ('Baksheesh') is customary for many services. Small tips are appreciated for minor services (restroom attendants, assistance with bags). Tip around 10-15% in restaurants if service charge isn't included.",        "ar": "الإكرامية ('البقشيش') customary للعديد من الخدمات. تقدر الإكراميات الصغيرة للخدمات البسيطة (عمال دورات المياه، المساعدة في حمل الحقائب). اترك إكرامية حوالي 10-15٪ في المطاعم إذا لم تكن رسوم الخدمة مدرجة."      }    }  ],  "tags": [    "cultural_norms",    "etiquette",    "egypt",    "travel_tips",    "respect",    "customs"  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}