{  "id": "holidays_and_festivals",  "name": {    "en": "Egyptian Holidays and Festivals",    "ar": "الأعياد والمهرجانات المصرية"  },  "description": {    "en": "Egypt celebrates a diverse array of holidays and festivals throughout the year, reflecting its rich cultural heritage and religious traditions. From ancient Pharaonic celebrations to Islamic and Coptic Christian observances, as well as modern national holidays, these events offer visitors a unique glimpse into Egyptian culture and community life.",    "ar": "تحتفل مصر بمجموعة متنوعة من الأعياد والمهرجانات على مدار العام، مما يعكس تراثها الثقافي الغني وتقاليدها الدينية. من الاحتفالات الفرعونية القديمة إلى المناسبات الإسلامية والمسيحية القبطية، بالإضافة إلى الأعياد الوطنية الحديثة، توفر هذه الأحداث للزوار لمحة فريدة عن الثقافة المصرية وحياة المجتمع."  },  "major_holidays": [    {      "id": "eid_al_fitr",      "name": {        "en": "Eid al-Fitr",        "ar": "عيد الفطر"      },      "type": "religious_islamic",      "timing": "Variable (follows Ramadan, based on Islamic lunar calendar)",      "duration": "3-4 days",      "description": {        "en": "Marking the end of Ramadan, the holy month of fasting, Eid al-Fitr is one of Egypt's most important religious holidays. Families gather for festive meals, exchange gifts, wear new clothes, and visit relatives. Streets and homes are decorated, and charitable giving (Zakat al-Fitr) is an essential part of the celebration. Public spaces are filled with festivities, and special sweets like kahk (cookies filled with nuts and covered with powdered sugar) are prepared and shared.",        "ar": "يعد عيد الفطر، الذي يحتفل بنهاية شهر رمضان المبارك شهر الصيام، أحد أهم الأعياد الدينية في مصر. تجتمع العائلات لتناول وجبات احتفالية، وتتبادل الهدايا، وترتدي ملابس جديدة، وتزور الأقارب. تُزين الشوارع والمنازل، وتعتبر زكاة الفطر جزءًا أساسيًا من الاحتفال. تمتلئ الأماكن العامة بالاحتفالات، ويتم تحضير ومشاركة الحلويات الخاصة مثل كعك العيد (بسكويت محشو بالمكسرات ومغطى بالسكر البودرة)."      },      "tourist_impact": {        "en": "During Eid al-Fitr, government offices, banks, and many businesses close. Tourist sites remain open but may have adjusted hours. Transportation and accommodations should be booked well in advance as many Egyptians travel during this period. It's an excellent time to experience authentic Egyptian cultural traditions, though expect crowds at popular destinations.",        "ar": "خلال عيد الفطر، تغلق المكاتب الحكومية والبنوك والعديد من الشركات. تبقى المواقع السياحية مفتوحة ولكن قد تكون لديها ساعات معدلة. يجب حجز وسائل النقل وأماكن الإقامة مسبقًا بوقت كافٍ حيث يسافر العديد من المصريين خلال هذه الفترة. إنه وقت ممتاز لتجربة التقاليد الثقافية المصرية الأصيلة، على الرغم من توقع الازدحام في الوجهات الشهيرة."      }    },    {      "id": "eid_al_adha",      "name": {        "en": "Eid al-Adha",        "ar": "عيد الأضحى"      },      "type": "religious_islamic",      "timing": "Variable (based on Islamic lunar calendar, approximately 70 days after Eid al-Fitr)",      "duration": "4 days",      "description": {        "en": "Known as the Feast of Sacrifice, Eid al-Adha commemorates Prophet Ibrahim's willingness to sacrifice his son in obedience to God. Families sacrifice animals (typically sheep or goats) and distribute the meat among family, neighbors, and the poor. Like Eid al-Fitr, it involves family gatherings, festive meals, new clothes, and visits to relatives and friends. Prayer services are held in the morning, followed by celebrations.",        "ar": "يُعرف عيد الأضحى باسم عيد التضحية، ويحيي استعداد النبي إبراهيم للتضحية بابنه طاعة لله. تقوم العائلات بذبح الحيوانات (عادة الأغنام أو الماعز) وتوزيع اللحوم بين العائلة والجيران والفقراء. مثل عيد الفطر، يتضمن تجمعات عائلية، ووجبات احتفالية، وملابس جديدة، وزيارات للأقارب والأصدقاء. تقام صلوات العيد في الصباح، تليها احتفالات."      },      "tourist_impact": {        "en": "Similar to Eid al-Fitr, expect government offices and many businesses to close for several days. Tourist attractions remain open with possible adjusted hours. Streets may be crowded with celebrations and animal sacrifices may be visible in some areas, which might be unsettling for some visitors. Advance bookings for accommodations and transportation are highly recommended.",        "ar": "مشابه لعيد الفطر، توقع إغلاق المكاتب الحكومية والعديد من الشركات لعدة أيام. تبقى المعالم السياحية مفتوحة مع احتمال تعديل ساعات العمل. قد تكون الشوارع مزدحمة بالاحتفالات وقد تكون ذبائح الحيوانات مرئية في بعض المناطق، مما قد يكون مزعجًا لبعض الزوار. يوصى بشدة بالحجز المسبق لأماكن الإقامة ووسائل النقل."      }    },    {      "id": "coptic_christmas",      "name": {        "en": "Coptic Christmas",        "ar": "عيد الميلاد القبطي"      },      "type": "religious_christian",      "timing": "January 7th (fixed date)",      "duration": "1 day (with celebrations extending before and after)",      "description": {        "en": "Egypt's Coptic Orthodox Christians, who make up about 10-15% of the population, celebrate Christmas on January 7th according to the Julian calendar. The celebration is preceded by a 43-day fast. Christmas Eve (January 6th) features midnight mass services in churches across Egypt, with the main service held at Cairo's St. Mark's Cathedral, often attended by government officials. Christmas Day includes family gatherings, festive meals, and the exchange of gifts.",        "ar": "يحتفل المسيحيون الأرثوذكس الأقباط في مصر، الذين يشكلون حوالي 10-15٪ من السكان، بعيد الميلاد في 7 يناير وفقًا للتقويم اليولياني. يسبق الاحتفال صيام لمدة 43 يومًا. تتميز ليلة عيد الميلاد (6 يناير) بقداس منتصف الليل في الكنائس في جميع أنحاء مصر، حيث تقام الخدمة الرئيسية في كاتدرائية القديس مرقس بالقاهرة، وغالبًا ما يحضرها مسؤولون حكوميون. يتضمن يوم عيد الميلاد تجمعات عائلية، ووجبات احتفالية، وتبادل الهدايا."      },      "tourist_impact": {        "en": "Coptic Christmas is an official holiday in Egypt, with government offices and some businesses closed. The celebration presents a unique opportunity to experience Egypt's Christian heritage. Visitors can attend Christmas Eve services at historic churches (with permission), though they should dress respectfully and follow local customs. Coptic neighborhoods like Old Cairo are especially festive during this time.",        "ar": "عيد الميلاد القبطي هو عطلة رسمية في مصر، حيث تغلق المكاتب الحكومية وبعض الشركات. يقدم الاحتفال فرصة فريدة لتجربة التراث المسيحي في مصر. يمكن للزوار حضور خدمات ليلة عيد الميلاد في الكنائس التاريخية (بإذن)، على الرغم من أنه يجب عليهم ارتداء ملابس محترمة واتباع العادات المحلية. الأحياء القبطية مثل القاهرة القديمة احتفالية بشكل خاص خلال هذا الوقت."      }    },    {      "id": "sham_el_nessim",      "name": {        "en": "Sham El-Nessim",        "ar": "شم النسيم"      },      "type": "cultural_national",      "timing": "Monday following Eastern Orthodox Easter (usually in April)",      "duration": "1 day",      "description": {        "en": "Dating back to ancient Egyptian times, Sham El-Nessim (literally 'smelling the breeze') is a spring festival that has been celebrated for thousands of years. Egyptians of all faiths observe this national holiday by spending the day outdoors in parks, gardens, and along the Nile, enjoying picnics and family gatherings. Traditional foods include colored boiled eggs (similar to Easter eggs), salted fish (feseekh), green onions, and lettuce, each with symbolic meaning related to renewal and life.",        "ar": "يعود تاريخ شم النسيم (حرفيًا 'شم النسيم') إلى العصور المصرية القديمة، وهو مهرجان ربيعي يتم الاحتفال به منذ آلاف السنين. يحتفل المصريون من جميع الأديان بهذه العطلة الوطنية بقضاء اليوم في الهواء الطلق في الحدائق والمتنزهات وعلى طول نهر النيل، والاستمتاع بالنزهات والتجمعات العائلية. تشمل الأطعمة التقليدية البيض المسلوق الملون (مشابه لبيض عيد الفصح)، والأسماك المملحة (الفسيخ)، والبصل الأخضر، والخس، ولكل منها معنى رمزي متعلق بالتجدد والحياة."      },      "tourist_impact": {        "en": "As a public holiday, expect government offices and some businesses to be closed. Parks, beaches, and public spaces are extremely crowded, and traffic can be heavy. For tourists, it's a wonderful opportunity to experience a uniquely Egyptian celebration that transcends religious divisions, though you might want to plan ahead to avoid the most crowded areas.",        "ar": "باعتبارها عطلة رسمية، توقع إغلاق المكاتب الحكومية وبعض الشركات. تكون المتنزهات والشواطئ والأماكن العامة مزدحمة للغاية، وقد تكون حركة المرور كثيفة. بالنسبة للسياح، إنها فرصة رائعة لتجربة احتفال مصري فريد يتجاوز الانقسامات الدينية، على الرغم من أنك قد ترغب في التخطيط مسبقًا لتجنب المناطق الأكثر ازدحامًا."      }    },    {      "id": "revolution_day",      "name": {        "en": "Revolution Day (January 25)",        "ar": "عيد الثورة (25 يناير)"      },      "type": "national",      "timing": "January 25 (fixed date)",      "duration": "1 day",      "description": {        "en": "Commemorating the start of the 2011 Egyptian Revolution that led to the ousting of former President Hosni Mubarak, this day marks a significant moment in modern Egyptian history. The revolution began with protests in Cairo's Tahrir Square and other major cities, demanding political reforms, greater freedoms, and economic improvements. While celebrations have become more subdued in recent years, the day remains an official holiday.",        "ar": "يحيي ذكرى بداية الثورة المصرية عام 2011 التي أدت إلى الإطاحة بالرئيس السابق حسني مبارك، ويمثل هذا اليوم لحظة مهمة في تاريخ مصر الحديث. بدأت الثورة باحتجاجات في ميدان التحرير بالقاهرة ومدن رئيسية أخرى، مطالبة بإصلاحات سياسية وحريات أكبر وتحسينات اقتصادية. بينما أصبحت الاحتفالات أكثر هدوءًا في السنوات الأخيرة، لا يزال اليوم عطلة رسمية."      },      "tourist_impact": {        "en": "Government offices are closed, but tourist sites usually remain open. There may be increased security presence in major squares and public areas, particularly in Cairo. While the day generally passes peacefully, visitors should stay informed about any planned demonstrations and avoid large gatherings as a precaution.",        "ar": "تغلق المكاتب الحكومية، ولكن المواقع السياحية عادة ما تبقى مفتوحة. قد يكون هناك تواجد أمني متزايد في الميادين الرئيسية والمناطق العامة، خاصة في القاهرة. بينما يمر اليوم بسلام عمومًا، يجب على الزوار البقاء على اطلاع بأي مظاهرات مخطط لها وتجنب التجمعات الكبيرة كإجراء احترازي."      }    }  ],  "religious_festivals": [    {      "id": "mawlid_al_nabi",      "name": {        "en": "Mawlid al-Nabi (Prophet Muhammad's Birthday)",        "ar": "المولد النبوي الشريف"      },      "type": "religious_islamic",      "timing": "Variable (12th day of Rabi' al-Awwal in the Islamic calendar)",      "duration": "1 day (with celebrations extending for weeks)",      "description": {        "en": "Mawlid al-Nabi celebrates the birth of Prophet Muhammad. In Egypt, it is marked by special prayers, religious songs, and recitations of the Quran. Streets and mosques are decorated with colorful lights, and vendors sell special sweets including 'halawet el-moulid' (sugar dolls and horses for children) and various nuts and sweets. Sufi orders hold dhikr ceremonies (rhythmic chanting of God's names) and processions.",        "ar": "المولد النبوي يحتفل بمولد النبي محمد. في مصر، يتم إحياؤه بصلوات خاصة وأناشيد دينية وتلاوات للقرآن. تزين الشوارع والمساجد بأضواء ملونة، ويبيع الباعة الحلويات الخاصة بما في ذلك 'حلاوة المولد' (عرائس وحصانات من السكر للأطفال) والمكسرات والحلويات المختلفة. تقيم الطرق الصوفية حلقات ذكر (إنشاد إيقاعي لأسماء الله) ومواكب."      },      "tourist_impact": {        "en": "The Mawlid is an excellent time to experience Egyptian Islamic traditions. Popular areas to witness celebrations include Al-Hussein Mosque in Cairo and El-Sayeda Zeinab district. Streets around major mosques may be crowded but festive. Most tourist sites remain open, though government offices and some businesses close for the day.",        "ar": "المولد النبوي هو وقت ممتاز لتجربة التقاليد الإسلامية المصرية. تشمل المناطق الشعبية لمشاهدة الاحتفالات مسجد الحسين في القاهرة وحي السيدة زينب. قد تكون الشوارع حول المساجد الرئيسية مزدحمة ولكنها احتفالية. تبقى معظم المواقع السياحية مفتوحة، رغم أن المكاتب الحكومية وبعض الشركات تغلق ليوم واحد."      }    },    {      "id": "ramadan",      "name": {        "en": "Ramadan",        "ar": "رمضان"      },      "type": "religious_islamic",      "timing": "Variable (9th month of the Islamic lunar calendar)",      "duration": "30 days",      "description": {        "en": "Ramadan is the holy month when Muslims fast from dawn to sunset. In Egypt, it transforms daily life with a unique atmosphere. Days are quieter as people conserve energy during fasting, but nights come alive with festivities. Streets and buildings are decorated with colorful lanterns (fanous) and lights. After breaking fast at sunset (iftar), families gather for meals, visit relatives, or enjoy special Ramadan desserts at cafes. Many mosques offer special night prayers (Taraweeh), and charity is emphasized throughout the month.",        "ar": "رمضان هو الشهر المقدس الذي يصوم فيه المسلمون من الفجر حتى غروب الشمس. في مصر، يغير حياة الناس اليومية بأجواء فريدة. تكون الأيام أكثر هدوءًا حيث يحافظ الناس على طاقتهم أثناء الصيام، لكن الليالي تنبض بالاحتفالات. تزين الشوارع والمباني بالفوانيس الملونة والأضواء. بعد الإفطار عند غروب الشمس، تجتمع العائلات لتناول الوجبات، وزيارة الأقارب، أو الاستمتاع بحلويات رمضان الخاصة في المقاهي. تقدم العديد من المساجد صلاة التراويح، ويتم التأكيد على الصدقة طوال الشهر."      },      "tourist_impact": {        "en": "Traveling during Ramadan offers a unique cultural experience, but requires some adjustments. Business hours are often reduced, and some restaurants may close during daylight hours or serve only tourists. Tourist sites remain open but may have adjusted hours. Evening hours are lively with special atmosphere, food, and events. Visitors should dress modestly and be respectful of those fasting by avoiding eating, drinking, or smoking in public during daylight hours.",        "ar": "توفر السفر خلال رمضان تجربة ثقافية فريدة، ولكنها تتطلب بعض التعديلات. غالبًا ما تقل ساعات العمل، وقد تغلق بعض المطاعم خلال ساعات النهار أو تخدم السياح فقط. تبقى المواقع السياحية مفتوحة ولكن قد تكون لديها ساعات معدلة. ساعات المساء نابضة بالحياة مع أجواء وطعام وأحداث خاصة. يجب على الزوار ارتداء ملابس محتشمة واحترام الصائمين بتجنب الأكل أو الشرب أو التدخين في الأماكن العامة خلال ساعات النهار."      }    },    {      "id": "coptic_easter",      "name": {        "en": "Coptic Easter",        "ar": "عيد القيامة القبطي"      },      "type": "religious_christian",      "timing": "Variable (usually in April, following the Julian calendar)",      "duration": "1 week of celebrations",      "description": {        "en": "Coptic Easter is preceded by a 55-day Great Fast, with the final Holy Week (Passion Week) being especially significant. On Palm Sunday, churches are decorated with palm fronds and olive branches. Good Friday services commemorate the crucifixion with solemn prayers and hymns. The Easter Vigil begins Saturday night and continues until early Sunday morning, culminating in the joyous Easter service. Families then gather for festive meals featuring traditional foods like colored eggs, salted fish, and special cookies (kahk).",        "ar": "يسبق عيد الفصح القبطي صوم كبير مدته 55 يومًا، حيث تعتبر أسبوع الآلام الأخير ذات أهمية خاصة. في أحد الشعانين، تزين الكنائس بسعف النخيل وأغصان الزيتون. تحيي خدمات الجمعة العظيمة ذكرى الصلب بصلوات وترانيم رصينة. تبدأ سهرة عيد الفصح مساء السبت وتستمر حتى صباح الأحد الباكر، وتتوج بخدمة عيد الفصح المبهجة. ثم تجتمع العائلات لتناول وجبات احتفالية تضم أطعمة تقليدية مثل البيض الملون والسمك المملح وكعك العيد."      },      "tourist_impact": {        "en": "Coptic Easter offers a fascinating opportunity to witness ancient Christian traditions. Historic churches in Old Cairo, Alexandria, and Upper Egypt hold elaborate services, though visitors should dress respectfully and check if attendance by non-parishioners is welcomed. Easter Monday (the day after Easter) is a national holiday when Egyptians of all faiths celebrate outdoors, similar to Sham El-Nessim which often falls on the same day.",        "ar": "يوفر عيد الفصح القبطي فرصة رائعة لمشاهدة التقاليد المسيحية القديمة. تقيم الكنائس التاريخية في القاهرة القديمة والإسكندرية وصعيد مصر خدمات متقنة، على الرغم من أنه يجب على الزوار ارتداء ملابس محترمة والتحقق مما إذا كان حضور غير أبناء الرعية مرحبًا به. شم النسيم (اليوم التالي لعيد الفصح) هو عطلة وطنية عندما يحتفل المصريون من جميع الأديان في الهواء الطلق، مشابه لشم النسيم الذي غالبًا ما يصادف نفس اليوم."      }    }  ],  "cultural_festivals": [    {      "id": "cairo_international_film_festival",      "name": {        "en": "Cairo International Film Festival",        "ar": "مهرجان القاهرة السينمائي الدولي"      },      "timing": "November/December",      "location": "Cairo",      "description": {        "en": "One of the oldest and most prestigious film festivals in the Middle East and Africa, established in 1976. The festival showcases films from around the world, with a focus on Arab and Egyptian cinema. Events include screenings, panel discussions, workshops, and awards ceremonies, attracting filmmakers, actors, and cinema enthusiasts from around the world.",        "ar": "أحد أقدم وأعرق المهرجانات السينمائية في الشرق الأوسط وأفريقيا، تأسس عام 1976. يعرض المهرجان أفلامًا من جميع أنحاء العالم، مع التركيز على السينما العربية والمصرية. تشمل الفعاليات عروضًا وندوات وورش عمل وحفلات توزيع جوائز، وتجذب صانعي الأفلام والممثلين وعشاق السينما من جميع أنحاء العالم."      }    },    {      "id": "abu_simbel_sun_festival",      "name": {        "en": "Abu Simbel Sun Festival",        "ar": "مهرجان شمس أبو سمبل"      },      "timing": "February 22 and October 22",      "location": "Abu Simbel, Aswan",      "description": {        "en": "Twice a year, on February 22 and October 22, the sun aligns perfectly to illuminate the inner sanctuary of the Abu Simbel temple, lighting up three of the four statues inside (Ramses II, Ra, and Amun, leaving Ptah, the god of darkness, in shadow). This astronomical phenomenon was designed over 3,200 years ago and continues to draw crowds of tourists and locals who celebrate with traditional Nubian music, dancing, and food markets.",        "ar": "مرتين في السنة، في 22 فبراير و22 أكتوبر، تتماشى الشمس بشكل مثالي لتضيء الحرم الداخلي لمعبد أبو سمبل، وتضيء ثلاثة من التماثيل الأربعة بالداخل (رمسيس الثاني، رع، وآمون، تاركة بتاح، إله الظلام، في الظل). تم تصميم هذه الظاهرة الفلكية منذ أكثر من 3200 عام وما زالت تجذب حشودًا من السياح والسكان المحليين الذين يحتفلون بالموسيقى النوبية التقليدية والرقص وأسواق الطعام."      }    },    {      "id": "international_book_fair",      "name": {        "en": "Cairo International Book Fair",        "ar": "معرض القاهرة الدولي للكتاب"      },      "timing": "January/February",      "location": "Cairo",      "description": {        "en": "One of the largest and oldest book fairs in the Arab world, attracting publishers and readers from across the globe. Beyond book sales, the fair features cultural events, author signings, intellectual discussions, and activities for children. With millions of visitors annually, it's a major cultural event reflecting Egypt's literary heritage and contemporary intellectual life.",        "ar": "أحد أكبر وأقدم معارض الكتب في العالم العربي، يجذب الناشرين والقراء من جميع أنحاء العالم. بالإضافة إلى بيع الكتب، يضم المعرض فعاليات ثقافية، وتوقيعات المؤلفين، ومناقشات فكرية، وأنشطة للأطفال. مع ملايين الزوار سنويًا، فهو حدث ثقافي رئيسي يعكس التراث الأدبي المصري والحياة الفكرية المعاصرة."      }    },    {      "id": "wafaa_al_nil",      "name": {        "en": "Wafaa Al-Nil (Flooding of the Nile)",        "ar": "وفاء النيل"      },      "timing": "August (traditionally coinciding with the annual Nile flood)",      "location": "Nile-adjacent cities, especially Cairo and Luxor",      "description": {        "en": "Dating back to ancient Egyptian times, this festival celebrates the annual flooding of the Nile, which was vital for agriculture. Although the Aswan High Dam now regulates the river's flow, the cultural celebration continues. Events include boat parades, folklore performances, music concerts, and symbolic offerings to the river. The festival blends ancient traditions with modern entertainment, highlighting the Nile's enduring importance to Egyptian identity.",        "ar": "يعود تاريخه إلى العصور المصرية القديمة، ويحتفل هذا المهرجان بالفيضان السنوي للنيل، الذي كان حيويًا للزراعة. على الرغم من أن السد العالي في أسوان ينظم الآن تدفق النهر، إلا أن الاحتفال الثقافي مستمر. تشمل الفعاليات مواكب القوارب، وعروض الفولكلور، والحفلات الموسيقية، والعروض الرمزية للنهر. يمزج المهرجان بين التقاليد القديمة والترفيه الحديث، مبرزًا الأهمية الدائمة للنيل للهوية المصرية."      }    }  ],  "visitor_tips": {    "en": "When planning a trip to Egypt, consider timing your visit to coincide with one of these festivals for a richer cultural experience. However, be aware that during major holidays like Eid al-Fitr and Eid al-Adha, many businesses may close and transportation can be crowded. During Ramadan, adjust your expectations for daytime activities and be respectful of those fasting. For religious celebrations, dress modestly and ask permission before photographing ceremonies. National holidays may result in government office closures, but tourist sites typically remain open, sometimes with adjusted hours.",    "ar": "عند التخطيط لرحلة إلى مصر، فكر في توقيت زيارتك لتتزامن مع أحد هذه المهرجانات للحصول على تجربة ثقافية أكثر ثراءً. ومع ذلك، كن على علم بأنه خلال الأعياد الرئيسية مثل عيد الفطر وعيد الأضحى، قد تغلق العديد من الشركات وقد تكون وسائل النقل مزدحمة. خلال شهر رمضان، اضبط توقعاتك للأنشطة النهارية واحترم الصائمين. للاحتفالات الدينية، ارتدِ ملابس محتشمة واطلب الإذن قبل تصوير المراسم. قد تؤدي العطلات الوطنية إلى إغلاق المكاتب الحكومية، ولكن المواقع السياحية تبقى مفتوحة عادةً، أحيانًا مع تعديل الساعات."  },  "images": [    "eid_al_fitr_celebrations.jpg",    "ramadan_lanterns.jpg",    "coptic_christmas_mass.jpg",    "sham_el_nessim_picnic.jpg",    "mawlid_celebration.jpg",    "abu_simbel_sun_festival.jpg"  ]}