{  "id": "mediterranean_coast_region",  "name": {    "en": "Mediterranean Coast (North Coast)",    "ar": "الساحل الشمالي (ساحل البحر المتوسط)"  },  "description": {    "en": "Egypt's northern coastline along the Mediterranean Sea, famous for its white sandy beaches, clear turquoise waters, and numerous summer resorts. Often referred to as the North Coast (Sahel).",    "ar": "ساحل مصر الشمالي على طول البحر الأبيض المتوسط، يشتهر بشواطئه الرملية البيضاء ومياهه الفيروزية الصافية ومنتجعاته الصيفية العديدة. يشار إليه غالبًا باسم الساحل الشمالي (الساحل)."  },  "geography": {    "en": "Extends from Alexandria westwards towards the Libyan border. Characterized by flat coastal plains, lagoons, and distinctive white sand beaches.",    "ar": "يمتد من الإسكندرية غربًا باتجاه الحدود الليبية. يتميز بسهول ساحلية منبسطة وبحيرات شاطئية وشواطئ رملية بيضاء مميزة."  },  "climate": {    "en": "Mediterranean climate with hot, dry summers and mild, wetter winters compared to the rest of Egypt. Sea breezes moderate summer temperatures.",    "ar": "مناخ البحر الأبيض المتوسط مع صيف حار وجاف وشتاء معتدل وأكثر رطوبة مقارنة ببقية مصر. نسيم البحر يخفف من درجات حرارة الصيف."  },  "major_cities_areas": [    {      "id": "marsa_matruh",      "name": {        "en": "Marsa Matruh",        "ar": "مرسى مطروح"      },      "description": {        "en": "A major port and popular summer resort town known for its beautiful beaches like Cleopatra's Beach and Ageeba Beach.",        "ar": "ميناء رئيسي ومدينة منتجع صيفي شهيرة تشتهر بشواطئها الجميلة مثل شاطئ كليوباترا وشاطئ عجيبة."      }    },    {      "id": "el_alamein",      "name": {        "en": "El Alamein",        "ar": "العلمين"      },      "description": {        "en": "Historic town known for the pivotal World War II battle, featuring war memorials, cemeteries, and a museum. Also a growing resort area.",        "ar": "بلدة تاريخية معروفة بمعركة الحرب العالمية الثانية المحورية، وتضم نصبًا تذكارية للحرب ومقابر ومتحفًا. وهي أيضًا منطقة منتجعات متنامية."      }    }      ],  "key_attractions_activities": [    {      "id": "beach_relaxation_med",      "name": {        "en": "Beach Relaxation",        "ar": "الاسترخاء على الشاطئ"      },      "description": {        "en": "Enjoying the famous white sand beaches and clear waters, particularly during the summer months.",        "ar": "الاستمتاع بالشواطئ الرملية البيضاء الشهيرة والمياه الصافية، خاصة خلال أشهر الصيف."      }    },    {      "id": "swimming_watersports_med",      "name": {        "en": "Swimming and Water Sports",        "ar": "السباحة والرياضات المائية"      },      "description": {        "en": "Calm waters suitable for swimming, jet skiing, and other water activities.",        "ar": "مياه هادئة مناسبة للسباحة والتزلج على الماء وغيرها من الأنشطة المائية."      }    },    {      "id": "wwii_sites_alamein",      "name": {        "en": "World War II History (El Alamein)",        "ar": "تاريخ الحرب العالمية الثانية (العلمين)"      },      "description": {        "en": "Visiting the war museum, cemeteries (Commonwealth, German, Italian), and memorials.",        "ar": "زيارة متحف الحرب والمقابر (الكومنولث والألمانية والإيطالية) والنصب التذكارية."      }    }  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ" }