{  "id": "red_sea_coast_region",  "name": {    "en": "Red Sea Coast",    "ar": "ساحل البحر الأحمر"  },  "description": {    "en": "Egypt's eastern coastline along the Red Sea, renowned for its vibrant coral reefs, clear waters, beach resorts, and desert landscapes meeting the sea.",    "ar": "الساحل الشرقي لمصر على طول البحر الأحمر، يشتهر بالشعاب المرجانية النابضة بالحياة والمياه الصافية ومنتجعات الشاطئ والمناظر الطبيعية الصحراوية التي تلتقي بالبحر."  },  "geography": {    "en": "A long coastal strip bordered by the Red Sea to the east and the Eastern Desert mountains to the west. Includes major resort towns and smaller settlements.",    "ar": "شريط ساحلي طويل يحده البحر الأحمر من الشرق وجبال الصحراء الشرقية من الغرب. يشمل مدن المنتجعات الرئيسية والمستوطنات الأصغر."  },  "climate": {    "en": "Hot desert climate with year-round sunshine, very hot summers, and warm winters. Low humidity and minimal rainfall. Ideal for beach holidays and water sports.",    "ar": "مناخ صحراوي حار مع أشعة الشمس على مدار السنة، وصيف حار جدًا، وشتاء دافئ. رطوبة منخفضة وأمطار قليلة. مثالي لقضاء العطلات على الشاطئ والرياضات المائية."  },  "major_cities_areas": [    {      "id": "hurghada",      "name": {        "en": "Hurghada",        "ar": "الغردقة"      },      "description": {        "en": "A major tourist center known for its extensive resorts, diving opportunities, nightlife, and access to nearby islands.",        "ar": "مركز سياحي رئيسي معروف بمنتجعاته الواسعة وفرص الغوص والحياة الليلية والوصول إلى الجزر المجاورة."      }    }      ],  "key_attractions_activities": [    {      "id": "diving_snorkeling",      "name": {        "en": "Diving and Snorkeling",        "ar": "الغوص والغطس"      },      "description": {        "en": "Explore world-class coral reefs teeming with marine life.",        "ar": "استكشف الشعاب المرجانية ذات المستوى العالمي التي تعج بالحياة البحرية."      }    },    {      "id": "beach_relaxation",      "name": {        "en": "Beach Relaxation",        "ar": "الاسترخاء على الشاطئ"      },      "description": {        "en": "Enjoy sandy beaches and clear turquoise waters.",        "ar": "استمتع بالشواطئ الرملية والمياه الفيروزية الصافية."      }    },    {      "id": "water_sports",      "name": {        "en": "Water Sports",        "ar": "الرياضات المائية"      },      "description": {        "en": "Windsurfing, kitesurfing, sailing, and more.",        "ar": "ركوب الأمواج شراعيًا وركوب الأمواج بالطائرة الورقية والإبحار والمزيد."      }    },    {      "id": "desert_safaris",      "name": {        "en": "Desert Safaris",        "ar": "رحلات السفاري الصحراوية"      },      "description": {        "en": "Explore the nearby Eastern Desert by jeep or quad bike.",        "ar": "استكشف الصحراء الشرقية القريبة بسيارة جيب أو دراجة رباعية."      }    }  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ" }