{  "id": "sinai_peninsula_region",  "name": {    "en": "Sinai Peninsula",    "ar": "شبه جزيرة سيناء"  },  "description": {    "en": "A sparsely populated triangular peninsula connecting Africa and Asia, known for its rugged mountains (including Mount Sinai), Red Sea coastlines famous for diving, and significant religious history.",    "ar": "شبه جزيرة مثلثة قليلة السكان تربط بين إفريقيا وآسيا، تشتهر بجبالها الوعرة (بما في ذلك جبل موسى)، وسواحل البحر الأحمر المشهورة بالغوص، وتاريخها الديني الهام."  },  "geography": {    "en": "Characterized by the high mountain ranges of South Sinai, including Egypt's highest peak (Mount Catherine), and coastal plains along the Gulf of Aqaba and Gulf of Suez.",    "ar": "تتميز بسلاسل الجبال العالية في جنوب سيناء، بما في ذلك أعلى قمة في مصر (جبل كاترين)، والسهول الساحلية على طول خليج العقبة وخليج السويس."  },  "climate": {    "en": "Varied climate. Coastal areas (like Sharm El Sheikh) have hot summers and warm winters similar to the Red Sea Coast. Mountainous interior is cooler, with potential for snow in winter at high altitudes.",    "ar": "مناخ متنوع. المناطق الساحلية (مثل شرم الشيخ) تتميز بصيف حار وشتاء دافئ مشابه لساحل البحر الأحمر. المناطق الجبلية الداخلية أكثر برودة، مع احتمال تساقط الثلوج في الشتاء على المرتفعات العالية."  },  "major_cities_areas": [    {      "id": "sharm_el_sheikh",      "name": {        "en": "Sharm El Sheikh",        "ar": "شرم الشيخ"      },      "description": {        "en": "A major global tourism hub known for luxury resorts, vibrant nightlife, and world-class diving and snorkeling, particularly in Ras Muhammad National Park.",        "ar": "مركز سياحي عالمي رئيسي معروف بالمنتجعات الفاخرة والحياة الليلية النابضة بالحياة والغوص والغطس على مستوى عالمي، لا سيما في محمية رأس محمد الوطنية."      }    },    {      "id": "saint_catherine",      "name": {        "en": "Saint Catherine",        "ar": "سانت كاترين"      },      "description": {        "en": "Town located at the foot of Mount Sinai, primarily serving visitors to Saint Catherine's Monastery and those climbing the mountain.",        "ar": "بلدة تقع عند سفح جبل موسى، تخدم بشكل أساسي زوار دير سانت كاترين وأولئك الذين يتسلقون الجبل."      }    }      ],  "key_attractions_activities": [    {      "id": "mount_sinai_jebel_musa",      "name": {        "en": "Mount Sinai (Jebel Musa)",        "ar": "جبل موسى"      },      "description": {        "en": "Site revered in Abrahamic religions as the place where Moses received the Ten Commandments. Popular for sunrise/sunset hikes.",        "ar": "موقع مقدس في الديانات الإبراهيمية كمكان تلقي موسى الوصايا العشر. مشهور برحلات المشي لمسافات طويلة عند شروق الشمس وغروبها."      }    },    {      "id": "saint_catherine_monastery",      "name": {        "en": "Saint Catherine's Monastery",        "ar": "دير سانت كاترين"      },      "description": {        "en": "One of the oldest working Christian monasteries in the world, a UNESCO World Heritage site, located at the foot of Mount Sinai.",        "ar": "أحد أقدم الأديرة المسيحية العاملة في العالم، وهو موقع تراث عالمي لليونسكو، يقع عند سفح جبل موسى."      }    },    {      "id": "red_sea_diving_sinai",      "name": {        "en": "Red Sea Diving/Snorkeling (Sinai Coast)",        "ar": "الغوص/الغطس في البحر الأحمر (ساحل سيناء)"      },      "description": {        "en": "Access to renowned dive sites like Ras Muhammad National Park, the Blue Hole (Dahab), and Thistlegorm wreck.",        "ar": "الوصول إلى مواقع الغوص الشهيرة مثل محمية رأس محمد الوطنية، والثقب الأزرق (دهب)، وحطام ثيستلجورم."      }    },    {      "id": "beach_resorts_sinai",      "name": {        "en": "Beach Resorts",        "ar": "منتجعات شاطئية"      },      "description": {        "en": "Relaxation and activities at numerous resorts along the coast, especially in Sharm El Sheikh.",        "ar": "الاسترخاء والأنشطة في العديد من المنتجعات على طول الساحل، وخاصة في شرم الشيخ."      }    }  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ" }