{  "id": "siwa_oasis_region",  "name": {    "en": "Siwa Oasis",    "ar": "واحة سيوة"  },  "description": {    "en": "An isolated oasis in the Western Desert, near the Libyan border, known for its unique Amazigh (Berber) culture, palm groves, salt lakes, and ancient history, including the famed Oracle of Amun.",    "ar": "واحة معزولة في الصحراء الغربية، بالقرب من الحدود الليبية، تشتهر بثقافتها الأمازيغية (البربرية) الفريدة، وبساتين النخيل، والبحيرات المالحة، والتاريخ القديم، بما في ذلك معبد الوحي الشهير لآمون."  },  "geography": {    "en": "Located in a depression in the Western Desert, characterized by numerous springs, vast palm and olive groves, and large salt lakes.",    "ar": "تقع في منخفض في الصحراء الغربية، وتتميز بالعديد من الينابيع، وبساتين النخيل والزيتون الشاسعة، والبحيرات المالحة الكبيرة."  },  "climate": {    "en": "Hot desert climate. Very hot, dry summers and mild winters with cool nights. Rainfall is extremely rare.",    "ar": "مناخ صحراوي حار. صيف حار جدًا وجاف وشتاء معتدل مع ليالي باردة. هطول الأمطار نادر للغاية."  },  "major_cities_areas": [    {      "id": "siwa_town",      "name": {        "en": "Siwa Town (Shali)",        "ar": "مدينة سيوة (شالي)"      },      "description": {        "en": "The main settlement in the oasis, centered around the ancient Shali fortress ruins.",        "ar": "المستوطنة الرئيسية في الواحة، وتتركز حول أطلال قلعة شالي القديمة."      }    }  ],  "key_attractions_activities": [    {      "id": "oracle_temple_aghurni",      "name": {        "en": "Temple of the Oracle (Aghurmi)",        "ar": "معبد الوحي (أغورمي)"      },      "description": {        "en": "Ruins of the famous ancient oracle visited by Alexander the Great.",        "ar": "أطلال معبد الوحي القديم الشهير الذي زاره الإسكندر الأكبر."      }    },    {      "id": "shali_fortress",      "name": {        "en": "Shali Fortress",        "ar": "قلعة شالي"      },      "description": {        "en": "Ruined 13th-century mud-brick fortress in the center of Siwa Town.",        "ar": "قلعة مدمرة من الطوب اللبن تعود للقرن الثالث عشر في وسط مدينة سيوة."      }    },    {      "id": "cleopatra_bath",      "name": {        "en": "Cleopatra's Bath",        "ar": "حمام كليوباترا"      },      "description": {        "en": "A natural stone pool fed by a spring, popular for swimming.",        "ar": "بركة حجرية طبيعية تغذيها عين ماء، تشتهر بالسباحة."      }    },    {      "id": "salt_lakes",      "name": {        "en": "Salt Lakes",        "ar": "البحيرات المالحة"      },      "description": {        "en": "Highly saline lakes where visitors can float effortlessly.",        "ar": "بحيرات شديدة الملوحة حيث يمكن للزوار الطفو دون عناء."      }    },    {      "id": "gebel_el_mawta",      "name": {        "en": "Gebel el-Mawta (Mountain of the Dead)",        "ar": "جبل الموتى"      },      "description": {        "en": "A hill containing numerous rock-cut tombs from various periods.",        "ar": "تل يحتوي على العديد من المقابر المنحوتة في الصخر من فترات مختلفة."      }    }  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ" }