{
  "id": "cairo_metro",
  "name": {
    "en": "Cairo Metro",
    "ar": "مترو القاهرة"
  },
  "type": "public_transport",
  "description": {
    "en": "The Cairo Metro is the first underground metro system in Africa and the Arab world. It serves as the backbone of public transportation in Greater Cairo, connecting various districts and suburbs of the sprawling metropolis. The system currently operates three lines with over 70 stations, serving approximately 4 million passengers daily. The metro is an efficient, affordable, and relatively quick way to navigate Cairo's notorious traffic congestion.",
    "ar": "مترو القاهرة هو أول نظام مترو تحت الأرض في أفريقيا والعالم العربي. يعمل كعمود فقري للنقل العام في القاهرة الكبرى، ويربط مختلف أحياء وضواحي العاصمة المترامية الأطراف. يعمل النظام حاليًا ثلاثة خطوط مع أكثر من 70 محطة، ويخدم حوالي 4 ملايين راكب يوميًا. المترو هو وسيلة فعالة وبأسعار معقولة وسريعة نسبيًا للتنقل عبر ازدحام المرور الشهير في القاهرة."
  },
  "practical_info": {
    "operating_hours": "5:00 AM - 1:00 AM daily",
    "fares": {
      "standard_ticket": "5-10 EGP (depending on number of stations)",
      "elderly_student_discount": "Available with proper ID"
    },
    "lines": [
      {
        "name": "Line 1 (Blue Line)",
        "route": "Helwan to New El-Marg",
        "key_stations": [
          "Sadat (Tahrir Square)",
          "Giza",
          "Helwan",
          "New El-Marg"
        ]
      },
      {
        "name": "Line 2 (Red Line)",
        "route": "Shobra El-Kheima to El-Mounib",
        "key_stations": [
          "Sadat (Tahrir Square)",
          "Ramses",
          "Cairo University",
          "El-Mounib"
        ]
      },
      {
        "name": "Line 3 (Green Line)",
        "route": "Adly Mansour to Kit Kat (partially completed)",
        "key_stations": [
          "Adly Mansour",
          "Cairo Stadium",
          "Abbassia",
          "Attaba",
          "Kit Kat"
        ]
      }
    ],
    "future_expansion": {
      "en": "The Cairo Metro continues to expand with Line 3 extensions under construction and plans for additional lines (Line 4, 5, and 6) to further connect Cairo's neighborhoods and suburbs.",
      "ar": "يستمر مترو القاهرة في التوسع مع امتدادات الخط 3 قيد الإنشاء وخطط لخطوط إضافية (الخط 4 و5 و6) لربط أحياء وضواحي القاهرة بشكل أكبر."
    }
  },
  "traveler_tips": {
    "en": "Purchase tickets at station booths (cash only). The first two cars of each train are reserved for women (though women can ride in any car). Metro can get extremely crowded during rush hours (8-10 AM and 3-5 PM). Keep your ticket until exiting as it's required to leave the station. Be mindful of your belongings in crowded cars. Download the Cairo Metro app for maps and schedules. The metro is the fastest way to cross the city during traffic hours. Some stations connect to important tourist attractions like the Egyptian Museum (Sadat Station) and Cairo University (Cairo University Station).",
    "ar": "شراء التذاكر من أكشاك المحطة (نقدًا فقط). العربتان الأوليان من كل قطار مخصصتان للنساء (على الرغم من أن النساء يمكنهن الركوب في أي عربة). يمكن أن يصبح المترو مزدحمًا للغاية خلال ساعات الذروة (8-10 صباحًا و3-5 مساءً). احتفظ بتذكرتك حتى الخروج لأنها مطلوبة لمغادرة المحطة. انتبه لمتعلقاتك في العربات المزدحمة. قم بتنزيل تطبيق مترو القاهرة للخرائط والجداول الزمنية. المترو هو أسرع وسيلة لعبور المدينة خلال ساعات الازدحام. تتصل بعض المحطات بمعالم سياحية مهمة مثل المتحف المصري (محطة السادات) وجامعة القاهرة (محطة جامعة القاهرة)."
  },
  "images": [
    "cairo_metro_train.jpg",
    "cairo_metro_station.jpg",
    "cairo_metro_map.jpg",
    "cairo_metro_ticket.jpg"
  ],
  "tags": [
    "public transport",
    "metro",
    "Cairo",
    "subway",
    "urban travel",
    "budget travel"
  ],
  "last_updated": "2025-04-19T16:25:27.325075"
}