{  "customs_and_etiquette": {    "general_behavior": {      "greetings": {        "en": "Greetings are important in Egyptian culture. 'As-salaam-alaikum' (Peace be upon you) is a common greeting, with 'Wa-alaikum-salaam' as the response. Handshakes are common between people of the same gender. Wait for the opposite gender to initiate a handshake.",        "ar": "التحيات مهمة في الثقافة المصرية. 'السلام عليكم' هي تحية شائعة، مع 'وعليكم السلام' كرد. المصافحة شائعة بين الأشخاص من نفس الجنس. انتظر حتى يبادر الجنس الآخر بالمصافحة."      },      "personal_space": {        "en": "Egyptians may stand closer during conversations than Westerners are accustomed to. This is normal and not meant to make you uncomfortable. Personal space expectations are different, especially in crowded cities.",        "ar": "قد يقف المصريون أقرب أثناء المحادثات مما اعتاد عليه الغربيون. هذا أمر طبيعي وليس المقصود به إزعاجك. توقعات المساحة الشخصية مختلفة، خاصة في المدن المزدحمة."      },      "hospitality": {        "en": "Hospitality is a cornerstone of Egyptian culture. It's common to be offered tea or coffee when visiting homes or shops. Declining can be seen as impolite. If offered food, it's polite to accept at least a small amount.",        "ar": "الضيافة هي حجر الزاوية في الثقافة المصرية. من الشائع أن يُقدم لك الشاي أو القهوة عند زيارة المنازل أو المحلات. قد يُنظر إلى الرفض على أنه غير مهذب. إذا قُدم لك الطعام، من المهذب قبول كمية صغيرة على الأقل."      }    },    "dress_code": {      "general": {        "en": "Dress modestly, especially when visiting religious sites or conservative areas. Shoulders and knees should be covered. Loose-fitting clothes are both respectful and practical in the hot climate.",        "ar": "ارتدِ ملابس محتشمة، خاصة عند زيارة المواقع الدينية أو المناطق المحافظة. يجب تغطية الكتفين والركبتين. الملابس الفضفاضة محترمة وعملية في المناخ الحار."      },      "religious_sites": {        "en": "When visiting mosques, remove shoes before entering. Women should cover their hair. Many mosques provide robes and scarves for visitors. For churches, modest dress is required but head covering is usually not necessary.",        "ar": "عند زيارة المساجد، اخلع حذاءك قبل الدخول. يجب على النساء تغطية شعرهن. توفر العديد من المساجد العباءات والأوشحة للزوار. بالنسبة للكنائس، يُطلب ارتداء ملابس محتشمة ولكن تغطية الرأس ليست ضرورية عادةً."      },      "beach_areas": {        "en": "Tourist beach resorts are more relaxed about dress codes. However, when leaving the beach area, cover up appropriately. Public beaches require more modest swimwear.",        "ar": "المنتجعات الشاطئية السياحية أكثر مرونة في قواعد اللباس. ومع ذلك، عند مغادرة منطقة الشاطئ، قم بالتغطية بشكل مناسب. تتطلب الشواطئ العامة ملابس سباحة أكثر احتشامًا."      }    },    "dining_etiquette": {      "general": {        "en": "Eating with the right hand is traditional and preferred. If invited to a home, bringing a small gift (sweets, fruit) is appreciated. It's polite to compliment the food and try everything offered.",        "ar": "الأكل باليد اليمنى تقليدي ومفضل. إذا تمت دعوتك إلى منزل، يُقدر إحضار هدية صغيرة (حلويات، فاكهة). من المهذب الإشادة بالطعام وتجربة كل ما يُقدم."      },      "ramadan": {        "en": "During Ramadan, avoid eating, drinking, or smoking in public during daylight hours out of respect for those fasting. Many restaurants are closed during the day but offer special evening meals.",        "ar": "خلال رمضان، تجنب الأكل أو الشرب أو التدخين في الأماكن العامة خلال ساعات النهار احترامًا للصائمين. العديد من المطاعم مغلقة خلال النهار ولكنها تقدم وجبات مسائية خاصة."      }    },    "business_etiquette": {      "meetings": {        "en": "Meetings often start with small talk and tea/coffee. Relationships are important in Egyptian business culture. Punctuality expectations are more relaxed than in Western countries.",        "ar": "غالبًا ما تبدأ الاجتماعات بمحادثات صغيرة وشاي/قهوة. العلاقات مهمة في ثقافة الأعمال المصرية. توقعات الالتزام بالمواعيد أكثر مرونة من الدول الغربية."      },      "business_cards": {        "en": "Present business cards with your right hand. Having cards printed in both English and Arabic is appreciated. Take time to read cards given to you before putting them away.",        "ar": "قدم بطاقات العمل بيدك اليمنى. يُقدر طباعة البطاقات باللغتين الإنجليزية والعربية. خذ وقتًا لقراءة البطاقات المقدمة لك قبل وضعها جانبًا."      }    },    "photography": {      "general": {        "en": "Always ask permission before photographing people, especially women and children. Some religious sites and museums prohibit photography or require permits. Military and government buildings should not be photographed.",        "ar": "اطلب دائمًا الإذن قبل تصوير الناس، خاصة النساء والأطفال. تحظر بعض المواقع الدينية والمتاحف التصوير أو تتطلب تصاريح. يجب عدم تصوير المباني العسكرية والحكومية."      }    },    "religious_respect": {      "general": {        "en": "Egypt is predominantly Muslim with a significant Coptic Christian minority. Respect for both religions is important. During prayer times, be mindful of noise levels near mosques. During religious holidays, be aware of special customs and potential business closures.",        "ar": "مصر ذات أغلبية مسلمة مع أقلية قبطية مسيحية كبيرة. احترام كلا الديانتين مهم. خلال أوقات الصلاة، انتبه لمستويات الضوضاء بالقرب من المساجد. خلال الأعياد الدينية، كن على دراية بالعادات الخاصة واحتمال إغلاق الأعمال."      }    },    "bargaining": {      "markets": {        "en": "Bargaining is expected in markets (souks) and with taxis. Start at about 50-70% of the initial asking price. Keep negotiations friendly and good-humored. Walking away may result in a better offer.",        "ar": "المساومة متوقعة في الأسواق ومع سيارات الأجرة. ابدأ بحوالي 50-70٪ من السعر المطلوب الأولي. حافظ على المفاوضات ودية ومرحة. قد يؤدي المشي بعيدًا إلى عرض أفضل."      },      "fixed_price": {        "en": "Modern shops and department stores have fixed prices. Bargaining is not appropriate in these establishments.",        "ar": "المحلات الحديثة والمتاجر الكبرى لديها أسعار ثابتة. المساومة غير مناسبة في هذه المؤسسات."      }    }  }}