{  "id": "currency_and_money",  "name": {    "en": "Egyptian Currency and Money Exchange",    "ar": "العملة المصرية وصرف الأموال"  },  "description": {    "en": "Essential information about the Egyptian currency system, exchange rates, ATMs, credit card usage, and practical advice for managing money while traveling in Egypt. Understanding these financial aspects can help visitors navigate payments, avoid scams, and budget effectively during their stay.",    "ar": "معلومات أساسية حول نظام العملة المصرية، وأسعار الصرف، وأجهزة الصراف الآلي، واستخدام بطاقات الائتمان، ونصائح عملية لإدارة الأموال أثناء السفر في مصر. فهم هذه الجوانب المالية يمكن أن يساعد الزوار على التعامل مع المدفوعات، وتجنب عمليات الاحتيال، ووضع ميزانية فعالة خلال إقامتهم."  },  "currency_information": {    "official_currency": {      "name": {        "en": "Egyptian Pound (EGP)",        "ar": "الجنيه المصري"      },      "code": "EGP",      "symbol": "£E or ج.م",      "description": {        "en": "The Egyptian Pound (EGP) is the official currency of Egypt. It is subdivided into 100 piastres (pronounced 'pee-aster'). Due to inflation, piastres are now rarely used except in very small transactions.",        "ar": "الجنيه المصري هو العملة الرسمية لمصر. وينقسم إلى 100 قرش. بسبب التضخم، نادرًا ما تستخدم القروش الآن إلا في المعاملات الصغيرة جدًا."      }    },    "banknotes": {      "en": "Current Egyptian banknotes are issued in denominations of 1, 5, 10, 20, 50, 100, 200, and recently 1000 Egyptian pounds. The newer notes feature stronger security features and have both Arabic and English text. Each denomination has a distinct color and size, making them easy to distinguish. Notes feature famous Egyptian landmarks, historical figures, and cultural symbols.",      "ar": "تصدر الأوراق النقدية المصرية الحالية بفئات 1 و5 و10 و20 و50 و100 و200، ومؤخرًا 1000 جنيه مصري. تتميز الأوراق النقدية الأحدث بميزات أمان أقوى وتحتوي على نصوص باللغتين العربية والإنجليزية. لكل فئة لون وحجم مميز، مما يجعلها سهلة التمييز. تظهر الأوراق النقدية معالم مصرية شهيرة وشخصيات تاريخية ورموز ثقافية."    },    "coins": {      "en": "Coins are available in denominations of 25 piastres, 50 piastres, and 1 pound. Due to inflation, coins of smaller values (1, 5, 10, and 20 piastres) exist but are rarely used in daily transactions.",      "ar": "تتوفر العملات المعدنية بفئات 25 قرشًا و50 قرشًا وجنيه واحد. بسبب التضخم، توجد عملات معدنية ذات قيم أصغر (1 و5 و10 و20 قرشًا) ولكنها نادرًا ما تستخدم في المعاملات اليومية."    },    "exchange_rate": {      "en": "The exchange rate of the Egyptian Pound has been subject to significant fluctuations in recent years. It's recommended to check current rates before travel using reliable financial services or apps. Since late 2016, the Egyptian pound has been floating (not pegged to the US dollar), which means rates can change daily.",      "ar": "خضع سعر صرف الجنيه المصري لتقلبات كبيرة في السنوات الأخيرة. يُنصح بالتحقق من الأسعار الحالية قبل السفر باستخدام خدمات أو تطبيقات مالية موثوقة. منذ أواخر عام 2016، أصبح الجنيه المصري عائمًا (غير مرتبط بالدولار الأمريكي)، مما يعني أن الأسعار يمكن أن تتغير يوميًا."    }  },  "money_exchange": {    "where_to_exchange": {      "en": "Currency can be exchanged at banks, official exchange offices, many hotels, and some post offices. Airport exchange offices are convenient but may offer slightly less favorable rates. Banks typically offer the best official rates but may have longer waiting times. Avoid exchanging money with street vendors or unauthorized individuals, as this is illegal and risky.",      "ar": "يمكن تبديل العملة في البنوك ومكاتب الصرافة الرسمية والعديد من الفنادق وبعض مكاتب البريد. مكاتب الصرافة في المطار مريحة ولكنها قد تقدم أسعارًا أقل ملاءمة قليلاً. عادة ما تقدم البنوك أفضل الأسعار الرسمية ولكن قد يكون وقت الانتظار أطول. تجنب استبدال المال مع باعة الشوارع أو الأفراد غير المصرح لهم، لأن هذا غير قانوني ومحفوف بالمخاطر."    },    "documentation_needed": {      "en": "When exchanging currency at banks or official exchange offices, you'll typically need to show your passport. Some places may also ask for the receipt from your previous exchange if you're converting Egyptian pounds back to foreign currency.",      "ar": "عند تبديل العملة في البنوك أو مكاتب الصرافة الرسمية، ستحتاج عادةً إلى إظهار جواز سفرك. قد تطلب بعض الأماكن أيضًا إيصال التبادل السابق إذا كنت تحول الجنيهات المصرية مرة أخرى إلى عملة أجنبية."    },    "acceptable_currencies": {      "en": "US Dollars and Euros are the most widely accepted foreign currencies for exchange in Egypt. British Pounds, Saudi Riyals, and UAE Dirhams are also commonly exchanged. Other currencies may be accepted at major banks and exchange offices but with less favorable rates.",      "ar": "الدولار الأمريكي واليورو هما أكثر العملات الأجنبية قبولًا للتبادل في مصر. كما يتم تداول الجنيه البريطاني والريال السعودي والدرهم الإماراتي بشكل شائع. قد يتم قبول عملات أخرى في البنوك الكبرى ومكاتب الصرافة ولكن بأسعار أقل ملاءمة."    },    "exchange_tips": {      "en": "Compare rates at different locations before exchanging large amounts. Keep your exchange receipts, especially if you plan to convert Egyptian pounds back to your home currency. Count your money carefully before leaving the exchange counter. Consider exchanging just enough for immediate needs and use ATMs for additional cash as needed.",      "ar": "قارن الأسعار في مواقع مختلفة قبل تبادل مبالغ كبيرة. احتفظ بإيصالات الصرف، خاصة إذا كنت تخطط لتحويل الجنيهات المصرية مرة أخرى إلى عملة بلدك. عد أموالك بعناية قبل مغادرة منصة الصرافة. فكر في تبادل ما يكفي فقط للاحتياجات الفورية واستخدام أجهزة الصراف الآلي للحصول على نقود إضافية حسب الحاجة."    }  },  "atms_and_banking": {    "atm_availability": {      "en": "ATMs are widely available in Egyptian cities, tourist areas, shopping malls, and hotels. Major banks like the National Bank of Egypt, Banque Misr, CIB, and international banks have extensive ATM networks. In remote areas or smaller towns, ATM availability may be limited, so plan accordingly.",      "ar": "تتوفر أجهزة الصراف الآلي على نطاق واسع في المدن المصرية والمناطق السياحية ومراكز التسوق والفنادق. تمتلك البنوك الكبرى مثل البنك الأهلي المصري وبنك مصر والبنك التجاري الدولي والبنوك الدولية شبكات واسعة من أجهزة الصراف الآلي. في المناطق النائية أو المدن الصغيرة، قد تكون إمكانية الوصول إلى أجهزة الصراف الآلي محدودة، لذا خطط وفقًا لذلك."    },    "withdrawal_limits": {      "en": "Most Egyptian ATMs have a daily withdrawal limit of 2,000-3,000 EGP for foreign cards, although this can vary by bank. Some premium ATMs in tourist areas and upscale hotels may offer higher withdrawal limits. Multiple withdrawals can be made from different ATMs if necessary, though each transaction may incur fees.",      "ar": "معظم أجهزة الصراف الآلي المصرية لديها حد سحب يومي يتراوح بين 2000 و3000 جنيه مصري للبطاقات الأجنبية، على الرغم من أن هذا قد يختلف حسب البنك. قد توفر بعض أجهزة الصراف الآلي المتميزة في المناطق السياحية والفنادق الفاخرة حدود سحب أعلى. يمكن إجراء عمليات سحب متعددة من أجهزة صراف آلي مختلفة إذا لزم الأمر، على الرغم من أن كل معاملة قد تتحمل رسومًا."    },    "banking_hours": {      "en": "Egyptian banks typically operate from 8:30 AM to 2:00 PM, Sunday through Thursday. Some branches in malls or tourist areas may have extended hours. Banks are closed on Fridays, Saturdays, and public holidays. During Ramadan, banking hours are typically shortened.",      "ar": "تعمل البنوك المصرية عادةً من الساعة 8:30 صباحًا حتى 2:00 ظهرًا، من الأحد إلى الخميس. قد يكون لبعض الفروع في مراكز التسوق أو المناطق السياحية ساعات عمل ممتدة. البنوك مغلقة أيام الجمعة والسبت والعطلات الرسمية. خلال شهر رمضان، عادة ما يتم تقصير ساعات عمل البنوك."    },    "atm_fees_and_security": {      "en": "Using foreign cards at Egyptian ATMs typically incurs fees from both the Egyptian bank (approximately 3-5% of the withdrawal amount) and potentially your home bank. Using ATMs attached to bank branches during daylight hours is generally safer. Shield the keypad when entering your PIN and be aware of your surroundings. Contact your bank immediately if your card is lost, stolen, or retained by an ATM.",      "ar": "يتضمن استخدام البطاقات الأجنبية في أجهزة الصراف الآلي المصرية عادةً رسومًا من البنك المصري (حوالي 3-5٪ من مبلغ السحب) وربما من البنك الذي تتعامل معه في بلدك. يعتبر استخدام أجهزة الصراف الآلي الملحقة بفروع البنوك خلال ساعات النهار أكثر أمانًا بشكل عام. قم بتغطية لوحة المفاتيح عند إدخال رقم التعريف الشخصي الخاص بك وكن على دراية بما يحيط بك. اتصل ببنكك على الفور إذا فُقدت بطاقتك أو سُرقت أو احتفظ بها جهاز الصراف الآلي."    }  },  "payment_methods": {    "credit_cards": {      "en": "Major credit cards (Visa, MasterCard) are accepted at most hotels, upscale restaurants, and larger shops in tourist areas. American Express is less widely accepted. Many smaller establishments, local restaurants, markets, and shops in non-tourist areas accept only cash. Always carry some cash as a backup, even in places that normally accept cards.",      "ar": "يتم قبول بطاقات الائتمان الرئيسية (فيزا وماستركارد) في معظم الفنادق والمطاعم الراقية والمتاجر الكبيرة في المناطق السياحية. أمريكان إكسبريس أقل قبولًا على نطاق واسع. العديد من المؤسسات الصغيرة والمطاعم المحلية والأسواق والمتاجر في المناطق غير السياحية تقبل النقد فقط. احمل دائمًا بعض النقود كبديل، حتى في الأماكن التي تقبل البطاقات عادةً."    },    "debit_cards": {      "en": "Debit cards with Visa or MasterCard logos can be used at ATMs and for purchases where credit cards are accepted. Inform your bank of your travel plans to prevent them from blocking transactions due to unusual activity. Consider carrying multiple cards from different networks in case one is not accepted.",      "ar": "يمكن استخدام بطاقات الخصم التي تحمل شعارات فيزا أو ماستركارد في أجهزة الصراف الآلي وللمشتريات حيث يتم قبول بطاقات الائتمان. أبلغ بنكك بخطط سفرك لمنعهم من حظر المعاملات بسبب نشاط غير معتاد. فكر في حمل بطاقات متعددة من شبكات مختلفة في حالة عدم قبول إحداها."    },    "mobile_payments": {      "en": "Mobile payment options are growing in Egypt, particularly in urban areas. Services like Fawry, Vodafone Cash, and Orange Money are popular with locals but may not be easily accessible to tourists without local phone numbers. International services like Apple Pay and Google Pay have limited acceptance in Egypt.",      "ar": "تتزايد خيارات الدفع عبر الهاتف المحمول في مصر، خاصة في المناطق الحضرية. الخدمات مثل فوري وفودافون كاش وأورانج موني شائعة بين السكان المحليين ولكن قد لا يسهل الوصول إليها للسياح بدون أرقام هواتف محلية. الخدمات الدولية مثل Apple Pay و Google Pay لها قبول محدود في مصر."    },    "traveler's_checks": {      "en": "Traveler's checks are increasingly obsolete and difficult to cash in Egypt. Few banks and exchange offices accept them, and those that do may charge high fees or offer poor exchange rates. Credit/debit cards and cash are more practical options.",      "ar": "أصبحت شيكات المسافرين قديمة بشكل متزايد ويصعب صرفها في مصر. عدد قليل من البنوك ومكاتب الصرافة يقبلها، وتلك التي تقبلها قد تفرض رسومًا عالية أو تقدم أسعار صرف سيئة. بطاقات الائتمان/الخصم والنقد هي خيارات أكثر عملية."    }  },  "budgeting_and_costs": {    "cost_categories": {      "budget": {        "accommodation": "200-500 EGP per night (hostels, budget hotels)",        "meals": "50-150 EGP per meal (street food, local restaurants)",        "transportation": "5-10 EGP (public buses, metro), 20-50 EGP (short taxi rides)",        "daily_budget": "Approximately 500-1000 EGP per day"      },      "mid_range": {        "accommodation": "500-1500 EGP per night (3-star hotels, mid-range hotels)",        "meals": "150-300 EGP per meal (mid-range restaurants)",        "transportation": "100-200 EGP per day (longer taxi rides, guided transportation)",        "daily_budget": "Approximately 1000-2000 EGP per day"      },      "luxury": {        "accommodation": "1500+ EGP per night (4-5 star hotels, luxury resorts)",        "meals": "300+ EGP per meal (upscale restaurants, hotel dining)",        "transportation": "500+ EGP per day (private drivers, premium transportation)",        "daily_budget": "3000+ EGP per day and up"      }    },    "tipping_practices": {      "en": "Tipping (baksheesh) is an important part of Egyptian culture. In restaurants, a 10-15% tip is customary, even if a service charge is included on the bill. Hotel staff, tour guides, drivers, and many service providers expect tips. For hotel staff, 5-10 EGP per service is typical. Tour guides may expect 100+ EGP per day depending on group size. Having small denominations ready for tipping is recommended.",      "ar": "البقشيش جزء مهم من الثقافة المصرية. في المطاعم، من المعتاد إعطاء 10-15٪ كبقشيش، حتى إذا تم تضمين رسوم الخدمة في الفاتورة. يتوقع موظفو الفندق والمرشدون السياحيون والسائقون والعديد من مقدمي الخدمات البقشيش. بالنسبة لموظفي الفندق، 5-10 جنيه مصري لكل خدمة أمر نموذجي. قد يتوقع المرشدون السياحيون 100+ جنيه مصري يوميًا حسب حجم المجموعة. يوصى بتجهيز فئات صغيرة من النقود للبقشيش."    },    "bargaining": {      "en": "Bargaining is expected in markets, souks, and with street vendors, and even for services like taxis (agree on a price before the ride). As a general rule, start at about 50-70% of the initial asking price. Bargaining should be friendly and respectful; walking away is often part of the process. Fixed-price shops (most modern stores and supermarkets) do not accept bargaining.",      "ar": "المساومة متوقعة في الأسواق والبازارات ومع الباعة المتجولين، وحتى للخدمات مثل سيارات الأجرة (اتفق على السعر قبل الركوب). كقاعدة عامة، ابدأ بحوالي 50-70٪ من السعر المطلوب الأولي. يجب أن تكون المساومة ودية ومحترمة؛ المغادرة غالبًا ما تكون جزءًا من العملية. المتاجر ذات الأسعار الثابتة (معظم المتاجر الحديثة والسوبر ماركت) لا تقبل المساومة."    }  },  "money_safety": {    "cash_security": {      "en": "Avoid displaying large amounts of cash in public. Distribute money between different pockets, bags, or money belts. Leave extra cash, additional cards, and valuables in your hotel safe when possible. Consider keeping a small amount of 'decoy money' in an accessible pocket in case of pickpocketing.",      "ar": "تجنب إظهار مبالغ كبيرة من المال في الأماكن العامة. وزع المال بين جيوب وحقائب أو أحزمة نقود مختلفة. اترك النقود الإضافية والبطاقات الإضافية والأشياء الثمينة في خزانة الفندق عندما يكون ذلك ممكنًا. فكر في الاحتفاظ بمبلغ صغير من 'النقود الطعم' في جيب يسهل الوصول إليه في حالة النشل."    },    "fraud_prevention": {      "en": "Use ATMs located in banks or well-lit public areas. Cover the keypad when entering your PIN. Be wary of 'helpers' who offer unsolicited assistance at ATMs. Check your card statements regularly for unauthorized transactions. Be cautious of card skimming at restaurants or shops; keep your card in sight when possible.",      "ar": "استخدم أجهزة الصراف الآلي الموجودة في البنوك أو المناطق العامة جيدة الإضاءة. غطِ لوحة المفاتيح عند إدخال رقم التعريف الشخصي الخاص بك. احذر من 'المساعدين' الذين يقدمون مساعدة غير مطلوبة في أجهزة الصراف الآلي. تحقق من كشوف حساب بطاقتك بانتظام بحثًا عن معاملات غير مصرح بها. كن حذرًا من قارئات البطاقات الاحتيالية في المطاعم أو المحلات التجارية؛ أبقِ بطاقتك في مرمى البصر عندما يكون ذلك ممكنًا."    },    "scam_awareness": {      "en": "Be wary of anyone offering extremely favorable exchange rates on the street. Watch out for short-changing when receiving cash from vendors or in transactions. In taxis, insist on using the meter or agree on a fare before starting your journey. Be skeptical of unsolicited tour offers or 'special deals' from strangers, especially in tourist areas.",      "ar": "كن حذرًا من أي شخص يعرض أسعار صرف مواتية للغاية في الشارع. انتبه للغش في العد عند استلام النقود من البائعين أو في المعاملات. في سيارات الأجرة، أصر على استخدام العداد أو اتفق على الأجرة قبل بدء رحلتك. كن متشككًا في عروض الجولات غير المطلوبة أو 'الصفقات الخاصة' من الغرباء، خاصة في المناطق السياحية."    },    "emergency_preparedness": {      "en": "Keep digital copies of important financial information (card numbers, bank contact details) in a secure location or encrypted email. Have emergency contact numbers for your banks readily available. Know the location of your country's embassy or consulate. Consider having a small emergency cash reserve in your home currency or US dollars.",      "ar": "احتفظ بنسخ رقمية من المعلومات المالية المهمة (أرقام البطاقات، تفاصيل الاتصال بالبنك) في مكان آمن أو بريد إلكتروني مشفر. احتفظ بأرقام الاتصال في حالات الطوارئ لبنوكك في متناول اليد. اعرف موقع سفارة أو قنصلية بلدك. فكر في الاحتفاظ باحتياطي نقدي صغير للطوارئ بعملة بلدك أو بالدولار الأمريكي."    }  },  "additional_resources": {    "useful_apps": [      {        "name": "XE Currency",        "description": "Real-time currency converter",        "availability": "iOS, Android"      },      {        "name": "Wise (formerly TransferWise)",        "description": "For international money transfers and multi-currency accounts",        "availability": "iOS, Android"      },      {        "name": "Google Maps",        "description": "For locating nearby ATMs and bank branches",        "availability": "iOS, Android"      }    ],    "emergency_contacts": {      "credit_card_hotlines": {        "visa": "+1 303-967-1096",        "mastercard": "+1 636-722-7111",        "american_express": "+1 336-393-1111"      },      "banking_emergency": "National Bank of Egypt: 19623, Bank Misr: 19888"    }  },  "images": [    "egyptian_currency_notes.jpg",    "atm_locations_cairo.jpg",    "credit_card_payment.jpg",    "currency_exchange_office.jpg",    "market_bargaining.jpg"  ],  "currency_and_money": {    "egyptian_pound": {      "code": "EGP",      "symbol": "£E",      "arabic_symbol": "ج.م",      "denominations": {        "notes": [          {            "value": 200,            "description": {              "en": "Red-brown note featuring the Mosque of Muhammad Ali",              "ar": "ورقة نقدية بنية حمراء تعرض مسجد محمد علي"            }          },          {            "value": 100,            "description": {              "en": "Purple note featuring the Mosque of Sultan Hassan",              "ar": "ورقة نقدية بنفسجية تعرض مسجد السلطان حسن"            }          },          {            "value": 50,            "description": {              "en": "Green note featuring the Temple of Edfu",              "ar": "ورقة نقدية خضراء تعرض معبد إدفو"            }          },          {            "value": 20,            "description": {              "en": "Green note featuring the Mosque of Ibn Tulun",              "ar": "ورقة نقدية خضراء تعرض مسجد ابن طولون"            }          },          {            "value": 10,            "description": {              "en": "Brown note featuring the Mosque of Al-Rifa'i",              "ar": "ورقة نقدية بنية تعرض مسجد الرفاعي"            }          },          {            "value": 5,            "description": {              "en": "Orange note featuring the Mosque of Qaitbay",              "ar": "ورقة نقدية برتقالية تعرض مسجد قايتباي"            }          },          {            "value": 1,            "description": {              "en": "Silver-colored coin featuring the Mosque of Ahmad Ibn Tulun",              "ar": "عملة معدنية فضية اللون تعرض مسجد أحمد بن طولون"            }          },          {            "value": 0.5,            "description": {              "en": "Bronze-colored coin (50 piastres)",              "ar": "عملة معدنية برونزية اللون (50 قرش)"            }          },          {            "value": 0.25,            "description": {              "en": "Silver-colored coin (25 piastres)",              "ar": "عملة معدنية فضية اللون (25 قرش)"            }          }        ]      }    },    "money_exchange": {      "where_to_exchange": {        "banks": {          "en": "Most reliable option with official rates. Open Sunday-Thursday, usually 8:30 AM to 2:00 PM.",          "ar": "الخيار الأكثر موثوقية مع الأسعار الرسمية. مفتوح من الأحد إلى الخميس، عادة من 8:30 صباحاً حتى 2:00 مساءً."        },        "exchange_offices": {          "en": "Found in tourist areas and shopping centers. Compare rates between multiple offices. Look for official licenses displayed.",          "ar": "موجودة في المناطق السياحية ومراكز التسوق. قارن الأسعار بين عدة مكاتب. ابحث عن التراخيص الرسمية المعروضة."        },        "hotels": {          "en": "Convenient but usually offer less favorable rates. Best for small amounts or emergencies.",          "ar": "مريحة ولكن عادة ما تقدم أسعاراً أقل ملاءمة. الأفضل للمبالغ الصغيرة أو حالات الطوارئ."        }      },      "tips": {        "en": [          "Always ask for a receipt",          "Count money carefully before leaving",          "Avoid street money changers",          "Check current rates online before exchanging",          "Some places may not accept damaged or old foreign bills"        ],        "ar": [          "اطلب دائماً إيصالاً",          "عد النقود بعناية قبل المغادرة",          "تجنب الصرافين في الشارع",          "تحقق من الأسعار الحالية عبر الإنترنت قبل الصرف",          "قد لا تقبل بعض الأماكن الأوراق النقدية الأجنبية التالفة أو القديمة"        ]      }    },    "payment_methods": {      "cash": {        "en": "Cash is king in Egypt. Small shops, taxis, and markets usually only accept cash. Keep small denominations for tips and small purchases.",        "ar": "النقد هو الملك في مصر. المحلات الصغيرة وسيارات الأجرة والأسواق عادة ما تقبل النقد فقط. احتفظ بفئات صغيرة للإكراميات والمشتريات الصغيرة."      },      "credit_cards": {        "accepted": {          "en": "Widely accepted in hotels, larger restaurants, and shopping centers. Visa and Mastercard are most common.",          "ar": "مقبولة على نطاق واسع في الفنادق والمطاعم الكبيرة ومراكز التسوق. فيزا وماستركارد هي الأكثر شيوعاً."        },        "security": {          "en": "Inform your bank of travel plans. Use cards only in established businesses. Keep receipts for all transactions.",          "ar": "أبلغ بنكك بخطط السفر. استخدم البطاقات فقط في الشركات المعروفة. احتفظ بإيصالات جميع المعاملات."        }      },      "atms": {        "availability": {          "en": "Widely available in cities and tourist areas. Look for ATMs inside or attached to banks for better security.",          "ar": "متوفرة على نطاق واسع في المدن والمناطق السياحية. ابحث عن أجهزة الصراف الآلي داخل البنوك أو المتصلة بها لأمان أفضل."        },        "tips": {          "en": [            "Use ATMs during daylight hours",            "Avoid standalone ATMs in tourist areas",            "Check for card skimming devices",            "Keep withdrawal receipts"          ],          "ar": [            "استخدم أجهزة الصراف الآلي خلال ساعات النهار",            "تجنب أجهزة الصراف الآلي المنفردة في المناطق السياحية",            "تحقق من وجود أجهزة نسخ البطاقات",            "احتفظ بإيصالات السحب"          ]        }      }    },    "tipping": {      "general_guidelines": {        "en": "Tipping (baksheesh) is an important part of Egyptian culture. Service workers often rely on tips to supplement their income.",        "ar": "البقشيش جزء مهم من الثقافة المصرية. غالباً ما يعتمد عمال الخدمة على البقشيش لتكملة دخلهم."      },      "recommended_amounts": {        "restaurants": {          "en": "10-15% of bill if service charge not included",          "ar": "10-15٪ من الفاتورة إذا لم تكن رسوم الخدمة مشمولة"        },        "hotel_staff": {          "en": "£E 20-50 per service (porters, room service)",          "ar": "20-50 جنيه مصري لكل خدمة (الحمالين، خدمة الغرف)"        },        "tour_guides": {          "en": "£E 100-200 per day for group tours",          "ar": "100-200 جنيه مصري في اليوم للجولات الجماعية"        },        "taxi_drivers": {          "en": "Round up fare or add 10%",          "ar": "تقريب الأجرة أو إضافة 10٪"        }      }    },    "budgeting": {      "daily_costs": {        "budget": {          "en": "£E 400-800 per day (basic accommodations, local food, public transport)",          "ar": "400-800 جنيه مصري في اليوم (إقامة أساسية، طعام محلي، مواصلات عامة)"        },        "mid_range": {          "en": "£E 800-2000 per day (3-star hotels, restaurants, some activities)",          "ar": "800-2000 جنيه مصري في اليوم (فنادق 3 نجوم، مطاعم، بعض الأنشطة)"        },        "luxury": {          "en": "£E 2000+ per day (4-5 star hotels, fine dining, private tours)",          "ar": "2000+ جنيه مصري في اليوم (فنادق 4-5 نجوم، مطاعم فاخرة، جولات خاصة)"        }      },      "common_expenses": {        "meals": {          "street_food": "£E 20-50",          "local_restaurant": "£E 50-150",          "mid_range_restaurant": "£E 150-400",          "high_end_restaurant": "£E 400+"        },        "transportation": {          "metro_ticket": "£E 5-10",          "short_taxi_ride": "£E 20-50",          "day_tour": "£E 500-1500"        },        "attractions": {          "museum_entry": "£E 100-200",          "archaeological_sites": "£E 100-240"        }      }    }  }}