{  "health_and_safety": {    "medical_information": {      "healthcare_system": {        "en": "Egypt has both public and private healthcare facilities. Private hospitals in major cities generally offer better quality care and are recommended for tourists. Many doctors speak English, particularly in private facilities.",        "ar": "لدى مصر مرافق رعاية صحية عامة وخاصة. المستشفيات الخاصة في المدن الكبرى عادةً ما تقدم رعاية أفضل جودة ويوصى بها للسياح. العديد من الأطباء يتحدثون الإنجليزية، خاصة في المرافق الخاصة."      },      "recommended_vaccinations": {        "routine": [          "MMR (Measles, Mumps, Rubella)",          "DPT (Diphtheria, Pertussis, Tetanus)",          "Polio",          "Influenza"        ],        "additional": ["Hepatitis A", "Hepatitis B", "Typhoid"],        "note": {          "en": "Consult your healthcare provider at least 4-6 weeks before travel for personalized advice.",          "ar": "استشر مقدم الرعاية الصحية الخاص بك قبل 4-6 أسابيع على الأقل من السفر للحصول على نصيحة شخصية."        }      },      "emergency_contacts": {        "ambulance": "123",        "police": "122",        "tourist_police": "126",        "fire_department": "180"      },      "pharmacies": {        "en": "Pharmacies are widely available in cities and towns. Many medications are available over the counter. Look for pharmacies with the green cross sign. Some major chains operate 24/7.",        "ar": "الصيدليات متوفرة على نطاق واسع في المدن والبلدات. العديد من الأدوية متاحة بدون وصفة طبية. ابحث عن الصيدليات التي تحمل علامة الصليب الأخضر. بعض السلاسل الكبرى تعمل على مدار 24 ساعة."      }    },    "common_health_concerns": {      "travelers_diarrhea": {        "prevention": {          "en": "Drink bottled water, avoid tap water, eat fully cooked foods, avoid raw vegetables unless properly cleaned, and use bottled water for brushing teeth.",          "ar": "اشرب المياه المعبأة، تجنب مياه الصنبور، تناول الأطعمة المطبوخة جيداً، تجنب الخضروات النيئة ما لم يتم تنظيفها بشكل صحيح، واستخدم المياه المعبأة لتنظيف الأسنان."        },        "treatment": {          "en": "Stay hydrated, use oral rehydration salts, and seek medical attention if symptoms persist or are severe.",          "ar": "حافظ على الترطيب، استخدم أملاح الإماهة الفموية، واطلب العناية الطبية إذا استمرت الأعراض أو كانت شديدة."        }      },      "heat_related": {        "prevention": {          "en": "Stay hydrated, avoid midday sun, wear light clothing and sunscreen, take regular breaks in air-conditioned spaces.",          "ar": "حافظ على الترطيب، تجنب شمس الظهيرة، ارتدِ ملابس خفيفة وواقي من الشمس، خذ فترات راحة منتظمة في الأماكن المكيفة."        },        "symptoms": [          "Headache",          "Dizziness",          "Nausea",          "Excessive sweating",          "Rapid heartbeat"        ]      }    },    "safety_tips": {      "general_safety": {        "en": "Egypt is generally safe for tourists, but normal precautions should be taken. Keep valuables in hotel safes, be aware of your surroundings, and avoid walking alone at night in unfamiliar areas.",        "ar": "مصر آمنة عموماً للسياح، ولكن يجب اتخاذ الاحتياطات العادية. احتفظ بالأشياء الثمينة في خزائن الفندق، وكن على دراية بمحيطك، وتجنب المشي وحدك ليلاً في المناطق غير المألوفة."      },      "transportation_safety": {        "taxis": {          "en": "Use official taxis or ride-sharing apps. Agree on fare before starting journey with regular taxis. Keep small bills for payment.",          "ar": "استخدم سيارات الأجرة الرسمية أو تطبيقات مشاركة الركوب. اتفق على الأجرة قبل بدء الرحلة مع سيارات الأجرة العادية. احتفظ بفئات نقدية صغيرة للدفع."        },        "public_transport": {          "en": "Be extra vigilant in crowded public transportation. Keep belongings close and be aware of pickpockets.",          "ar": "كن شديد اليقظة في وسائل النقل العام المزدحمة. احتفظ بمتعلقاتك قريبة وكن على دراية بالنشالين."        }      },      "scams_to_avoid": {        "common_scams": [          {            "name": "Unofficial guides",            "advice": {              "en": "Only use licensed guides and book through reputable agencies",              "ar": "استخدم فقط المرشدين المرخصين واحجز من خلال الوكالات حسنة السمعة"            }          },          {            "name": "Inflated prices",            "advice": {              "en": "Research typical prices beforehand and negotiate when appropriate",              "ar": "ابحث عن الأسعار النموذجية مسبقاً وتفاوض عندما يكون ذلك مناسباً"            }          }        ]      }    },    "food_safety": {      "safe_eating": {        "recommendations": {          "en": "Eat at reputable restaurants, avoid street food unless it's freshly cooked and hot, peel fruits yourself, and avoid raw vegetables unless properly cleaned.",          "ar": "تناول الطعام في المطاعم حسنة السمعة، تجنب طعام الشارع ما لم يكن مطبوخاً حديثاً وساخناً، قشر الفواكه بنفسك، وتجنب الخضروات النيئة ما لم يتم تنظيفها بشكل صحيح."        },        "high_risk_foods": [          "Unpasteurized dairy products",          "Raw or undercooked meat",          "Unwashed vegetables",          "Tap water ice"        ]      }    },    "environmental_hazards": {      "sun_exposure": {        "en": "Egypt's sun can be intense. Use high SPF sunscreen, wear protective clothing, and limit sun exposure during peak hours (10am-4pm).",        "ar": "شمس مصر يمكن أن تكون قوية. استخدم واقي شمس بعامل حماية عالٍ، ارتدِ ملابس واقية، وحد من التعرض للشمس خلال ساعات الذروة (10 صباحاً - 4 مساءً)."      },      "desert_conditions": {        "en": "When visiting desert areas, carry plenty of water, inform others of your plans, and use a reputable guide service.",        "ar": "عند زيارة المناطق الصحراوية، احمل الكثير من الماء، أخبر الآخرين بخططك، واستخدم خدمة مرشد حسن السمعة."      }    },    "emergency_preparedness": {      "important_documents": {        "en": "Keep copies of passport, travel insurance, and important contact numbers. Consider having digital copies accessible online.",        "ar": "احتفظ بنسخ من جواز السفر وتأمين السفر وأرقام الاتصال المهمة. فكر في الاحتفاظ بنسخ رقمية يمكن الوصول إليها عبر الإنترنت."      },      "travel_insurance": {        "en": "Comprehensive travel insurance is strongly recommended. Ensure it covers medical evacuation and treatment in private facilities.",        "ar": "يوصى بشدة بتأمين سفر شامل. تأكد من أنه يغطي الإخلاء الطبي والعلاج في المرافق الخاصة."      }    }  }}