{  "id": "safety_general",  "topic": "General Safety Tips for Tourists in Egypt",  "points": [    {      "id": "petty_theft",      "summary": {        "en": "Be aware of your surroundings, especially in crowded areas like markets (souks) and public transport, to avoid pickpocketing. Keep valuables secure and out of sight.",        "ar": "كن على دراية بمحيطك، خاصة في المناطق المزدحمة مثل الأسواق والمواصلات العامة، لتجنب النشل. حافظ على الأشياء الثمينة آمنة وبعيدة عن الأنظار."      }    },    {      "id": "scams",      "summary": {        "en": "Be cautious of overly friendly strangers offering unsolicited help or deals that seem too good to be true. Agree on prices beforehand for taxis and services where possible.",        "ar": "كن حذرًا من الغرباء الودودين بشكل مفرط الذين يقدمون مساعدة غير مرغوب فيها أو صفقات تبدو جيدة جدًا لدرجة يصعب تصديقها. اتفق على الأسعار مسبقًا لسيارات الأجرة والخدمات حيثما أمكن ذلك."      }    },    {      "id": "traffic",      "summary": {        "en": "Traffic in major cities like Cairo can be chaotic. Exercise extreme caution when crossing streets. Look both ways multiple times, even on one-way streets.",        "ar": "يمكن أن تكون حركة المرور في المدن الكبرى مثل القاهرة فوضوية. توخ الحذر الشديد عند عبور الشوارع. انظر في كلا الاتجاهين عدة مرات، حتى في الشوارع ذات الاتجاه الواحد."      }    },    {      "id": "hydration_sun",      "summary": {        "en": "Egypt is hot and sunny. Drink plenty of bottled water to stay hydrated. Use high SPF sunscreen, wear hats, and sunglasses, especially during midday.",        "ar": "مصر حارة ومشمسة. اشرب الكثير من المياه المعبأة للبقاء رطبًا. استخدم واقيًا من الشمس بعامل حماية عالٍ (SPF)، وارتد قبعات ونظارات شمسية، خاصة خلال منتصف النهار."      }    },    {      "id": "food_water",      "summary": {        "en": "Drink only bottled or filtered water. Be cautious with street food; choose vendors that look clean and busy. Peel fruits and vegetables or wash them thoroughly with safe water.",        "ar": "اشرب المياه المعبأة أو المفلترة فقط. كن حذرًا مع طعام الشارع؛ اختر البائعين الذين يبدون نظيفين ومزدحمين. قشر الفواكه والخضروات أو اغسلها جيدًا بمياه آمنة."      }    },    {      "id": "solo_female_travelers",      "summary": {        "en": "Solo female travelers may receive unwanted attention. Dressing modestly can help minimize this. Avoid walking alone in isolated areas, especially at night. Consider using ride-sharing apps with tracking features.",        "ar": "قد تتلقى المسافرات المنفردات اهتمامًا غير مرغوب فيه. يمكن أن يساعد ارتداء ملابس محتشمة في تقليل ذلك. تجنبي المشي بمفردك في مناطق معزولة، خاصة في الليل. فكري في استخدام تطبيقات مشاركة الركوب التي تحتوي على ميزات التتبع."      }    },    {      "id": "emergency_numbers",      "summary": {        "en": "Tourist Police: 126, Ambulance: 123, Fire Department: 180. Keep these numbers handy.",        "ar": "شرطة السياحة: 126، الإسعاف: 123، المطافئ: 180. احتفظ بهذه الأرقام في متناول يدك."      }    }  ],  "tags": [    "practical_info",    "safety",    "egypt",    "travel_tips",    "health",    "security"  ],  "last_updated": "YYYY-MM-DDTHH:MM:SSZ"}